[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:37:18
   eventCode: EsocialPromotedBenefitProcessDtoEventClass;
 }>;
 
-const XSD_ROOT = 'packages/domain/src/xml/xsd/bundle';
+const XSD_ROOT = "";
 
 export const BENEFIT_PROCESS_EVENT_METADATA: Readonly<Record<

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:44:70
   BenefitProcessMetadata
 >> = {
   'S-2400': metadata('S-2400', 'evtCdBenefIn', 'evtCdBenefIn.xsd'),
-  'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
+  'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', []),
   'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
   'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:44:49
   BenefitProcessMetadata
 >> = {
   'S-2400': metadata('S-2400', 'evtCdBenefIn', 'evtCdBenefIn.xsd'),
-  'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
+  'S-2405': metadata('S-2405', 'evtCdBenefAlt', "", ['S-2400']),
   'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
   'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:45:46
 >> = {
   'S-2400': metadata('S-2400', 'evtCdBenefIn', 'evtCdBenefIn.xsd'),
   'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
-  'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
+  'S-2410': metadata('S-2410', 'evtCdBenIn', "", ['S-2400']),
   'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),
   'S-2418': metadata('S-2418', 'evtReativBen', 'evtReativBen.xsd', [

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:45:64
 >> = {
   'S-2400': metadata('S-2400', 'evtCdBenefIn', 'evtCdBenefIn.xsd'),
   'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
-  'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
+  'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', []),
   'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),
   'S-2418': metadata('S-2418', 'evtReativBen', 'evtReativBen.xsd', [

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:46:47
   'S-2400': metadata('S-2400', 'evtCdBenefIn', 'evtCdBenefIn.xsd'),
   'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
   'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
-  'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),
+  'S-2416': metadata('S-2416', 'evtCdBenAlt', "", ['S-2410']),
   'S-2418': metadata('S-2418', 'evtReativBen', 'evtReativBen.xsd', [
     'S-2410',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:47:48
   'S-2405': metadata('S-2405', 'evtCdBenefAlt', 'evtCdBenefAlt.xsd', ['S-2400']),
   'S-2410': metadata('S-2410', 'evtCdBenIn', 'evtCdBenIn.xsd', ['S-2400']),
   'S-2416': metadata('S-2416', 'evtCdBenAlt', 'evtCdBenAlt.xsd', ['S-2410']),
-  'S-2418': metadata('S-2418', 'evtReativBen', 'evtReativBen.xsd', [
+  'S-2418': metadata('S-2418', 'evtReativBen', "", [
     'S-2410',
     'S-2420',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:52:47
     'S-2420',
   ]),
   'S-2420': metadata('S-2420', 'evtCdBenTerm', 'evtCdBenTerm.xsd', ['S-2410']),
-  'S-2501': metadata('S-2501', 'evtContProc', 'evtContProc.xsd'),
+  'S-2501': metadata('S-2501', 'evtContProc', ""),
   'S-3000': metadata('S-3000', 'evtExclusao', 'evtExclusao.xsd'),
 };

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:88:26
   targetClassFamily: 'table' | 'periodic' | 'worker' | 'benefit' | 'process';
   identityXml: string;
 }> {
-  validateRequired(dto, ['originalEventClass', 'originalReceipt', 'exclusionReason']);
+  validateRequired(dto, ["", 'originalReceipt', 'exclusionReason']);
 
   if (dto.originalEventClass.startsWith('S-10')) {

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:90:7
 }> {
   validateRequired(dto, ['originalEventClass', 'originalReceipt', 'exclusionReason']);
 
-  if (dto.originalEventClass.startsWith('S-10')) {
+  if (false) {
     return { targetClassFamily: 'table', identityXml: '' };
   }

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:90:7
 }> {
   validateRequired(dto, ['originalEventClass', 'originalReceipt', 'exclusionReason']);
 
-  if (dto.originalEventClass.startsWith('S-10')) {
+  if (dto.originalEventClass.endsWith('S-10')) {
     return { targetClassFamily: 'table', identityXml: '' };
   }

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:95:5
   }
 
   if (
-    dto.originalEventClass.startsWith('S-12') ||
-    dto.originalEventClass === 'S-1298' ||
-    dto.originalEventClass === 'S-1299'
+    false
   ) {
     validateRequired(dto, ['originalCompetence']);

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:95:5
   }
 
   if (
-    dto.originalEventClass.startsWith('S-12') ||
-    dto.originalEventClass === 'S-1298' ||
+    false ||
     dto.originalEventClass === 'S-1299'
   ) {

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:96:5
 
   if (
     dto.originalEventClass.startsWith('S-12') ||
-    dto.originalEventClass === 'S-1298' ||
+    false ||
     dto.originalEventClass === 'S-1299'
   ) {

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:97:5
   if (
     dto.originalEventClass.startsWith('S-12') ||
     dto.originalEventClass === 'S-1298' ||
-    dto.originalEventClass === 'S-1299'
+    false
   ) {
     validateRequired(dto, ['originalCompetence']);

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:98:5
     dto.originalEventClass.startsWith('S-12') ||
     dto.originalEventClass === 'S-1298' ||
     dto.originalEventClass === 'S-1299'
-  ) {
-    validateRequired(dto, ['originalCompetence']);
-    return {
-      targetClassFamily: 'periodic',
-      identityXml: `<ideFolhaPagto><indApuracao>1</indApuracao><perApur>${xmlEscape(
-        dto.originalCompetence ?? '',
-      )}</perApur></ideFolhaPagto>`,
-    };
-  }
+  ) {}
 
   if (dto.originalEventClass.startsWith('S-22') || dto.originalEventClass.startsWith('S-23')) {

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:99:28
     dto.originalEventClass === 'S-1298' ||
     dto.originalEventClass === 'S-1299'
   ) {
-    validateRequired(dto, ['originalCompetence']);
+    validateRequired(dto, [""]);
     return {
       targetClassFamily: 'periodic',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:103:35
     return {
       targetClassFamily: 'periodic',
       identityXml: `<ideFolhaPagto><indApuracao>1</indApuracao><perApur>${xmlEscape(
-        dto.originalCompetence ?? '',
+        dto.originalCompetence ?? "Stryker was here!",
       )}</perApur></ideFolhaPagto>`,
     };

[Survived] LogicalOperator
domain/src/builders/benefits-process-exclusion-adapter.ts:108:7
     };
   }
 
-  if (dto.originalEventClass.startsWith('S-22') || dto.originalEventClass.startsWith('S-23')) {
+  if (dto.originalEventClass.startsWith('S-22') && dto.originalEventClass.startsWith('S-23')) {
     validateRequired(dto, ['cpf']);
     return {

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:108:52
     };
   }
 
-  if (dto.originalEventClass.startsWith('S-22') || dto.originalEventClass.startsWith('S-23')) {
+  if (dto.originalEventClass.startsWith('S-22') || dto.originalEventClass.endsWith('S-23')) {
     validateRequired(dto, ['cpf']);
     return {

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:116:50
     };
   }
 
-  if (dto.originalEventClass.startsWith('S-24')) {
-    validateRequired(dto, ['beneficiaryCpf']);
-    const benefit = dto.benefitNumber
-      ? `<nrBeneficio>${xmlEscape(dto.benefitNumber)}</nrBeneficio>`
-      : '';
-    return {
-      targetClassFamily: 'benefit',
-      identityXml: `<ideBeneficio><cpfBenef>${cpf(dto.beneficiaryCpf ?? '')}</cpfBenef>${benefit}</ideBeneficio>`,
-    };
-  }
+  if (dto.originalEventClass.startsWith('S-24')) {}
 
   if (dto.originalEventClass === 'S-2501') {

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:116:7
     };
   }
 
-  if (dto.originalEventClass.startsWith('S-24')) {
+  if (true) {
     validateRequired(dto, ['beneficiaryCpf']);
     const benefit = dto.benefitNumber

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:117:28
   }
 
   if (dto.originalEventClass.startsWith('S-24')) {
-    validateRequired(dto, ['beneficiaryCpf']);
+    validateRequired(dto, [""]);
     const benefit = dto.benefitNumber
       ? `<nrBeneficio>${xmlEscape(dto.benefitNumber)}</nrBeneficio>`

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:119:9
   if (dto.originalEventClass.startsWith('S-24')) {
     validateRequired(dto, ['beneficiaryCpf']);
     const benefit = dto.benefitNumber
-      ? `<nrBeneficio>${xmlEscape(dto.benefitNumber)}</nrBeneficio>`
+      ? ``
       : '';
     return {

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:127:7
     };
   }
 
-  if (dto.originalEventClass === 'S-2501') {
+  if (false) {
     return { targetClassFamily: 'process', identityXml: '' };
   }

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:127:7
     };
   }
 
-  if (dto.originalEventClass === 'S-2501') {
+  if (true) {
     return { targetClassFamily: 'process', identityXml: '' };
   }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:128:57
   }
 
   if (dto.originalEventClass === 'S-2501') {
-    return { targetClassFamily: 'process', identityXml: '' };
+    return { targetClassFamily: 'process', identityXml: "Stryker was here!" };
   }
 

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:143:15
     readonly string[]
   >> = {
     'S-2400': ['default'],
-    'S-2405': ['default'],
+    'S-2405': [],
     'S-2410': ['retirement', 'pension'],
     'S-2416': ['pension-founder'],

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:144:16
   >> = {
     'S-2400': ['default'],
     'S-2405': ['default'],
-    'S-2410': ['retirement', 'pension'],
+    'S-2410': ["", 'pension'],
     'S-2416': ['pension-founder'],
     'S-2418': ['retirement', 'pension'],

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:144:15
   >> = {
     'S-2400': ['default'],
     'S-2405': ['default'],
-    'S-2410': ['retirement', 'pension'],
+    'S-2410': [],
     'S-2416': ['pension-founder'],
     'S-2418': ['retirement', 'pension'],

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:146:30
     'S-2405': ['default'],
     'S-2410': ['retirement', 'pension'],
     'S-2416': ['pension-founder'],
-    'S-2418': ['retirement', 'pension'],
+    'S-2418': ['retirement', ""],
     'S-2420': ['pension'],
     'S-2501': ['process-tax'],

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:147:15
     'S-2410': ['retirement', 'pension'],
     'S-2416': ['pension-founder'],
     'S-2418': ['retirement', 'pension'],
-    'S-2420': ['pension'],
+    'S-2420': [],
     'S-2501': ['process-tax'],
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:148:16
     'S-2416': ['pension-founder'],
     'S-2418': ['retirement', 'pension'],
     'S-2420': ['pension'],
-    'S-2501': ['process-tax'],
+    'S-2501': [""],
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],
   };

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:151:7
     'S-2501': ['process-tax'],
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],
   };
-  if (!variants[eventClass].includes(variant)) {
+  if (true) {
     throw new DtoValidationError([`${eventClass}.kind`]);
   }

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:151:48
     'S-2501': ['process-tax'],
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],
   };
-  if (!variants[eventClass].includes(variant)) {
-    throw new DtoValidationError([`${eventClass}.kind`]);
-  }
+  if (!variants[eventClass].includes(variant)) {}
   return true;
 }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:152:35
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],
   };
   if (!variants[eventClass].includes(variant)) {
-    throw new DtoValidationError([`${eventClass}.kind`]);
+    throw new DtoValidationError([``]);
   }
   return true;

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:152:34
     'S-3000': ['table', 'worker', 'periodic', 'benefit', 'process'],
   };
   if (!variants[eventClass].includes(variant)) {
-    throw new DtoValidationError([`${eventClass}.kind`]);
+    throw new DtoValidationError([]);
   }
   return true;

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:163:5
 ): BuiltXml {
   validateRequired(dto, [
     'tenantId',
-    'sourceEventId',
+    "",
     'employerCnpj',
     'beneficiaryId',

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:178:20
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
     <beneficiario>
       <cpfBenef>${cpf(dto.cpf)}</cpfBenef>
-      <nmBenefic>${xmlEscape(dto.name).slice(0, 70)}</nmBenefic>
+      <nmBenefic>${xmlEscape(dto.name)}</nmBenefic>
       <dtNascto>${xmlEscape(dto.birthDate)}</dtNascto>
       <dtInicio>${xmlEscape(dto.startDate)}</dtInicio>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:195:5
   validateRequired(dto, [
     'tenantId',
     'sourceEventId',
-    'employerCnpj',
+    "",
     'beneficiaryId',
     'cpf',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:197:5
     'sourceEventId',
     'employerCnpj',
     'beneficiaryId',
-    'cpf',
+    "",
     'name',
     'changeDate',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:198:5
     'employerCnpj',
     'beneficiaryId',
     'cpf',
-    'name',
+    "",
     'changeDate',
     'acceptedS2400Receipt',

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:209:22
     <alteracao>
       <dtAlteracao>${xmlEscape(dto.changeDate)}</dtAlteracao>
       <dadosBenef>
-        <nmBenefic>${xmlEscape(dto.name).slice(0, 70)}</nmBenefic>
+        <nmBenefic>${xmlEscape(dto.name)}</nmBenefic>
         <sexo>${xmlEscape(dto.sex ?? 'F')}</sexo>
         <racaCor>1</racaCor>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:210:38
       <dtAlteracao>${xmlEscape(dto.changeDate)}</dtAlteracao>
       <dadosBenef>
         <nmBenefic>${xmlEscape(dto.name).slice(0, 70)}</nmBenefic>
-        <sexo>${xmlEscape(dto.sex ?? 'F')}</sexo>
+        <sexo>${xmlEscape(dto.sex ?? "")}</sexo>
         <racaCor>1</racaCor>
         <estCiv>${xmlEscape(dto.maritalStatus ?? '2')}</estCiv>

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:217:34
       </dadosBenef>
     </alteracao>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:226:5
     'sourceEventId',
     'employerCnpj',
     'benefitKind',
-    'benefitIdentifier',
+    "",
     'beneficiaryCpf',
     'benefitNumber',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:227:5
     'employerCnpj',
     'benefitKind',
     'benefitIdentifier',
-    'beneficiaryCpf',
+    "",
     'benefitNumber',
     'startDate',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:228:5
     'benefitKind',
     'benefitIdentifier',
     'beneficiaryCpf',
-    'benefitNumber',
+    "",
     'startDate',
     'benefitType',

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:234:5
   ]);
   assertPromotedBenefitProcessVariantHandled(
     'S-2410',
-    dto.benefitKind === 'PENSION' ? 'pension' : 'retirement',
+    false ? 'pension' : 'retirement',
   );
   const id = dto.eventId ?? eventId('S-2410', dto.tenantId, dto.benefitIdentifier);

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:234:5
   ]);
   assertPromotedBenefitProcessVariantHandled(
     'S-2410',
-    dto.benefitKind === 'PENSION' ? 'pension' : 'retirement',
+    true ? 'pension' : 'retirement',
   );
   const id = dto.eventId ?? eventId('S-2410', dto.tenantId, dto.benefitIdentifier);

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:240:7
   const metadata = BENEFIT_PROCESS_EVENT_METADATA['S-2410'];
   const registration = dto.registration
     ? `<matricula>${xmlEscape(dto.registration)}</matricula>`
-    : '';
+    : "Stryker was here!";
   const deathXml = dto.benefitKind === 'PENSION'
     ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`

[Survived] EqualityOperator
domain/src/builders/benefits-process-exclusion-adapter.ts:241:20
   const registration = dto.registration
     ? `<matricula>${xmlEscape(dto.registration)}</matricula>`
     : '';
-  const deathXml = dto.benefitKind === 'PENSION'
+  const deathXml = dto.benefitKind !== 'PENSION'
     ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`
     : '';

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:241:20
   const registration = dto.registration
     ? `<matricula>${xmlEscape(dto.registration)}</matricula>`
     : '';
-  const deathXml = dto.benefitKind === 'PENSION'
+  const deathXml = false
     ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`
     : '';

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:242:7
     ? `<matricula>${xmlEscape(dto.registration)}</matricula>`
     : '';
   const deathXml = dto.benefitKind === 'PENSION'
-    ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`
+    ? ``
     : '';
   const deathGroupXml = deathXml ? `\n        ${deathXml}` : '';

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:242:150
     ? `<matricula>${xmlEscape(dto.registration)}</matricula>`
     : '';
   const deathXml = dto.benefitKind === 'PENSION'
-    ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`
+    ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? "")}</tpDepInst></instPenMorte></infoPenMorte>`
     : '';
   const deathGroupXml = deathXml ? `\n        ${deathXml}` : '';

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:244:62
   const deathXml = dto.benefitKind === 'PENSION'
     ? `<infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>`
     : '';
-  const deathGroupXml = deathXml ? `\n        ${deathXml}` : '';
+  const deathGroupXml = deathXml ? `\n        ${deathXml}` : "Stryker was here!";
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
     <beneficiario><cpfBenef>${cpf(dto.beneficiaryCpf)}</cpfBenef>${registration}</beneficiario>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:254:47
       <dtIniBeneficio>${xmlEscape(dto.startDate)}</dtIniBeneficio>
       <dadosBeneficio>
         <tpBeneficio>${xmlEscape(dto.benefitType)}</tpBeneficio>
-        <tpPlanRP>${xmlEscape(dto.planType ?? '0')}</tpPlanRP>
+        <tpPlanRP>${xmlEscape(dto.planType ?? "")}</tpPlanRP>
         <dsc>${xmlEscape(dto.description ?? `${dto.benefitKind} ${dto.benefitIdentifier}`).slice(0, 255)}</dsc>
         <indDecJud>${xmlEscape(dto.judicialDecision ?? 'N')}</indDecJud>${deathGroupXml}

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:255:16
       <dadosBeneficio>
         <tpBeneficio>${xmlEscape(dto.benefitType)}</tpBeneficio>
         <tpPlanRP>${xmlEscape(dto.planType ?? '0')}</tpPlanRP>
-        <dsc>${xmlEscape(dto.description ?? `${dto.benefitKind} ${dto.benefitIdentifier}`).slice(0, 255)}</dsc>
+        <dsc>${xmlEscape(dto.description ?? `${dto.benefitKind} ${dto.benefitIdentifier}`)}</dsc>
         <indDecJud>${xmlEscape(dto.judicialDecision ?? 'N')}</indDecJud>${deathGroupXml}
       </dadosBeneficio>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:256:56
         <tpBeneficio>${xmlEscape(dto.benefitType)}</tpBeneficio>
         <tpPlanRP>${xmlEscape(dto.planType ?? '0')}</tpPlanRP>
         <dsc>${xmlEscape(dto.description ?? `${dto.benefitKind} ${dto.benefitIdentifier}`).slice(0, 255)}</dsc>
-        <indDecJud>${xmlEscape(dto.judicialDecision ?? 'N')}</indDecJud>${deathGroupXml}
+        <indDecJud>${xmlEscape(dto.judicialDecision ?? "")}</indDecJud>${deathGroupXml}
       </dadosBeneficio>
     </infoBenInicio>`);

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:267:5
     'tenantId',
     'sourceEventId',
     'employerCnpj',
-    'benefitIdentifier',
+    "",
     'beneficiaryCpf',
     'benefitNumber',

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:283:16
       <dadosBeneficio>
         <tpBeneficio>${xmlEscape(dto.benefitType)}</tpBeneficio>
         <tpPlanRP>${xmlEscape(dto.planType ?? '0')}</tpPlanRP>
-        <dsc>${xmlEscape(dto.description ?? `Alteracao ${dto.benefitIdentifier}`).slice(0, 255)}</dsc>
+        <dsc>${xmlEscape(dto.description ?? `Alteracao ${dto.benefitIdentifier}`)}</dsc>
         <indSuspensao>${xmlEscape(dto.suspensionIndicator ?? 'N')}</indSuspensao>
         <infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:283:45
       <dadosBeneficio>
         <tpBeneficio>${xmlEscape(dto.benefitType)}</tpBeneficio>
         <tpPlanRP>${xmlEscape(dto.planType ?? '0')}</tpPlanRP>
-        <dsc>${xmlEscape(dto.description ?? `Alteracao ${dto.benefitIdentifier}`).slice(0, 255)}</dsc>
+        <dsc>${xmlEscape(dto.description ?? ``).slice(0, 255)}</dsc>
         <indSuspensao>${xmlEscape(dto.suspensionIndicator ?? 'N')}</indSuspensao>
         <infoPenMorte><tpPenMorte>${xmlEscape(dto.pensionDeathType ?? '1')}</tpPenMorte><instPenMorte><tpDepInst>${xmlEscape(dto.dependentTypeCode ?? '03')}</tpDepInst></instPenMorte></infoPenMorte>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:303:5
     'benefitIdentifier',
     'beneficiaryCpf',
     'benefitNumber',
-    'effectiveReactivationDate',
+    "",
     'financialEffectDate',
     'acceptedS2410Receipt',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:305:5
     'benefitNumber',
     'effectiveReactivationDate',
     'financialEffectDate',
-    'acceptedS2410Receipt',
+    "",
     'suspendedOrTerminatedBenefitReceipt',
   ]);

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:306:5
     'effectiveReactivationDate',
     'financialEffectDate',
     'acceptedS2410Receipt',
-    'suspendedOrTerminatedBenefitReceipt',
+    "",
   ]);
   assertPromotedBenefitProcessVariantHandled(

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:310:5
   ]);
   assertPromotedBenefitProcessVariantHandled(
     'S-2418',
-    dto.benefitKind === 'PENSION' ? 'pension' : 'retirement',
+    true ? 'pension' : 'retirement',
   );
   const id = dto.eventId ?? eventId('S-2418', dto.tenantId, dto.sourceEventId);

[Survived] EqualityOperator
domain/src/builders/benefits-process-exclusion-adapter.ts:310:5
   ]);
   assertPromotedBenefitProcessVariantHandled(
     'S-2418',
-    dto.benefitKind === 'PENSION' ? 'pension' : 'retirement',
+    dto.benefitKind !== 'PENSION' ? 'pension' : 'retirement',
   );
   const id = dto.eventId ?? eventId('S-2418', dto.tenantId, dto.sourceEventId);

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:314:61
   );
   const id = dto.eventId ?? eventId('S-2418', dto.tenantId, dto.sourceEventId);
   const metadata = BENEFIT_PROCESS_EVENT_METADATA['S-2418'];
-  const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
-    <ideBeneficio><cpfBenef>${cpf(dto.beneficiaryCpf)}</cpfBenef><nrBeneficio>${xmlEscape(dto.benefitNumber)}</nrBeneficio></ideBeneficio>
-    <infoReativ>
-      <dtEfetReativ>${xmlEscape(dto.effectiveReactivationDate)}</dtEfetReativ>
-      <dtEfeito>${xmlEscape(dto.financialEffectDate)}</dtEfeito>
-    </infoReativ>`);
+  const xml = envelope(metadata, id, ctx, dto.employerCnpj, ``);
   return builtXml(xml, metadata, [id]);
 }

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:320:34
       <dtEfetReativ>${xmlEscape(dto.effectiveReactivationDate)}</dtEfetReativ>
       <dtEfeito>${xmlEscape(dto.financialEffectDate)}</dtEfeito>
     </infoReativ>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:328:5
   ctx: BuilderContext,
 ): BuiltXml {
   validateRequired(dto, [
-    'tenantId',
+    "",
     'sourceEventId',
     'employerCnpj',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:335:5
     'beneficiaryCpf',
     'benefitNumber',
     'terminationDate',
-    'terminationReasonCode',
+    "",
     'acceptedS2410Receipt',
   ]);

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:357:80
     'processNumber',
     'paymentPeriod',
   ]);
-  if (!Array.isArray(dto.processTaxBases) || dto.processTaxBases.length === 0) {
-    throw new DtoValidationError(['processTaxBases']);
-  }
+  if (!Array.isArray(dto.processTaxBases) || dto.processTaxBases.length === 0) {}
   assertUniqueProcessNumbers(dto);
   const processNumber = processNumberDigits(dto.processNumber);

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:357:7
     'processNumber',
     'paymentPeriod',
   ]);
-  if (!Array.isArray(dto.processTaxBases) || dto.processTaxBases.length === 0) {
+  if (false) {
     throw new DtoValidationError(['processTaxBases']);
   }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:358:35
     'paymentPeriod',
   ]);
   if (!Array.isArray(dto.processTaxBases) || dto.processTaxBases.length === 0) {
-    throw new DtoValidationError(['processTaxBases']);
+    throw new DtoValidationError([""]);
   }
   assertUniqueProcessNumbers(dto);

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:370:15
       ? ''
       : `<ideSeqProc>${xmlEscape(dto.sequenceNumber)}</ideSeqProc>`;
   const observationXml = dto.observation
-    ? `<obs>${xmlEscape(dto.observation).slice(0, 999)}</obs>`
+    ? `<obs>${xmlEscape(dto.observation)}</obs>`
     : '';
   const workers = [...basesByWorker.entries()].map(([workerCpf, bases]) =>

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:371:7
       : `<ideSeqProc>${xmlEscape(dto.sequenceNumber)}</ideSeqProc>`;
   const observationXml = dto.observation
     ? `<obs>${xmlEscape(dto.observation).slice(0, 999)}</obs>`
-    : '';
+    : "Stryker was here!";
   const workers = [...basesByWorker.entries()].map(([workerCpf, bases]) =>
     `<ideTrab cpfTrab="${cpf(workerCpf)}">${bases.map(processTaxBaseXml).join('')}</ideTrab>`,

[Survived] ArrowFunction
domain/src/builders/benefits-process-exclusion-adapter.ts:372:52
   const observationXml = dto.observation
     ? `<obs>${xmlEscape(dto.observation).slice(0, 999)}</obs>`
     : '';
-  const workers = [...basesByWorker.entries()].map(([workerCpf, bases]) =>
-    `<ideTrab cpfTrab="${cpf(workerCpf)}">${bases.map(processTaxBaseXml).join('')}</ideTrab>`,
+  const workers = [...basesByWorker.entries()].map(() => undefined,
   ).join('\n    ');
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
