[Survived] BlockStatement
domain/src/operations/replay.ts:68:39
   messages: readonly TPayload[],
   filters: DlqListFilters = {},
 ): readonly TPayload[] {
-  return messages.filter((message) => {
-    if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
-    if (filters.eventClass && message.event_class !== filters.eventClass) return false;
-    if (filters.classification && dlqClassification(message) !== filters.classification) {
-      return false;
-    }
-    return true;
-  });
+  return messages.filter((message) => {});
 }
 

[Survived] MethodExpression
domain/src/operations/replay.ts:68:10
   messages: readonly TPayload[],
   filters: DlqListFilters = {},
 ): readonly TPayload[] {
-  return messages.filter((message) => {
-    if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
-    if (filters.eventClass && message.event_class !== filters.eventClass) return false;
-    if (filters.classification && dlqClassification(message) !== filters.classification) {
-      return false;
-    }
-    return true;
-  });
+  return messages;
 }
 

[Survived] ConditionalExpression
domain/src/operations/replay.ts:69:9
   filters: DlqListFilters = {},
 ): readonly TPayload[] {
   return messages.filter((message) => {
-    if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
+    if (false) return false;
     if (filters.eventClass && message.event_class !== filters.eventClass) return false;
     if (filters.classification && dlqClassification(message) !== filters.classification) {

[Survived] EqualityOperator
domain/src/operations/replay.ts:69:29
   filters: DlqListFilters = {},
 ): readonly TPayload[] {
   return messages.filter((message) => {
-    if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
+    if (filters.tenantId && message.tenant_id === filters.tenantId) return false;
     if (filters.eventClass && message.event_class !== filters.eventClass) return false;
     if (filters.classification && dlqClassification(message) !== filters.classification) {

[Survived] ConditionalExpression
domain/src/operations/replay.ts:70:31
 ): readonly TPayload[] {
   return messages.filter((message) => {
     if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
-    if (filters.eventClass && message.event_class !== filters.eventClass) return false;
+    if (filters.eventClass && true) return false;
     if (filters.classification && dlqClassification(message) !== filters.classification) {
       return false;

[Survived] EqualityOperator
domain/src/operations/replay.ts:70:31
 ): readonly TPayload[] {
   return messages.filter((message) => {
     if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
-    if (filters.eventClass && message.event_class !== filters.eventClass) return false;
+    if (filters.eventClass && message.event_class === filters.eventClass) return false;
     if (filters.classification && dlqClassification(message) !== filters.classification) {
       return false;

[Survived] ConditionalExpression
domain/src/operations/replay.ts:71:35
   return messages.filter((message) => {
     if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
     if (filters.eventClass && message.event_class !== filters.eventClass) return false;
-    if (filters.classification && dlqClassification(message) !== filters.classification) {
+    if (filters.classification && true) {
       return false;
     }

[Survived] EqualityOperator
domain/src/operations/replay.ts:71:35
   return messages.filter((message) => {
     if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
     if (filters.eventClass && message.event_class !== filters.eventClass) return false;
-    if (filters.classification && dlqClassification(message) !== filters.classification) {
+    if (filters.classification && dlqClassification(message) === filters.classification) {
       return false;
     }

[Survived] BooleanLiteral
domain/src/operations/replay.ts:72:14
     if (filters.tenantId && message.tenant_id !== filters.tenantId) return false;
     if (filters.eventClass && message.event_class !== filters.eventClass) return false;
     if (filters.classification && dlqClassification(message) !== filters.classification) {
-      return false;
+      return true;
     }
     return true;

[Survived] StringLiteral
domain/src/operations/replay.ts:117:13
     event_class: original.event_class,
     source: original.source,
     actor_id: input.replayedBy,
-    action: 'dlq.replay.requested',
+    action: "",
     status: 'pending',
     target: {

[Survived] ObjectLiteral
domain/src/operations/replay.ts:131:12
       last_classification: dlqClassification(input.dlq),
       dlq_reason: input.dlq.dlq_reason,
     },
-    after: {
-      replay_request_id: replayRequestId,
-      replay_correlation_id: replayCorrelationId,
-      replay_idempotency_key: replayIdempotencyKey,
-      replay_reason: input.replayReason,
-      idempotency_derivation: 'esocial:v1:replay:sha256(original-idempotency-key + replay-request-id)',
-    },
+    after: {},
     errors: input.dlq.errors,
     occurred_at: now.toISOString(),

[Survived] StringLiteral
domain/src/operations/replay.ts:154:13
   replayRequestId: string,
 ): string {
   return `esocial:v1:replay:${createHash('sha256')
-    .update(`${originalIdempotencyKey}:${replayRequestId}`)
+    .update(``)
     .digest('hex')}`;
 }

[Survived] BlockStatement
domain/src/operations/replay.ts:163:20
   completedIdempotencyKeys: readonly string[];
   force?: boolean | undefined;
 }>): ReplayClashDecision {
-  if (input.force) {
-    return {
-      action: 'allow',
-      reason: 'force=true bypassed completed idempotency-key clash protection.',
-    };
-  }
+  if (input.force) {}
   const completed = input.completedIdempotencyKeys.find(
     (value) => value === input.originalIdempotencyKey,

[Survived] ConditionalExpression
domain/src/operations/replay.ts:163:7
   completedIdempotencyKeys: readonly string[];
   force?: boolean | undefined;
 }>): ReplayClashDecision {
-  if (input.force) {
+  if (false) {
     return {
       action: 'allow',

[Survived] ArrowFunction
domain/src/operations/replay.ts:170:5
     };
   }
   const completed = input.completedIdempotencyKeys.find(
-    (value) => value === input.originalIdempotencyKey,
+    () => undefined,
   );
   if (completed) {

[Survived] ConditionalExpression
domain/src/operations/replay.ts:170:16
     };
   }
   const completed = input.completedIdempotencyKeys.find(
-    (value) => value === input.originalIdempotencyKey,
+    (value) => false,
   );
   if (completed) {

[Survived] BlockStatement
domain/src/operations/replay.ts:172:18
   const completed = input.completedIdempotencyKeys.find(
     (value) => value === input.originalIdempotencyKey,
   );
-  if (completed) {
-    return {
-      action: 'refuse',
-      reason: 'Original idempotency key has a completed run; replay requires force=true.',
-      completedIdempotencyKey: completed,
-    };
-  }
+  if (completed) {}
   return {
     action: 'allow',

[Survived] StringLiteral
domain/src/operations/replay.ts:175:15
   if (completed) {
     return {
       action: 'refuse',
-      reason: 'Original idempotency key has a completed run; replay requires force=true.',
+      reason: "",
       completedIdempotencyKey: completed,
     };

[Survived] BlockStatement
domain/src/operations/replay.ts:188:44
 export function assertReplayCompatible<TRequest extends QueueAdapterRequestEnvelope>(
   dlq: ReplayableDlqPayload<TRequest>,
 ): TRequest {
-  if (dlq.replay_hint?.eligible === false) {
-    throw new ReplaySchemaMismatchError(
-      `DLQ payload is not replayable: ${dlq.replay_hint.reason ?? 'no reason supplied'}.`,
-    );
-  }
+  if (dlq.replay_hint?.eligible === false) {}
   if (dlq.replay_hint?.schema_version &&
       dlq.replay_hint.schema_version !== ESOCIAL_CONTRACT_VERSION) {

[Survived] BooleanLiteral
domain/src/operations/replay.ts:188:37
 export function assertReplayCompatible<TRequest extends QueueAdapterRequestEnvelope>(
   dlq: ReplayableDlqPayload<TRequest>,
 ): TRequest {
-  if (dlq.replay_hint?.eligible === false) {
+  if (dlq.replay_hint?.eligible === true) {
     throw new ReplaySchemaMismatchError(
       `DLQ payload is not replayable: ${dlq.replay_hint.reason ?? 'no reason supplied'}.`,

[Survived] LogicalOperator
domain/src/operations/replay.ts:190:41
 ): TRequest {
   if (dlq.replay_hint?.eligible === false) {
     throw new ReplaySchemaMismatchError(
-      `DLQ payload is not replayable: ${dlq.replay_hint.reason ?? 'no reason supplied'}.`,
+      `DLQ payload is not replayable: ${dlq.replay_hint.reason && 'no reason supplied'}.`,
     );
   }

[Survived] StringLiteral
domain/src/operations/replay.ts:190:7
 ): TRequest {
   if (dlq.replay_hint?.eligible === false) {
     throw new ReplaySchemaMismatchError(
-      `DLQ payload is not replayable: ${dlq.replay_hint.reason ?? 'no reason supplied'}.`,
+      ``,
     );
   }

[Survived] EqualityOperator
domain/src/operations/replay.ts:194:7
     );
   }
   if (dlq.replay_hint?.schema_version &&
-      dlq.replay_hint.schema_version !== ESOCIAL_CONTRACT_VERSION) {
+      dlq.replay_hint.schema_version === ESOCIAL_CONTRACT_VERSION) {
     throw new ReplaySchemaMismatchError(
       `DLQ schema ${dlq.replay_hint.schema_version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,

[Survived] ConditionalExpression
domain/src/operations/replay.ts:194:7
     );
   }
   if (dlq.replay_hint?.schema_version &&
-      dlq.replay_hint.schema_version !== ESOCIAL_CONTRACT_VERSION) {
+      true) {
     throw new ReplaySchemaMismatchError(
       `DLQ schema ${dlq.replay_hint.schema_version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,

[Survived] StringLiteral
domain/src/operations/replay.ts:196:7
   if (dlq.replay_hint?.schema_version &&
       dlq.replay_hint.schema_version !== ESOCIAL_CONTRACT_VERSION) {
     throw new ReplaySchemaMismatchError(
-      `DLQ schema ${dlq.replay_hint.schema_version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,
+      ``,
     );
   }

[Survived] StringLiteral
domain/src/operations/replay.ts:200:41
     );
   }
   if (!dlq.original_envelope) {
-    throw new ReplaySchemaMismatchError('DLQ payload does not carry original_envelope.');
+    throw new ReplaySchemaMismatchError("");
   }
   if (dlq.original_envelope.version !== ESOCIAL_CONTRACT_VERSION) {

[Survived] BlockStatement
domain/src/operations/replay.ts:202:67
   if (!dlq.original_envelope) {
     throw new ReplaySchemaMismatchError('DLQ payload does not carry original_envelope.');
   }
-  if (dlq.original_envelope.version !== ESOCIAL_CONTRACT_VERSION) {
-    throw new ReplaySchemaMismatchError(
-      `Original envelope version ${dlq.original_envelope.version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,
-    );
-  }
+  if (dlq.original_envelope.version !== ESOCIAL_CONTRACT_VERSION) {}
   if (dlq.original_envelope.family !== 'request') {
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');

[Survived] EqualityOperator
domain/src/operations/replay.ts:202:7
   if (!dlq.original_envelope) {
     throw new ReplaySchemaMismatchError('DLQ payload does not carry original_envelope.');
   }
-  if (dlq.original_envelope.version !== ESOCIAL_CONTRACT_VERSION) {
+  if (dlq.original_envelope.version === ESOCIAL_CONTRACT_VERSION) {
     throw new ReplaySchemaMismatchError(
       `Original envelope version ${dlq.original_envelope.version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,

[Survived] StringLiteral
domain/src/operations/replay.ts:204:7
   }
   if (dlq.original_envelope.version !== ESOCIAL_CONTRACT_VERSION) {
     throw new ReplaySchemaMismatchError(
-      `Original envelope version ${dlq.original_envelope.version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,
+      ``,
     );
   }

[Survived] BlockStatement
domain/src/operations/replay.ts:207:51
       `Original envelope version ${dlq.original_envelope.version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,
     );
   }
-  if (dlq.original_envelope.family !== 'request') {
-    throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
-  }
+  if (dlq.original_envelope.family !== 'request') {}
   if (dlq.original_envelope.tenant_id !== dlq.tenant_id ||
       dlq.original_envelope.event_class !== dlq.event_class) {

[Survived] EqualityOperator
domain/src/operations/replay.ts:207:7
       `Original envelope version ${dlq.original_envelope.version} is incompatible with ${ESOCIAL_CONTRACT_VERSION}.`,
     );
   }
-  if (dlq.original_envelope.family !== 'request') {
+  if (dlq.original_envelope.family === 'request') {
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
   }

[Survived] EqualityOperator
domain/src/operations/replay.ts:210:7
   if (dlq.original_envelope.family !== 'request') {
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
   }
-  if (dlq.original_envelope.tenant_id !== dlq.tenant_id ||
+  if (dlq.original_envelope.tenant_id === dlq.tenant_id ||
       dlq.original_envelope.event_class !== dlq.event_class) {
     throw new ReplaySchemaMismatchError(

[Survived] LogicalOperator
domain/src/operations/replay.ts:210:7
   if (dlq.original_envelope.family !== 'request') {
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
   }
-  if (dlq.original_envelope.tenant_id !== dlq.tenant_id ||
-      dlq.original_envelope.event_class !== dlq.event_class) {
+  if (dlq.original_envelope.tenant_id !== dlq.tenant_id && dlq.original_envelope.event_class !== dlq.event_class) {
     throw new ReplaySchemaMismatchError(
       'DLQ envelope tenant/event class does not match original_envelope.',

[Survived] EqualityOperator
domain/src/operations/replay.ts:211:7
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
   }
   if (dlq.original_envelope.tenant_id !== dlq.tenant_id ||
-      dlq.original_envelope.event_class !== dlq.event_class) {
+      dlq.original_envelope.event_class === dlq.event_class) {
     throw new ReplaySchemaMismatchError(
       'DLQ envelope tenant/event class does not match original_envelope.',

[Survived] BlockStatement
domain/src/operations/replay.ts:211:62
     throw new ReplaySchemaMismatchError('Original envelope is not a request envelope.');
   }
   if (dlq.original_envelope.tenant_id !== dlq.tenant_id ||
-      dlq.original_envelope.event_class !== dlq.event_class) {
-    throw new ReplaySchemaMismatchError(
-      'DLQ envelope tenant/event class does not match original_envelope.',
-    );
-  }
+      dlq.original_envelope.event_class !== dlq.event_class) {}
 
   return dlq.original_envelope;
