[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:390:5
     'tenantId',
     'sourceEventId',
     'employerCnpj',
-    'originalEventClass',
+    "",
     'originalReceipt',
     'exclusionReason',

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:397:61
   const route = dispatchExclusionByOriginalClass(dto);
   const id = dto.eventId ?? eventId('S-3000', dto.tenantId, dto.sourceEventId);
   const metadata = BENEFIT_PROCESS_EVENT_METADATA['S-3000'];
-  const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
-    <infoExclusao>
-      <tpEvento>${xmlEscape(dto.originalEventClass)}</tpEvento>
-      <nrRecEvt>${xmlEscape(dto.originalReceipt)}</nrRecEvt>
-      ${route.identityXml}
-      <justificativa>${xmlEscape(dto.exclusionReason).slice(0, 255)}</justificativa>
-    </infoExclusao>`);
+  const xml = envelope(metadata, id, ctx, dto.employerCnpj, ``);
   return builtXml(xml, metadata, [id]);
 }

[Survived] MethodExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:402:24
       <tpEvento>${xmlEscape(dto.originalEventClass)}</tpEvento>
       <nrRecEvt>${xmlEscape(dto.originalReceipt)}</nrRecEvt>
       ${route.identityXml}
-      <justificativa>${xmlEscape(dto.exclusionReason).slice(0, 255)}</justificativa>
+      <justificativa>${xmlEscape(dto.exclusionReason)}</justificativa>
     </infoExclusao>`);
   return builtXml(xml, metadata, [id]);

[Survived] EqualityOperator
domain/src/builders/benefits-process-exclusion-adapter.ts:435:45
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">
   <${metadata.eventElement} Id="${id}">
-    ${ideEvento(ctx, { includeRetification: metadata.eventCode !== 'S-3000' })}
+    ${ideEvento(ctx, { includeRetification: metadata.eventCode === 'S-3000' })}
     ${ideEmpregadorXml(employerCnpj)}
 ${body}

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:435:45
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">
   <${metadata.eventElement} Id="${id}">
-    ${ideEvento(ctx, { includeRetification: metadata.eventCode !== 'S-3000' })}
+    ${ideEvento(ctx, { includeRetification: true })}
     ${ideEmpregadorXml(employerCnpj)}
 ${body}

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:451:77
     'birthDate',
     'relationshipCode',
   ]);
-  const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : '';
+  const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : "Stryker was here!";
   return `<dependente><tpDep>${xmlEscape(dependent.relationshipCode)}</tpDep><nmDep>${xmlEscape(dependent.name)}</nmDep><dtNascto>${xmlEscape(dependent.birthDate)}</dtNascto>${cpfXml}</dependente>`;
 }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:456:40
 }
 
 function processTaxBaseXml(base: S2501ProcessTaxBaseDto): string {
-  validateRequired(base, ['workerCpf', 'referencePeriod']);
+  validateRequired(base, ['workerCpf', ""]);
   const irrf = (base.irrf ?? []).map((item) => {

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:456:27
 }
 
 function processTaxBaseXml(base: S2501ProcessTaxBaseDto): string {
-  validateRequired(base, ['workerCpf', 'referencePeriod']);
+  validateRequired(base, ["", 'referencePeriod']);
   const irrf = (base.irrf ?? []).map((item) => {

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:458:48
 function processTaxBaseXml(base: S2501ProcessTaxBaseDto): string {
   validateRequired(base, ['workerCpf', 'referencePeriod']);
-  const irrf = (base.irrf ?? []).map((item) => {
-    const thirteenth = item.thirteenthAmount == null
-      ? ''
-      : ` vrCR13="${positiveMoney(item.thirteenthAmount, 'irrf.thirteenthAmount')}"`;
-    return `<infoCRIRRF tpCR="${xmlEscape(item.revenueCode)}" vrCR="${money(item.amount)}"${thirteenth}/>`;
-  }).join('');
+  const irrf = (base.irrf ?? []).map((item) => {}).join('');
   return `${calcTrib}${irrf}`;
 }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:462:12
     const thirteenth = item.thirteenthAmount == null
       ? ''
       : ` vrCR13="${positiveMoney(item.thirteenthAmount, 'irrf.thirteenthAmount')}"`;
-    return `<infoCRIRRF tpCR="${xmlEscape(item.revenueCode)}" vrCR="${money(item.amount)}"${thirteenth}/>`;
+    return ``;
   }).join('');
   return `${calcTrib}${irrf}`;

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:471:29
   bases: readonly S2501ProcessTaxBaseDto[],
 ): Map<string, readonly S2501ProcessTaxBaseDto[]> {
   const grouped = new Map<string, S2501ProcessTaxBaseDto[]>();
-  for (const base of bases) {
-    const key = cpf(base.workerCpf);
-    grouped.set(key, [...(grouped.get(key) ?? []), base]);
-  }
+  for (const base of bases) {}
   return grouped;
 }

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:473:22
   const grouped = new Map<string, S2501ProcessTaxBaseDto[]>();
   for (const base of bases) {
     const key = cpf(base.workerCpf);
-    grouped.set(key, [...(grouped.get(key) ?? []), base]);
+    grouped.set(key, []);
   }
   return grouped;

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:478:68
   return grouped;
 }
 
-function assertUniqueProcessNumbers(dto: S2501ProcessTaxDto): void {
-  const numbers = [dto.processNumber, ...(dto.linkedProcessNumbers ?? [])]
-    .map(processNumberDigits);
-  if (new Set(numbers).size !== numbers.length) {
-    throw new DtoValidationError(['linkedProcessNumbers']);
-  }
-}
+function assertUniqueProcessNumbers(dto: S2501ProcessTaxDto): void {}
 
 function processNumberDigits(value: string): string {

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:481:49
 function assertUniqueProcessNumbers(dto: S2501ProcessTaxDto): void {
   const numbers = [dto.processNumber, ...(dto.linkedProcessNumbers ?? [])]
     .map(processNumberDigits);
-  if (new Set(numbers).size !== numbers.length) {
-    throw new DtoValidationError(['linkedProcessNumbers']);
-  }
+  if (new Set(numbers).size !== numbers.length) {}
 }
 

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:481:7
 function assertUniqueProcessNumbers(dto: S2501ProcessTaxDto): void {
   const numbers = [dto.processNumber, ...(dto.linkedProcessNumbers ?? [])]
     .map(processNumberDigits);
-  if (new Set(numbers).size !== numbers.length) {
+  if (false) {
     throw new DtoValidationError(['linkedProcessNumbers']);
   }

[Survived] ArrayDeclaration
domain/src/builders/benefits-process-exclusion-adapter.ts:482:34
   const numbers = [dto.processNumber, ...(dto.linkedProcessNumbers ?? [])]
     .map(processNumberDigits);
   if (new Set(numbers).size !== numbers.length) {
-    throw new DtoValidationError(['linkedProcessNumbers']);
+    throw new DtoValidationError([]);
   }
 }

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:488:7
 
 function processNumberDigits(value: string): string {
   const digits = onlyDigits(value);
-  if (digits.length !== 15 && digits.length !== 20) {
+  if (true) {
     throw new DtoValidationError(['processNumber']);
   }

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:488:7
 
 function processNumberDigits(value: string): string {
   const digits = onlyDigits(value);
-  if (digits.length !== 15 && digits.length !== 20) {
+  if (true && digits.length !== 20) {
     throw new DtoValidationError(['processNumber']);
   }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:489:35
 function processNumberDigits(value: string): string {
   const digits = onlyDigits(value);
   if (digits.length !== 15 && digits.length !== 20) {
-    throw new DtoValidationError(['processNumber']);
+    throw new DtoValidationError([""]);
   }
   return digits;

[Survived] BooleanLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:496:7
 
 function revenueCode(value: string): string {
   const digits = onlyDigits(value);
-  if (!/^\d{6}$/u.test(digits)) throw new DtoValidationError(['revenueCode']);
+  if (/^\d{6}$/u.test(digits)) throw new DtoValidationError(['revenueCode']);
   return digits;
 }

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:496:7
 
 function revenueCode(value: string): string {
   const digits = onlyDigits(value);
-  if (!/^\d{6}$/u.test(digits)) throw new DtoValidationError(['revenueCode']);
+  if (false) throw new DtoValidationError(['revenueCode']);
   return digits;
 }

[Survived] StringLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:501:52
 }
 
 function money(value: string | number): string {
-  const amount = Number(String(value).replace(',', '.'));
+  const amount = Number(String(value).replace(',', ""));
   if (!Number.isFinite(amount) || amount < 0) {
     throw new DtoValidationError(['amount']);

[Survived] ConditionalExpression
domain/src/builders/benefits-process-exclusion-adapter.ts:502:7
 
 function money(value: string | number): string {
   const amount = Number(String(value).replace(',', '.'));
-  if (!Number.isFinite(amount) || amount < 0) {
+  if (false) {
     throw new DtoValidationError(['amount']);
   }

[Survived] BlockStatement
domain/src/builders/benefits-process-exclusion-adapter.ts:502:47
 
 function money(value: string | number): string {
   const amount = Number(String(value).replace(',', '.'));
-  if (!Number.isFinite(amount) || amount < 0) {
-    throw new DtoValidationError(['amount']);
-  }
+  if (!Number.isFinite(amount) || amount < 0) {}
   return amount.toFixed(2);
 }

[Survived] BooleanLiteral
domain/src/builders/benefits-process-exclusion-adapter.ts:510:7
 
 function positiveMoney(value: string | number, fieldPath: string): string {
   const amount = Number(String(value).replace(',', '.'));
-  if (!Number.isFinite(amount) || amount <= 0) {
+  if (Number.isFinite(amount) || amount <= 0) {
     throw new DtoValidationError([fieldPath]);
   }

[Survived] EqualityOperator
domain/src/builders/benefits-process-exclusion-adapter.ts:510:35
 
 function positiveMoney(value: string | number, fieldPath: string): string {
   const amount = Number(String(value).replace(',', '.'));
-  if (!Number.isFinite(amount) || amount <= 0) {
+  if (!Number.isFinite(amount) || amount < 0) {
     throw new DtoValidationError([fieldPath]);
   }
