[Survived] StringLiteral
domain/src/observability/redaction.ts:1:23
-const XML_REDACTION = '[REDACTED_XML_PAYLOAD]';
+const XML_REDACTION = "";
 const SALARY_REDACTION = '[REDACTED_SALARY]';
 const CERTIFICATE_REDACTION = '[REDACTED_CERTIFICATE_MATERIAL]';

[Survived] Regex
domain/src/observability/redaction.ts:5:27
 const SALARY_REDACTION = '[REDACTED_SALARY]';
 const CERTIFICATE_REDACTION = '[REDACTED_CERTIFICATE_MATERIAL]';
 
-const XML_FIELD_PATTERN = /(^|_)(rawresponsexml|responsexml|xml|signedpayload|soaprequest|soapresponse)$/iu;
+const XML_FIELD_PATTERN = /(^|_)(rawresponsexml|responsexml|xml|signedpayload|soaprequest|soapresponse)/iu;
 const CERTIFICATE_MATERIAL_FIELD_PATTERN = /(privatekey|certificatepem|publickeypem|pfx|p12|secretmaterial)/iu;
 const FINGERPRINT_FIELD_PATTERN = /(certificatefingerprint|fingerprint)/iu;

[Survived] Regex
domain/src/observability/redaction.ts:11:28
 const CPF_FIELD_PATTERN = /cpf/iu;
 const CNPJ_FIELD_PATTERN = /cnpj/iu;
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
-const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
+const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\S\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;

[Survived] Regex
domain/src/observability/redaction.ts:11:28
 const CPF_FIELD_PATTERN = /cpf/iu;
 const CNPJ_FIELD_PATTERN = /cnpj/iu;
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
-const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
+const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[>]+>[\s\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;

[Survived] Regex
domain/src/observability/redaction.ts:12:31
 const CNPJ_FIELD_PATTERN = /cnpj/iu;
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
-const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
+const FORMATTED_CPF_PATTERN = /\b\d{3}\.\D{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
 const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;

[Survived] Regex
domain/src/observability/redaction.ts:12:31
 const CNPJ_FIELD_PATTERN = /cnpj/iu;
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
-const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
+const FORMATTED_CPF_PATTERN = /\b\d\.\d{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
 const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;

[Survived] Regex
domain/src/observability/redaction.ts:13:32
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
-const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
+const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\D{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
 const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;
 

[Survived] Regex
domain/src/observability/redaction.ts:13:32
 const SALARY_FIELD_PATTERN = /(salary|salario|salário|remuneration|remuneracao|remuneração|wage|basepay|grosspay)/iu;
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
-const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
+const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d\b/gu;
 const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;
 

[Survived] Regex
domain/src/observability/redaction.ts:14:32
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
-const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;
+const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?=\d)/gu;
 
 export function redactForLog<T>(value: T): T {

[Survived] Regex
domain/src/observability/redaction.ts:14:32
 const XML_STRING_PATTERN = /<\?xml|<eSocial\b|<Envelope\b|<[^>]+>[\s\S]*<\/[^>]+>/iu;
 const FORMATTED_CPF_PATTERN = /\b\d{3}\.\d{3}\.\d{3}-\d{2}\b/gu;
 const FORMATTED_CNPJ_PATTERN = /\b\d{2}\.\d{3}\.\d{3}\/\d{4}-\d{2}\b/gu;
-const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d{11}|\d{14})(?!\d)/gu;
+const DIGIT_DOCUMENT_PATTERN = /(?<!\d)(\d|\d{14})(?!\d)/gu;
 
 export function redactForLog<T>(value: T): T {

[Survived] EqualityOperator
domain/src/observability/redaction.ts:22:7
 
 export function maskCpf(value: string): string {
   const digits = value.replace(/\D/gu, '');
-  if (digits.length !== 11) return redactDocumentStrings(value);
+  if (digits.length === 11) return redactDocumentStrings(value);
   return `${digits.slice(0, 3)}.***.***-${digits.slice(-2)}`;
 }

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:22:7
 
 export function maskCpf(value: string): string {
   const digits = value.replace(/\D/gu, '');
-  if (digits.length !== 11) return redactDocumentStrings(value);
+  if (false) return redactDocumentStrings(value);
   return `${digits.slice(0, 3)}.***.***-${digits.slice(-2)}`;
 }

[Survived] MethodExpression
domain/src/observability/redaction.ts:23:43
 export function maskCpf(value: string): string {
   const digits = value.replace(/\D/gu, '');
   if (digits.length !== 11) return redactDocumentStrings(value);
-  return `${digits.slice(0, 3)}.***.***-${digits.slice(-2)}`;
+  return `${digits.slice(0, 3)}.***.***-${digits}`;
 }
 

[Survived] UnaryOperator
domain/src/observability/redaction.ts:23:56
 export function maskCpf(value: string): string {
   const digits = value.replace(/\D/gu, '');
   if (digits.length !== 11) return redactDocumentStrings(value);
-  return `${digits.slice(0, 3)}.***.***-${digits.slice(-2)}`;
+  return `${digits.slice(0, 3)}.***.***-${digits.slice(+2)}`;
 }
 

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:28:7
 
 export function maskCnpj(value: string): string {
   const digits = value.replace(/\D/gu, '');
-  if (digits.length !== 14) return redactDocumentStrings(value);
+  if (true) return redactDocumentStrings(value);
   return `${digits.slice(0, 2)}.***.***/****-${digits.slice(-2)}`;
 }

[Survived] EqualityOperator
domain/src/observability/redaction.ts:28:7
 
 export function maskCnpj(value: string): string {
   const digits = value.replace(/\D/gu, '');
-  if (digits.length !== 14) return redactDocumentStrings(value);
+  if (digits.length === 14) return redactDocumentStrings(value);
   return `${digits.slice(0, 2)}.***.***/****-${digits.slice(-2)}`;
 }

[Survived] MethodExpression
domain/src/observability/redaction.ts:29:13
 export function maskCnpj(value: string): string {
   const digits = value.replace(/\D/gu, '');
   if (digits.length !== 14) return redactDocumentStrings(value);
-  return `${digits.slice(0, 2)}.***.***/****-${digits.slice(-2)}`;
+  return `${digits}.***.***/****-${digits.slice(-2)}`;
 }
 

[Survived] UnaryOperator
domain/src/observability/redaction.ts:29:61
 export function maskCnpj(value: string): string {
   const digits = value.replace(/\D/gu, '');
   if (digits.length !== 14) return redactDocumentStrings(value);
-  return `${digits.slice(0, 2)}.***.***/****-${digits.slice(-2)}`;
+  return `${digits.slice(0, 2)}.***.***/****-${digits.slice(+2)}`;
 }
 

[Survived] MethodExpression
domain/src/observability/redaction.ts:33:19
 }
 
 export function maskFingerprint(value: string): string {
-  const trimmed = value.trim();
+  const trimmed = value;
   return trimmed.length <= 8 ? '********' : `********${trimmed.slice(-8)}`;
 }

[Survived] MethodExpression
domain/src/observability/redaction.ts:34:56
 
 export function maskFingerprint(value: string): string {
   const trimmed = value.trim();
-  return trimmed.length <= 8 ? '********' : `********${trimmed.slice(-8)}`;
+  return trimmed.length <= 8 ? '********' : `********${trimmed}`;
 }
 

[Survived] EqualityOperator
domain/src/observability/redaction.ts:34:10
 
 export function maskFingerprint(value: string): string {
   const trimmed = value.trim();
-  return trimmed.length <= 8 ? '********' : `********${trimmed.slice(-8)}`;
+  return trimmed.length > 8 ? '********' : `********${trimmed.slice(-8)}`;
 }
 

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:38:7
 }
 
 function redactValue(value: unknown, key: string | undefined): unknown {
-  if (value === null || value === undefined) return value;
+  if (false) return value;
 
   if (typeof value === 'string') {

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:38:7
 }
 
 function redactValue(value: unknown, key: string | undefined): unknown {
-  if (value === null || value === undefined) return value;
+  if (false || value === undefined) return value;
 
   if (typeof value === 'string') {

[Survived] BlockStatement
domain/src/observability/redaction.ts:40:34
 function redactValue(value: unknown, key: string | undefined): unknown {
   if (value === null || value === undefined) return value;
 
-  if (typeof value === 'string') {
-    return redactString(value, key);
-  }
+  if (typeof value === 'string') {}
 
   if (typeof value === 'number') {

[Survived] BlockStatement
domain/src/observability/redaction.ts:44:34
     return redactString(value, key);
   }
 
-  if (typeof value === 'number') {
-    return key && SALARY_FIELD_PATTERN.test(key) ? SALARY_REDACTION : value;
-  }
+  if (typeof value === 'number') {}
 
   if (typeof value !== 'object') return value;

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:45:12
   }
 
   if (typeof value === 'number') {
-    return key && SALARY_FIELD_PATTERN.test(key) ? SALARY_REDACTION : value;
+    return false ? SALARY_REDACTION : value;
   }
 

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:45:12
   }
 
   if (typeof value === 'number') {
-    return key && SALARY_FIELD_PATTERN.test(key) ? SALARY_REDACTION : value;
+    return true ? SALARY_REDACTION : value;
   }
 

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:48:7
     return key && SALARY_FIELD_PATTERN.test(key) ? SALARY_REDACTION : value;
   }
 
-  if (typeof value !== 'object') return value;
+  if (false) return value;
 
   if (Array.isArray(value)) {

[Survived] EqualityOperator
domain/src/observability/redaction.ts:48:7
     return key && SALARY_FIELD_PATTERN.test(key) ? SALARY_REDACTION : value;
   }
 
-  if (typeof value !== 'object') return value;
+  if (typeof value === 'object') return value;
 
   if (Array.isArray(value)) {

[Survived] BlockStatement
domain/src/observability/redaction.ts:50:29
 
   if (typeof value !== 'object') return value;
 
-  if (Array.isArray(value)) {
-    return value.map((item) => redactValue(item, key));
-  }
+  if (Array.isArray(value)) {}
 
   return Object.fromEntries(

[Survived] ArrowFunction
domain/src/observability/redaction.ts:51:22
   if (typeof value !== 'object') return value;
 
   if (Array.isArray(value)) {
-    return value.map((item) => redactValue(item, key));
+    return value.map(() => undefined);
   }
 

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:63:7
 }
 
 function redactString(value: string, key: string | undefined): string {
-  if (key && XML_FIELD_PATTERN.test(normalizeKey(key))) return XML_REDACTION;
+  if (false) return XML_REDACTION;
   if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {
     return CERTIFICATE_REDACTION;

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:64:7
 
 function redactString(value: string, key: string | undefined): string {
   if (key && XML_FIELD_PATTERN.test(normalizeKey(key))) return XML_REDACTION;
-  if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {
+  if (false) {
     return CERTIFICATE_REDACTION;
   }

[Survived] BlockStatement
domain/src/observability/redaction.ts:64:74
 
 function redactString(value: string, key: string | undefined): string {
   if (key && XML_FIELD_PATTERN.test(normalizeKey(key))) return XML_REDACTION;
-  if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {
-    return CERTIFICATE_REDACTION;
-  }
+  if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {}
   if (key && FINGERPRINT_FIELD_PATTERN.test(normalizeKey(key))) {
     return maskFingerprint(value);

[Survived] BlockStatement
domain/src/observability/redaction.ts:67:65
   if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {
     return CERTIFICATE_REDACTION;
   }
-  if (key && FINGERPRINT_FIELD_PATTERN.test(normalizeKey(key))) {
-    return maskFingerprint(value);
-  }
+  if (key && FINGERPRINT_FIELD_PATTERN.test(normalizeKey(key))) {}
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:67:7
   if (key && CERTIFICATE_MATERIAL_FIELD_PATTERN.test(normalizeKey(key))) {
     return CERTIFICATE_REDACTION;
   }
-  if (key && FINGERPRINT_FIELD_PATTERN.test(normalizeKey(key))) {
+  if (false) {
     return maskFingerprint(value);
   }

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:70:7
   if (key && FINGERPRINT_FIELD_PATTERN.test(normalizeKey(key))) {
     return maskFingerprint(value);
   }
-  if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
+  if (false) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
   if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:71:7
     return maskFingerprint(value);
   }
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
-  if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
+  if (false) return maskCnpj(value);
   if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;
   if (XML_STRING_PATTERN.test(value)) return XML_REDACTION;

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:72:7
   }
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
-  if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;
+  if (false) return SALARY_REDACTION;
   if (XML_STRING_PATTERN.test(value)) return XML_REDACTION;
   return redactDocumentStrings(value);

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:72:7
   }
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
-  if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;
+  if (true) return SALARY_REDACTION;
   if (XML_STRING_PATTERN.test(value)) return XML_REDACTION;
   return redactDocumentStrings(value);

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:73:7
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
   if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;
-  if (XML_STRING_PATTERN.test(value)) return XML_REDACTION;
+  if (false) return XML_REDACTION;
   return redactDocumentStrings(value);
 }

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:73:7
   if (key && CPF_FIELD_PATTERN.test(normalizeKey(key))) return maskCpf(value);
   if (key && CNPJ_FIELD_PATTERN.test(normalizeKey(key))) return maskCnpj(value);
   if (key && SALARY_FIELD_PATTERN.test(normalizeKey(key))) return SALARY_REDACTION;
-  if (XML_STRING_PATTERN.test(value)) return XML_REDACTION;
+  if (true) return XML_REDACTION;
   return redactDocumentStrings(value);
 }

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:82:7
     .replace(FORMATTED_CNPJ_PATTERN, (match) => maskCnpj(match))
     .replace(FORMATTED_CPF_PATTERN, (match) => maskCpf(match))
     .replace(DIGIT_DOCUMENT_PATTERN, (match) =>
-      match.length === 11 ? maskCpf(match) : maskCnpj(match),
+      false ? maskCpf(match) : maskCnpj(match),
     );
 }

[Survived] ConditionalExpression
domain/src/observability/redaction.ts:82:7
     .replace(FORMATTED_CNPJ_PATTERN, (match) => maskCnpj(match))
     .replace(FORMATTED_CPF_PATTERN, (match) => maskCpf(match))
     .replace(DIGIT_DOCUMENT_PATTERN, (match) =>
-      match.length === 11 ? maskCpf(match) : maskCnpj(match),
+      true ? maskCpf(match) : maskCnpj(match),
     );
 }

[Survived] MethodExpression
domain/src/observability/redaction.ts:87:10
 }
 
 function normalizeKey(key: string): string {
-  return key.replace(/[-_\s.]/gu, '').toLowerCase();
+  return key.replace(/[-_\s.]/gu, '').toUpperCase();
 }
 

[Survived] Regex
domain/src/observability/redaction.ts:87:22
 }
 
 function normalizeKey(key: string): string {
-  return key.replace(/[-_\s.]/gu, '').toLowerCase();
+  return key.replace(/[-_\S.]/gu, '').toLowerCase();
 }
 
