[Survived] BlockStatement
domain/src/xml/security.ts:14:34
 }
 
 export function assertHardenedXml(xml: string): void {
-  if (/<!DOCTYPE\b/iu.test(xml)) {
-    throw new XmlSecurityError(
-      'XML DTD declarations are not accepted.',
-      'XML_DTD_FORBIDDEN',
-    );
-  }
+  if (/<!DOCTYPE\b/iu.test(xml)) {}
   if (/<!ENTITY\b/iu.test(xml)) {
     throw new XmlSecurityError(

[Survived] ConditionalExpression
domain/src/xml/security.ts:14:7
 }
 
 export function assertHardenedXml(xml: string): void {
-  if (/<!DOCTYPE\b/iu.test(xml)) {
+  if (false) {
     throw new XmlSecurityError(
       'XML DTD declarations are not accepted.',

[Survived] ConditionalExpression
domain/src/xml/security.ts:20:7
       'XML_DTD_FORBIDDEN',
     );
   }
-  if (/<!ENTITY\b/iu.test(xml)) {
+  if (true) {
     throw new XmlSecurityError(
       'XML entity declarations are not accepted.',

[Survived] BlockStatement
domain/src/xml/security.ts:20:33
       'XML_DTD_FORBIDDEN',
     );
   }
-  if (/<!ENTITY\b/iu.test(xml)) {
-    throw new XmlSecurityError(
-      'XML entity declarations are not accepted.',
-      'XML_ENTITY_FORBIDDEN',
-    );
-  }
+  if (/<!ENTITY\b/iu.test(xml)) {}
   if (/<\?xml-stylesheet\b/iu.test(xml)) {
     throw new XmlSecurityError(

[Survived] ConditionalExpression
domain/src/xml/security.ts:26:7
       'XML_ENTITY_FORBIDDEN',
     );
   }
-  if (/<\?xml-stylesheet\b/iu.test(xml)) {
+  if (false) {
     throw new XmlSecurityError(
       'XML stylesheet processing instructions are not accepted.',

[Survived] BlockStatement
domain/src/xml/security.ts:26:42
       'XML_ENTITY_FORBIDDEN',
     );
   }
-  if (/<\?xml-stylesheet\b/iu.test(xml)) {
-    throw new XmlSecurityError(
-      'XML stylesheet processing instructions are not accepted.',
-      'XML_STYLESHEET_FORBIDDEN',
-    );
-  }
+  if (/<\?xml-stylesheet\b/iu.test(xml)) {}
   if (/\b(?:SYSTEM|PUBLIC)\s+["']/iu.test(xml)) {
     throw new XmlSecurityError(

[Survived] StringLiteral
domain/src/xml/security.ts:28:7
   }
   if (/<\?xml-stylesheet\b/iu.test(xml)) {
     throw new XmlSecurityError(
-      'XML stylesheet processing instructions are not accepted.',
+      "",
       'XML_STYLESHEET_FORBIDDEN',
     );

[Survived] ConditionalExpression
domain/src/xml/security.ts:32:7
       'XML_STYLESHEET_FORBIDDEN',
     );
   }
-  if (/\b(?:SYSTEM|PUBLIC)\s+["']/iu.test(xml)) {
+  if (false) {
     throw new XmlSecurityError(
       'XML external identifiers are not accepted.',

[Survived] BlockStatement
domain/src/xml/security.ts:32:49
       'XML_STYLESHEET_FORBIDDEN',
     );
   }
-  if (/\b(?:SYSTEM|PUBLIC)\s+["']/iu.test(xml)) {
-    throw new XmlSecurityError(
-      'XML external identifiers are not accepted.',
-      'XML_EXTERNAL_IDENTIFIER_FORBIDDEN',
-    );
-  }
+  if (/\b(?:SYSTEM|PUBLIC)\s+["']/iu.test(xml)) {}
 
   const unresolvedEntity = xml.match(

[Survived] StringLiteral
domain/src/xml/security.ts:34:7
   }
   if (/\b(?:SYSTEM|PUBLIC)\s+["']/iu.test(xml)) {
     throw new XmlSecurityError(
-      'XML external identifiers are not accepted.',
+      "",
       'XML_EXTERNAL_IDENTIFIER_FORBIDDEN',
     );

[Survived] Regex
domain/src/xml/security.ts:40:5
   }
 
   const unresolvedEntity = xml.match(
-    /&(?!amp;|lt;|gt;|quot;|apos;|#[0-9]+;|#x[0-9a-f]+;)([A-Za-z_][\w.-]*);/iu,
+    /&(?!amp;|lt;|gt;|quot;|apos;|#[0-9]+;|#x[0-9a-f];)([A-Za-z_][\w.-]*);/iu,
   );
   if (unresolvedEntity) {

[Survived] Regex
domain/src/xml/security.ts:40:5
   }
 
   const unresolvedEntity = xml.match(
-    /&(?!amp;|lt;|gt;|quot;|apos;|#[0-9]+;|#x[0-9a-f]+;)([A-Za-z_][\w.-]*);/iu,
+    /&(?!amp;|lt;|gt;|quot;|apos;|#[0-9]+;|#x[0-9a-f]+;)([^A-Za-z_][\w.-]*);/iu,
   );
   if (unresolvedEntity) {

[Survived] BlockStatement
domain/src/xml/security.ts:42:25
   const unresolvedEntity = xml.match(
     /&(?!amp;|lt;|gt;|quot;|apos;|#[0-9]+;|#x[0-9a-f]+;)([A-Za-z_][\w.-]*);/iu,
   );
-  if (unresolvedEntity) {
-    throw new XmlSecurityError(
-      `XML entity reference ${unresolvedEntity[0]} is not accepted.`,
-      'XML_ENTITY_REFERENCE_FORBIDDEN',
-    );
-  }
+  if (unresolvedEntity) {}
 }
 

[Survived] StringLiteral
domain/src/xml/security.ts:51:31
 }
 
 export function sha256Prefixed(value: string | Buffer | Uint8Array): string {
-  return `sha256:${createHash('sha256').update(value).digest('hex')}`;
+  return `sha256:${createHash("").update(value).digest('hex')}`;
 }
 

[Survived] StringLiteral
domain/src/xml/security.ts:51:62
 }
 
 export function sha256Prefixed(value: string | Buffer | Uint8Array): string {
-  return `sha256:${createHash('sha256').update(value).digest('hex')}`;
+  return `sha256:${createHash('sha256').update(value).digest("")}`;
 }
 
