[Survived] ArrayDeclaration
domain/src/builders/periodic-adapter.ts:16:11
 
 export class MissingReceiptReference extends DtoValidationError {
   constructor(fieldPath: string) {
-    super([fieldPath]);
+    super([]);
     this.name = 'MissingReceiptReference';
   }

[Survived] StringLiteral
domain/src/builders/periodic-adapter.ts:17:17
 export class MissingReceiptReference extends DtoValidationError {
   constructor(fieldPath: string) {
     super([fieldPath]);
-    this.name = 'MissingReceiptReference';
+    this.name = "";
   }
 }

[Survived] EqualityOperator
domain/src/builders/periodic-adapter.ts:23:7
 
 export function buildPromotedPeriodicXml(dto: PeriodicEventDto): BuiltXml {
   const built = buildPeriodicEvent(dto);
-  if (built.length === 0) throw new DtoValidationError(['periodicEvents']);
+  if (built.length !== 0) throw new DtoValidationError(['periodicEvents']);
   const first = built[0];
   if (!first) throw new DtoValidationError(['periodicEvents']);

[Survived] ConditionalExpression
domain/src/builders/periodic-adapter.ts:23:7
 
 export function buildPromotedPeriodicXml(dto: PeriodicEventDto): BuiltXml {
   const built = buildPeriodicEvent(dto);
-  if (built.length === 0) throw new DtoValidationError(['periodicEvents']);
+  if (false) throw new DtoValidationError(['periodicEvents']);
   const first = built[0];
   if (!first) throw new DtoValidationError(['periodicEvents']);

[Survived] StringLiteral
domain/src/builders/periodic-adapter.ts:25:45
   const built = buildPeriodicEvent(dto);
   if (built.length === 0) throw new DtoValidationError(['periodicEvents']);
   const first = built[0];
-  if (!first) throw new DtoValidationError(['periodicEvents']);
+  if (!first) throw new DtoValidationError([""]);
   const xml = `${built.map((record) => record.xml.trimEnd()).join('\n---\n')}\n`;
   return builtXml(

[Survived] ArrowFunction
domain/src/builders/periodic-adapter.ts:26:28
   if (built.length === 0) throw new DtoValidationError(['periodicEvents']);
   const first = built[0];
   if (!first) throw new DtoValidationError(['periodicEvents']);
-  const xml = `${built.map((record) => record.xml.trimEnd()).join('\n---\n')}\n`;
+  const xml = `${built.map(() => undefined).join('\n---\n')}\n`;
   return builtXml(
     xml,

[Survived] MethodExpression
domain/src/builders/periodic-adapter.ts:26:40
   if (built.length === 0) throw new DtoValidationError(['periodicEvents']);
   const first = built[0];
   if (!first) throw new DtoValidationError(['periodicEvents']);
-  const xml = `${built.map((record) => record.xml.trimEnd()).join('\n---\n')}\n`;
+  const xml = `${built.map((record) => record.xml.trimStart()).join('\n---\n')}\n`;
   return builtXml(
     xml,
