[Survived] StringLiteral
src/builders/s1000/builder.ts:22:5
   xmlRoot: 'eSocial',
   eventElement: 'evtInfoEmpregador',
   namespace:
-    'http://www.esocial.gov.br/schema/evt/evtInfoEmpregador/v_S_01_03_00',
+    "",
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtInfoEmpregador.xsd',
   tableVersionDependencies: [],

[Survived] ArrayDeclaration
src/builders/s1000/builder.ts:24:29
   namespace:
     'http://www.esocial.gov.br/schema/evt/evtInfoEmpregador/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtInfoEmpregador.xsd',
-  tableVersionDependencies: [],
+  tableVersionDependencies: ["Stryker was here"],
 };
 

[Survived] StringLiteral
src/builders/s1000/builder.ts:34:5
   validateRequired(dto, [
     'tenantId',
     'sourceEventId',
-    'sourceEntityId',
+    "",
     'employerCnpj',
     'validityStart',

[Survived] StringLiteral
src/builders/s1000/builder.ts:75:42
   return {
     iniValid: dto.validityStart,
     classTrib: dto.taxClassification,
-    indCoop: dto.cooperativeIndicator ?? '0',
+    indCoop: dto.cooperativeIndicator ?? "",
     indConstr: dto.constructionIndicator ?? '0',
     indDesFolha: dto.payrollExemptionIndicator ?? '0',

[Survived] StringLiteral
src/builders/s1000/builder.ts:76:45
     iniValid: dto.validityStart,
     classTrib: dto.taxClassification,
     indCoop: dto.cooperativeIndicator ?? '0',
-    indConstr: dto.constructionIndicator ?? '0',
+    indConstr: dto.constructionIndicator ?? "",
     indDesFolha: dto.payrollExemptionIndicator ?? '0',
     indOptRegEletron: dto.electronicRecordOption ?? '0',

[Survived] StringLiteral
src/builders/s1000/builder.ts:77:51
     classTrib: dto.taxClassification,
     indCoop: dto.cooperativeIndicator ?? '0',
     indConstr: dto.constructionIndicator ?? '0',
-    indDesFolha: dto.payrollExemptionIndicator ?? '0',
+    indDesFolha: dto.payrollExemptionIndicator ?? "",
     indOptRegEletron: dto.electronicRecordOption ?? '0',
   };
