[Survived] StringLiteral
src/builders/s1010/builder.ts:34:5
     'tenantId',
     'sourceEventId',
     'sourceEntityId',
-    'employerCnpj',
+    "",
     'validityStart',
     'rubricCode',

[Survived] StringLiteral
src/builders/s1010/builder.ts:38:5
     'validityStart',
     'rubricCode',
     'rubricTableId',
-    'description',
+    "",
     'rubricType',
     'natureCode',

[Survived] StringLiteral
src/builders/s1010/builder.ts:40:5
     'rubricTableId',
     'description',
     'rubricType',
-    'natureCode',
+    "",
     'socialSecurityIncidence',
     'incomeTaxIncidence',

[Survived] ArrayDeclaration
src/builders/s1010/builder.ts:70:40
     </infoRubrica>
   </evtTabRubrica>
 </eSocial>`);
-  return builtXml(xml, S1010_METADATA, [id]);
+  return builtXml(xml, S1010_METADATA, []);
 }
 

[Survived] StringLiteral
src/builders/s1010/builder.ts:97:17
     codIncCP: dto.socialSecurityIncidence,
     codIncIRRF: dto.incomeTaxIncidence,
     codIncFGTS: dto.fgtsIncidence,
-    codIncCPRP: '00',
+    codIncCPRP: "",
     codIncPisPasep: dto.unionContributionIncidence ?? '11',
     tetoRemun: 'N',

[Survived] StringLiteral
src/builders/s1010/builder.ts:98:55
     codIncIRRF: dto.incomeTaxIncidence,
     codIncFGTS: dto.fgtsIncidence,
     codIncCPRP: '00',
-    codIncPisPasep: dto.unionContributionIncidence ?? '11',
+    codIncPisPasep: dto.unionContributionIncidence ?? "",
     tetoRemun: 'N',
   };

[Survived] StringLiteral
src/builders/s1010/builder.ts:99:16
     codIncFGTS: dto.fgtsIncidence,
     codIncCPRP: '00',
     codIncPisPasep: dto.unionContributionIncidence ?? '11',
-    tetoRemun: 'N',
+    tetoRemun: "",
   };
 }

[Survived] ConditionalExpression
src/builders/s1010/builder.ts:104:7
 }
 
 function rubricType(value: string): '1' | '2' | '3' | '4' {
-  if (value === 'deduction') return '2';
+  if (false) return '2';
   if (value === 'informational') return '3';
   if (value === 'informational-deduction') return '4';

[Survived] ConditionalExpression
src/builders/s1010/builder.ts:104:7
 }
 
 function rubricType(value: string): '1' | '2' | '3' | '4' {
-  if (value === 'deduction') return '2';
+  if (true) return '2';
   if (value === 'informational') return '3';
   if (value === 'informational-deduction') return '4';

[Survived] ConditionalExpression
src/builders/s1010/builder.ts:105:7
 
 function rubricType(value: string): '1' | '2' | '3' | '4' {
   if (value === 'deduction') return '2';
-  if (value === 'informational') return '3';
+  if (true) return '3';
   if (value === 'informational-deduction') return '4';
   return '1';

[Survived] ConditionalExpression
src/builders/s1010/builder.ts:105:7
 
 function rubricType(value: string): '1' | '2' | '3' | '4' {
   if (value === 'deduction') return '2';
-  if (value === 'informational') return '3';
+  if (false) return '3';
   if (value === 'informational-deduction') return '4';
   return '1';

[Survived] ConditionalExpression
src/builders/s1010/builder.ts:106:7
 function rubricType(value: string): '1' | '2' | '3' | '4' {
   if (value === 'deduction') return '2';
   if (value === 'informational') return '3';
-  if (value === 'informational-deduction') return '4';
+  if (true) return '4';
   return '1';
 }

[Survived] EqualityOperator
src/builders/s1010/builder.ts:106:7
 function rubricType(value: string): '1' | '2' | '3' | '4' {
   if (value === 'deduction') return '2';
   if (value === 'informational') return '3';
-  if (value === 'informational-deduction') return '4';
+  if (value !== 'informational-deduction') return '4';
   return '1';
 }
