[Survived] StringLiteral
src/builders/s1200/builder.ts:29:50
   eventElement: 'evtRemun',
   namespace: 'http://www.esocial.gov.br/schema/evt/evtRemun/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtRemun.xsd',
-  tableVersionDependencies: ['S-1000', 'S-1005', 'S-1010', 'S-1020'],
+  tableVersionDependencies: ['S-1000', 'S-1005', "", 'S-1020'],
 };
 

[Survived] StringLiteral
src/builders/s1200/builder.ts:29:30
   eventElement: 'evtRemun',
   namespace: 'http://www.esocial.gov.br/schema/evt/evtRemun/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtRemun.xsd',
-  tableVersionDependencies: ['S-1000', 'S-1005', 'S-1010', 'S-1020'],
+  tableVersionDependencies: ["", 'S-1005', 'S-1010', 'S-1020'],
 };
 

[Survived] StringLiteral
src/builders/s1200/builder.ts:40:5
     'tenantId',
     'sourceEventId',
     'employerCnpj',
-    'competence',
+    "",
     'payrollRunId',
     'payrollRunStatus',

[Survived] ConditionalExpression
src/builders/s1200/builder.ts:44:7
     'payrollRunId',
     'payrollRunStatus',
   ]);
-  if (dto.payrollRunStatus !== 'GENERATED') {
+  if (true) {
     throw new DtoValidationError(['payrollRunStatus']);
   }

[Survived] ConditionalExpression
src/builders/s1200/builder.ts:44:7
     'payrollRunId',
     'payrollRunStatus',
   ]);
-  if (dto.payrollRunStatus !== 'GENERATED') {
+  if (false) {
     throw new DtoValidationError(['payrollRunStatus']);
   }

[Survived] ArrowFunction
src/builders/s1200/builder.ts:49:26
   }
   const workers = requireNonEmptyArray(dto.workers, 'workers');
   const events = workers.map((worker) => mapDtoToXmlNodes(dto, worker, ctx));
-  const xml = events.map((event) => event.xml).join('---\n');
+  const xml = events.map(() => undefined).join('---\n');
   return builtXml(
     xml,

[Survived] StringLiteral
src/builders/s1200/builder.ts:49:53
   }
   const workers = requireNonEmptyArray(dto.workers, 'workers');
   const events = workers.map((worker) => mapDtoToXmlNodes(dto, worker, ctx));
-  const xml = events.map((event) => event.xml).join('---\n');
+  const xml = events.map((event) => event.xml).join("");
   return builtXml(
     xml,

[Survived] ArrayDeclaration
src/builders/s1200/builder.ts:62:28
   worker: S1200RemunerationDto['workers'][number],
   ctx: BuilderContext = {},
 ): Readonly<{ eventId: string; xml: string }> {
-  validateRequired(worker, [
-    'employeeId',
-    'cpf',
-    'registration',
-    'categoryCode',
-  ]);
+  validateRequired(worker, []);
   const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
   const id = eventId('S-1200', dto.tenantId, `${dto.payrollRunId}:${worker.employeeId}`);

[Survived] StringLiteral
src/builders/s1200/builder.ts:64:5
 ): Readonly<{ eventId: string; xml: string }> {
   validateRequired(worker, [
     'employeeId',
-    'cpf',
+    "",
     'registration',
     'categoryCode',

[Survived] StringLiteral
src/builders/s1200/builder.ts:68:56
     'registration',
     'categoryCode',
   ]);
-  const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
+  const rubrics = requireNonEmptyArray(worker.rubrics, "");
   const id = eventId('S-1200', dto.tenantId, `${dto.payrollRunId}:${worker.employeeId}`);
   const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('\n            ');

[Survived] StringLiteral
src/builders/s1200/builder.ts:69:46
     'categoryCode',
   ]);
   const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
-  const id = eventId('S-1200', dto.tenantId, `${dto.payrollRunId}:${worker.employeeId}`);
+  const id = eventId('S-1200', dto.tenantId, ``);
   const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('\n            ');
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] ArrowFunction
src/builders/s1200/builder.ts:70:32
   ]);
   const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
   const id = eventId('S-1200', dto.tenantId, `${dto.payrollRunId}:${worker.employeeId}`);
-  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('\n            ');
+  const itemsXml = rubrics.map(() => undefined).join('\n            ');
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${S1200_METADATA.namespace}">

[Survived] BooleanLiteral
src/builders/s1200/builder.ts:74:45
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${S1200_METADATA.namespace}">
   <evtRemun Id="${id}">
-    ${ideEvento(ctx, { includeRetification: true, includePeriod: dto.competence })}
+    ${ideEvento(ctx, { includeRetification: false, includePeriod: dto.competence })}
     ${ideEmpregadorXml(dto.employerCnpj)}
     <ideTrabalhador><cpfTrab>${cpf(worker.cpf)}</cpfTrab></ideTrabalhador>

[Survived] StringLiteral
src/builders/s1200/builder.ts:78:60
     ${ideEmpregadorXml(dto.employerCnpj)}
     <ideTrabalhador><cpfTrab>${cpf(worker.cpf)}</cpfTrab></ideTrabalhador>
     <dmDev>
-      <ideDmDev>${xmlEscape(worker.rubrics[0]?.ideDmDev ?? 'DM00000000000000000000')}</ideDmDev>
+      <ideDmDev>${xmlEscape(worker.rubrics[0]?.ideDmDev ?? "")}</ideDmDev>
       <codCateg>${xmlEscape(worker.categoryCode)}</codCateg>
       <infoPerApur>

[Survived] MethodExpression
src/builders/s1200/builder.ts:86:26
           <nrInsc>${fullRegistration(worker.establishmentRegistrationNumber ?? dto.employerCnpj)}</nrInsc>
           <codLotacao>${xmlEscape(worker.lotationCode ?? 'LOT01')}</codLotacao>
           <remunPerApur>
-            <matricula>${xmlEscape(worker.registration).slice(0, 30)}</matricula>
+            <matricula>${xmlEscape(worker.registration)}</matricula>
             ${itemsXml}
           </remunPerApur>

[Survived] StringLiteral
src/builders/s1200/builder.ts:98:29
 }
 
 function rubricXml(rubric: S1200RubricLineDto): string {
-  validateRequired(rubric, ['rubricCode', 'ideDmDev', 'amount']);
+  validateRequired(rubric, ["", 'ideDmDev', 'amount']);
   return `<itensRemun><codRubr>${xmlEscape(rubric.rubricCode)}</codRubr><ideTabRubr>${xmlEscape(
     rubric.rubricTableId ?? 'SGP',
