[Survived] StringLiteral
src/builders/s1299/builder.ts:21:14
   leiauteVersion: 'S-1.3',
   xmlRoot: 'eSocial',
   eventElement: 'evtFechaEvPer',
-  namespace: 'http://www.esocial.gov.br/schema/evt/evtFechaEvPer/v_S_01_03_00',
+  namespace: "",
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtFechaEvPer.xsd',
   tableVersionDependencies: ['S-1000'],

[Survived] StringLiteral
src/builders/s1299/builder.ts:22:15
   xmlRoot: 'eSocial',
   eventElement: 'evtFechaEvPer',
   namespace: 'http://www.esocial.gov.br/schema/evt/evtFechaEvPer/v_S_01_03_00',
-  xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtFechaEvPer.xsd',
+  xsdBinding: "",
   tableVersionDependencies: ['S-1000'],
   receiptDependencies: ['S-1200', 'S-1202', 'S-1207', 'S-1210'],

[Survived] StringLiteral
src/builders/s1299/builder.ts:24:35
   namespace: 'http://www.esocial.gov.br/schema/evt/evtFechaEvPer/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtFechaEvPer.xsd',
   tableVersionDependencies: ['S-1000'],
-  receiptDependencies: ['S-1200', 'S-1202', 'S-1207', 'S-1210'],
+  receiptDependencies: ['S-1200', "", 'S-1207', 'S-1210'],
 };
 

[Survived] ArrayDeclaration
src/builders/s1299/builder.ts:24:24
   namespace: 'http://www.esocial.gov.br/schema/evt/evtFechaEvPer/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtFechaEvPer.xsd',
   tableVersionDependencies: ['S-1000'],
-  receiptDependencies: ['S-1200', 'S-1202', 'S-1207', 'S-1210'],
+  receiptDependencies: [],
 };
 

[Survived] ArrayDeclaration
src/builders/s1299/builder.ts:31:25
   dto: S1299ClosureDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'employerCnpj',
-    'competence',
-    'payrollRunId',
-    'acceptedEventCounts.remuneration',
-    'acceptedEventCounts.payments',
-  ]);
+  validateRequired(dto, []);
   requireEmptyArray(dto.pendingPeriodicEvents, 'pendingPeriodicEvents');
   const nodes = mapDtoToXmlNodes(dto);

[Survived] StringLiteral
src/builders/s1299/builder.ts:36:5
     'sourceEventId',
     'employerCnpj',
     'competence',
-    'payrollRunId',
+    "",
     'acceptedEventCounts.remuneration',
     'acceptedEventCounts.payments',

[Survived] ObjectLiteral
src/builders/s1299/builder.ts:46:22
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${S1299_METADATA.namespace}">
   <evtFechaEvPer Id="${id}">
-    ${ideEvento(ctx, { includePeriod: dto.competence })}
+    ${ideEvento(ctx, {})}
     ${ideEmpregadorXml(dto.employerCnpj)}
     <infoFech>

[Survived] ArrayDeclaration
src/builders/s1299/builder.ts:57:40
     </infoFech>
   </evtFechaEvPer>
 </eSocial>`);
-  return builtXml(xml, S1299_METADATA, [id]);
+  return builtXml(xml, S1299_METADATA, []);
 }
 

[Survived] EqualityOperator
src/builders/s1299/builder.ts:65:15
   evtPgtos: 'S' | 'N';
 }> {
   return {
-    evtRemun: dto.acceptedEventCounts.remuneration > 0 ? 'S' : 'N',
+    evtRemun: dto.acceptedEventCounts.remuneration <= 0 ? 'S' : 'N',
     evtPgtos: dto.acceptedEventCounts.payments > 0 ? 'S' : 'N',
   };

[Survived] ConditionalExpression
src/builders/s1299/builder.ts:65:15
   evtPgtos: 'S' | 'N';
 }> {
   return {
-    evtRemun: dto.acceptedEventCounts.remuneration > 0 ? 'S' : 'N',
+    evtRemun: true ? 'S' : 'N',
     evtPgtos: dto.acceptedEventCounts.payments > 0 ? 'S' : 'N',
   };

[Survived] EqualityOperator
src/builders/s1299/builder.ts:66:15
 }> {
   return {
     evtRemun: dto.acceptedEventCounts.remuneration > 0 ? 'S' : 'N',
-    evtPgtos: dto.acceptedEventCounts.payments > 0 ? 'S' : 'N',
+    evtPgtos: dto.acceptedEventCounts.payments <= 0 ? 'S' : 'N',
   };
 }

[Survived] ConditionalExpression
src/builders/s1299/builder.ts:66:15
 }> {
   return {
     evtRemun: dto.acceptedEventCounts.remuneration > 0 ? 'S' : 'N',
-    evtPgtos: dto.acceptedEventCounts.payments > 0 ? 'S' : 'N',
+    evtPgtos: true ? 'S' : 'N',
   };
 }
