[Survived] StringLiteral
src/builders/s2200/builder.ts:23:14
   leiauteVersion: 'S-1.3',
   xmlRoot: 'eSocial',
   eventElement: 'evtAdmissao',
-  namespace: 'http://www.esocial.gov.br/schema/evt/evtAdmissao/v_S_01_03_00',
+  namespace: "",
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtAdmissao.xsd',
   tableVersionDependencies: ['S-1000', 'S-1030', 'S-1050'],

[Survived] StringLiteral
src/builders/s2200/builder.ts:25:30
   eventElement: 'evtAdmissao',
   namespace: 'http://www.esocial.gov.br/schema/evt/evtAdmissao/v_S_01_03_00',
   xsdBinding: 'packages/domain/src/xml/xsd/bundle/evtAdmissao.xsd',
-  tableVersionDependencies: ['S-1000', 'S-1030', 'S-1050'],
+  tableVersionDependencies: ["", 'S-1030', 'S-1050'],
 };
 

[Survived] ArrayDeclaration
src/builders/s2200/builder.ts:32:25
   dto: S2200AdmissionDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'employerCnpj',
-    'employeeId',
-    'cpf',
-    'name',
-    'birthDate',
-    'admissionDate',
-    'registration',
-    'categoryCode',
-    'contractType',
-    'jobCode',
-  ]);
+  validateRequired(dto, []);
   const nodes = mapDtoToXmlNodes(dto);
   const id = eventId('S-2200', dto.tenantId, dto.employeeId);

[Survived] StringLiteral
src/builders/s2200/builder.ts:42:5
     'birthDate',
     'admissionDate',
     'registration',
-    'categoryCode',
+    "",
     'contractType',
     'jobCode',

[Survived] StringLiteral
src/builders/s2200/builder.ts:48:62
   ]);
   const nodes = mapDtoToXmlNodes(dto);
   const id = eventId('S-2200', dto.tenantId, dto.employeeId);
-  const dependents = nodes.dependents.map(dependentXml).join('\n      ');
+  const dependents = nodes.dependents.map(dependentXml).join("");
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${S2200_METADATA.namespace}">

[Survived] BooleanLiteral
src/builders/s2200/builder.ts:52:45
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${S2200_METADATA.namespace}">
   <evtAdmissao Id="${id}">
-    ${ideEvento(ctx, { includeRetification: true })}
+    ${ideEvento(ctx, { includeRetification: false })}
     ${ideEmpregadorXml(dto.employerCnpj)}
     <trabalhador>

[Survived] MethodExpression
src/builders/s2200/builder.ts:68:20
       <contato><fonePrinc>61999998888</fonePrinc><emailPrinc>maria.silva@example.test</emailPrinc></contato>
     </trabalhador>
     <vinculo>
-      <matricula>${xmlEscape(dto.registration).slice(0, 30)}</matricula>
+      <matricula>${xmlEscape(dto.registration)}</matricula>
       <tpRegTrab>2</tpRegTrab>
       <tpRegPrev>2</tpRegPrev>

[Survived] MethodExpression
src/builders/s2200/builder.ts:88:11
   dependents: readonly S2200DependentDto[];
 }> {
   return {
-    sexo: dto.name.toLowerCase().includes('maria') ? 'F' : 'M',
+    sexo: dto.name.toUpperCase().includes('maria') ? 'F' : 'M',
     estCiv: '2',
     grauInstr: '09',

[Survived] StringLiteral
src/builders/s2200/builder.ts:90:16
   return {
     sexo: dto.name.toLowerCase().includes('maria') ? 'F' : 'M',
     estCiv: '2',
-    grauInstr: '09',
+    grauInstr: "",
     tpProv: dto.contractType.toLowerCase().includes('commission') ? '2' : '1',
     dependents: dto.dependents ? requireNonEmptyArray(dto.dependents, 'dependents') : [],

[Survived] MethodExpression
src/builders/s2200/builder.ts:91:13
     sexo: dto.name.toLowerCase().includes('maria') ? 'F' : 'M',
     estCiv: '2',
     grauInstr: '09',
-    tpProv: dto.contractType.toLowerCase().includes('commission') ? '2' : '1',
+    tpProv: dto.contractType.toUpperCase().includes('commission') ? '2' : '1',
     dependents: dto.dependents ? requireNonEmptyArray(dto.dependents, 'dependents') : [],
   };

[Survived] StringLiteral
src/builders/s2200/builder.ts:91:75
     sexo: dto.name.toLowerCase().includes('maria') ? 'F' : 'M',
     estCiv: '2',
     grauInstr: '09',
-    tpProv: dto.contractType.toLowerCase().includes('commission') ? '2' : '1',
+    tpProv: dto.contractType.toLowerCase().includes('commission') ? '2' : "",
     dependents: dto.dependents ? requireNonEmptyArray(dto.dependents, 'dependents') : [],
   };

[Survived] StringLiteral
src/builders/s2200/builder.ts:92:71
     estCiv: '2',
     grauInstr: '09',
     tpProv: dto.contractType.toLowerCase().includes('commission') ? '2' : '1',
-    dependents: dto.dependents ? requireNonEmptyArray(dto.dependents, 'dependents') : [],
+    dependents: dto.dependents ? requireNonEmptyArray(dto.dependents, "") : [],
   };
 }

[Survived] StringLiteral
src/builders/s2200/builder.ts:97:61
 }
 
 function dependentXml(dependent: S2200DependentDto, index: number): string {
-  validateRequired(dependent, ['sourceDependentId', 'name', 'birthDate', 'relationshipCode']);
+  validateRequired(dependent, ['sourceDependentId', 'name', "", 'relationshipCode']);
   const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : '';
   return `<dependente><tpDep>${xmlEscape(dependent.relationshipCode)}</tpDep><nmDep>${xmlEscape(

[Survived] StringLiteral
src/builders/s2200/builder.ts:98:77
 
 function dependentXml(dependent: S2200DependentDto, index: number): string {
   validateRequired(dependent, ['sourceDependentId', 'name', 'birthDate', 'relationshipCode']);
-  const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : '';
+  const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : "Stryker was here!";
   return `<dependente><tpDep>${xmlEscape(dependent.relationshipCode)}</tpDep><nmDep>${xmlEscape(
     dependent.name,

[Survived] EqualityOperator
src/builders/s2200/builder.ts:102:5
   return `<dependente><tpDep>${xmlEscape(dependent.relationshipCode)}</tpDep><nmDep>${xmlEscape(
     dependent.name,
   )}</nmDep><dtNascto>${xmlEscape(dependent.birthDate)}</dtNascto>${cpfXml}<depIRRF>${
-    index === 0 ? 'S' : 'N'
+    index !== 0 ? 'S' : 'N'
   }</depIRRF><depSF>N</depSF><incTrab>N</incTrab></dependente>`;
 }

[Survived] ConditionalExpression
src/builders/s2200/builder.ts:102:5
   return `<dependente><tpDep>${xmlEscape(dependent.relationshipCode)}</tpDep><nmDep>${xmlEscape(
     dependent.name,
   )}</nmDep><dtNascto>${xmlEscape(dependent.birthDate)}</dtNascto>${cpfXml}<depIRRF>${
-    index === 0 ? 'S' : 'N'
+    false ? 'S' : 'N'
   }</depIRRF><depSF>N</depSF><incTrab>N</incTrab></dependente>`;
 }
