[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:49:42
 >> = {
   'S-2205': metadata('S-2205', 'evtAltCadastral', 'evtAltCadastral.xsd'),
   'S-2206': metadata('S-2206', 'evtAltContratual', 'evtAltContratual.xsd'),
-  'S-2210': metadata('S-2210', 'evtCAT', 'evtCAT.xsd'),
+  'S-2210': metadata('S-2210', 'evtCAT', ""),
   'S-2220': metadata('S-2220', 'evtMonit', 'evtMonit.xsd'),
   'S-2230': metadata('S-2230', 'evtAfastTemp', 'evtAfastTemp.xsd'),

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:52:47
   'S-2210': metadata('S-2210', 'evtCAT', 'evtCAT.xsd'),
   'S-2220': metadata('S-2220', 'evtMonit', 'evtMonit.xsd'),
   'S-2230': metadata('S-2230', 'evtAfastTemp', 'evtAfastTemp.xsd'),
-  'S-2240': metadata('S-2240', 'evtExpRisco', 'evtExpRisco.xsd'),
+  'S-2240': metadata('S-2240', 'evtExpRisco', ""),
   'S-2298': metadata('S-2298', 'evtReintegr', 'evtReintegr.xsd', ['S-2299']),
   'S-2299': metadata('S-2299', 'evtDeslig', 'evtDeslig.xsd'),

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:53:47
   'S-2220': metadata('S-2220', 'evtMonit', 'evtMonit.xsd'),
   'S-2230': metadata('S-2230', 'evtAfastTemp', 'evtAfastTemp.xsd'),
   'S-2240': metadata('S-2240', 'evtExpRisco', 'evtExpRisco.xsd'),
-  'S-2298': metadata('S-2298', 'evtReintegr', 'evtReintegr.xsd', ['S-2299']),
+  'S-2298': metadata('S-2298', 'evtReintegr', "", ['S-2299']),
   'S-2299': metadata('S-2299', 'evtDeslig', 'evtDeslig.xsd'),
   'S-2300': metadata('S-2300', 'evtTSVInicio', 'evtTSVInicio.xsd'),

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:53:67
   'S-2220': metadata('S-2220', 'evtMonit', 'evtMonit.xsd'),
   'S-2230': metadata('S-2230', 'evtAfastTemp', 'evtAfastTemp.xsd'),
   'S-2240': metadata('S-2240', 'evtExpRisco', 'evtExpRisco.xsd'),
-  'S-2298': metadata('S-2298', 'evtReintegr', 'evtReintegr.xsd', ['S-2299']),
+  'S-2298': metadata('S-2298', 'evtReintegr', 'evtReintegr.xsd', [""]),
   'S-2299': metadata('S-2299', 'evtDeslig', 'evtDeslig.xsd'),
   'S-2300': metadata('S-2300', 'evtTSVInicio', 'evtTSVInicio.xsd'),

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:55:48
   'S-2240': metadata('S-2240', 'evtExpRisco', 'evtExpRisco.xsd'),
   'S-2298': metadata('S-2298', 'evtReintegr', 'evtReintegr.xsd', ['S-2299']),
   'S-2299': metadata('S-2299', 'evtDeslig', 'evtDeslig.xsd'),
-  'S-2300': metadata('S-2300', 'evtTSVInicio', 'evtTSVInicio.xsd'),
+  'S-2300': metadata('S-2300', 'evtTSVInicio', ""),
   'S-2306': metadata('S-2306', 'evtTSVAltContr', 'evtTSVAltContr.xsd', [
     'S-2300',

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:60:5
     'S-2300',
   ]),
   'S-2399': metadata('S-2399', 'evtTSVTermino', 'evtTSVTermino.xsd', [
-    'S-2300',
+    "",
     'S-2306',
   ]),

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:103:29
 ): true {
   const variants: Readonly<Record<EsocialPromotedWorkerDtoEventClass, readonly string[]>> = {
     'S-2205': ['default'],
-    'S-2206': ['promotion', 'transfer', 'regime-change'],
+    'S-2206': ['promotion', "", 'regime-change'],
     'S-2210': ['initial', 'death', 'reopening'],
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:105:41
     'S-2205': ['default'],
     'S-2206': ['promotion', 'transfer', 'regime-change'],
     'S-2210': ['initial', 'death', 'reopening'],
-    'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
+    'S-2220': ['admission', 'periodic', "", 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
     'S-2240': ['start', 'change', 'end'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:105:16
     'S-2205': ['default'],
     'S-2206': ['promotion', 'transfer', 'regime-change'],
     'S-2210': ['initial', 'death', 'reopening'],
-    'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
+    'S-2220': ["", 'periodic', 'return-to-work', 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
     'S-2240': ['start', 'change', 'end'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:106:33
     'S-2206': ['promotion', 'transfer', 'regime-change'],
     'S-2210': ['initial', 'death', 'reopening'],
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
-    'S-2230': ['medical-leave', 'vacation'],
+    'S-2230': ['medical-leave', ""],
     'S-2240': ['start', 'change', 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:106:16
     'S-2206': ['promotion', 'transfer', 'regime-change'],
     'S-2210': ['initial', 'death', 'reopening'],
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
-    'S-2230': ['medical-leave', 'vacation'],
+    'S-2230': ["", 'vacation'],
     'S-2240': ['start', 'change', 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:107:16
     'S-2210': ['initial', 'death', 'reopening'],
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
-    'S-2240': ['start', 'change', 'end'],
+    'S-2240': ["", 'change', 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],
     'S-2299': ['with-notice', 'without-notice'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:107:25
     'S-2210': ['initial', 'death', 'reopening'],
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
-    'S-2240': ['start', 'change', 'end'],
+    'S-2240': ['start', "", 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],
     'S-2299': ['with-notice', 'without-notice'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:108:28
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
     'S-2240': ['start', 'change', 'end'],
-    'S-2298': ['judicial', 'amnesty', 'other'],
+    'S-2298': ['judicial', "", 'other'],
     'S-2299': ['with-notice', 'without-notice'],
     'S-2300': ['intern', 'autonomous', 'council-member'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:108:39
     'S-2220': ['admission', 'periodic', 'return-to-work', 'termination'],
     'S-2230': ['medical-leave', 'vacation'],
     'S-2240': ['start', 'change', 'end'],
-    'S-2298': ['judicial', 'amnesty', 'other'],
+    'S-2298': ['judicial', 'amnesty', ""],
     'S-2299': ['with-notice', 'without-notice'],
     'S-2300': ['intern', 'autonomous', 'council-member'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:109:31
     'S-2230': ['medical-leave', 'vacation'],
     'S-2240': ['start', 'change', 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],
-    'S-2299': ['with-notice', 'without-notice'],
+    'S-2299': ['with-notice', ""],
     'S-2300': ['intern', 'autonomous', 'council-member'],
     'S-2306': ['role', 'pay', 'internship', 'workplace'],

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:110:15
     'S-2240': ['start', 'change', 'end'],
     'S-2298': ['judicial', 'amnesty', 'other'],
     'S-2299': ['with-notice', 'without-notice'],
-    'S-2300': ['intern', 'autonomous', 'council-member'],
+    'S-2300': [],
     'S-2306': ['role', 'pay', 'internship', 'workplace'],
     'S-2399': ['intern', 'autonomous', 'council-member'],

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:112:26
     'S-2299': ['with-notice', 'without-notice'],
     'S-2300': ['intern', 'autonomous', 'council-member'],
     'S-2306': ['role', 'pay', 'internship', 'workplace'],
-    'S-2399': ['intern', 'autonomous', 'council-member'],
+    'S-2399': ['intern', "", 'council-member'],
   };
   if (!variants[eventClass].includes(variant)) {

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:114:7
     'S-2306': ['role', 'pay', 'internship', 'workplace'],
     'S-2399': ['intern', 'autonomous', 'council-member'],
   };
-  if (!variants[eventClass].includes(variant)) {
+  if (false) {
     throw new DtoValidationError([`${eventClass}.kind`]);
   }

[Survived] LogicalOperator
domain/src/builders/worker-adapter.ts:131:17
       <dtAlteracao>${xmlEscape(dto.changeDate)}</dtAlteracao>
       <dadosTrabalhador>
         <nmTrab>${xmlEscape(dto.name)}</nmTrab>
-        <sexo>${dto.sex ?? 'F'}</sexo>
+        <sexo>${dto.sex && 'F'}</sexo>
         <racaCor>1</racaCor>
         <estCiv>${xmlEscape(dto.maritalStatus ?? '2')}</estCiv>

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:139:118
         <paisNac>105</paisNac>
         ${dependents}
-        <contato><fonePrinc>${xmlEscape(dto.phone ?? '61999998888')}</fonePrinc><emailPrinc>${xmlEscape(dto.email ?? 'maria.silva@example.test')}</emailPrinc></contato>
+        <contato><fonePrinc>${xmlEscape(dto.phone ?? '61999998888')}</fonePrinc><emailPrinc>${xmlEscape(dto.email ?? "")}</emailPrinc></contato>
       </dadosTrabalhador>
     </alteracao>`);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:146:71
 }
 
 function buildS2206Xml(dto: S2206ContractChangeDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'changeKind', 'changeDate', 'effectiveDate', 'description', 'jobName', 'categoryCode']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', "", 'cpf', 'registration', 'changeKind', 'changeDate', 'effectiveDate', 'description', 'jobName', 'categoryCode']);
   assertPromotedWorkerVariantHandled('S-2206', dto.changeKind);
   const id = dto.eventId ?? eventId('S-2206', dto.tenantId, dto.employeeId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:146:108
 }
 
 function buildS2206Xml(dto: S2206ContractChangeDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'changeKind', 'changeDate', 'effectiveDate', 'description', 'jobName', 'categoryCode']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', "", 'changeDate', 'effectiveDate', 'description', 'jobName', 'categoryCode']);
   assertPromotedWorkerVariantHandled('S-2206', dto.changeKind);
   const id = dto.eventId ?? eventId('S-2206', dto.tenantId, dto.employeeId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:166:116
 }
 
 function buildS2210Xml(dto: S2210CatDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'accidentDate']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', ""]);
   assertPromotedWorkerVariantHandled('S-2210', dto.kind);
   if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:166:71
 }
 
 function buildS2210Xml(dto: S2210CatDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'accidentDate']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', "", 'cpf', 'registration', 'kind', 'accidentDate']);
   assertPromotedWorkerVariantHandled('S-2210', dto.kind);
   if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:168:32
 function buildS2210Xml(dto: S2210CatDto, ctx: BuilderContext): BuiltXml {
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'accidentDate']);
   assertPromotedWorkerVariantHandled('S-2210', dto.kind);
-  if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {
+  if ((dto.kind === 'death' || dto.kind !== 'reopening') && !dto.originalReceipt) {
     throw new DtoValidationError(['originalReceipt']);
   }

[Survived] BlockStatement
domain/src/builders/worker-adapter.ts:168:83
 function buildS2210Xml(dto: S2210CatDto, ctx: BuilderContext): BuiltXml {
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'accidentDate']);
   assertPromotedWorkerVariantHandled('S-2210', dto.kind);
-  if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {
-    throw new DtoValidationError(['originalReceipt']);
-  }
+  if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {}
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2210'];

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:169:34
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'accidentDate']);
   assertPromotedWorkerVariantHandled('S-2210', dto.kind);
   if ((dto.kind === 'death' || dto.kind === 'reopening') && !dto.originalReceipt) {
-    throw new DtoValidationError(['originalReceipt']);
+    throw new DtoValidationError([]);
   }
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:173:19
   }
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2210'];
-  const isDeath = dto.kind === 'death';
+  const isDeath = false;
   const isReopen = dto.kind === 'reopening';
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:173:19
   }
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2210'];
-  const isDeath = dto.kind === 'death';
+  const isDeath = true;
   const isReopen = dto.kind === 'reopening';
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:174:20
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2210'];
   const isDeath = dto.kind === 'death';
-  const isReopen = dto.kind === 'reopening';
+  const isReopen = dto.kind !== 'reopening';
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
     ${ideVinculo(dto.cpf, dto.registration)}

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:174:20
   const id = dto.eventId ?? eventId('S-2210', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2210'];
   const isDeath = dto.kind === 'death';
-  const isReopen = dto.kind === 'reopening';
+  const isReopen = true;
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
     ${ideVinculo(dto.cpf, dto.registration)}

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:180:127
     <cat>
       <dtAcid>${xmlEscape(dto.accidentDate)}</dtAcid>
       <tpAcid>1</tpAcid>
-      <hrAcid>${xmlEscape(dto.accidentTime ?? '1030')}</hrAcid><hrsTrabAntesAcid>${xmlEscape(dto.workedHoursBeforeAccident ?? '0800')}</hrsTrabAntesAcid>
+      <hrAcid>${xmlEscape(dto.accidentTime ?? '1030')}</hrAcid><hrsTrabAntesAcid>${xmlEscape(dto.workedHoursBeforeAccident ?? "")}</hrsTrabAntesAcid>
       <tpCat>${isDeath ? '3' : isReopen ? '2' : '1'}</tpCat>
       <indCatObito>${isDeath ? 'S' : 'N'}</indCatObito>

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:181:26
       <dtAcid>${xmlEscape(dto.accidentDate)}</dtAcid>
       <tpAcid>1</tpAcid>
       <hrAcid>${xmlEscape(dto.accidentTime ?? '1030')}</hrAcid><hrsTrabAntesAcid>${xmlEscape(dto.workedHoursBeforeAccident ?? '0800')}</hrsTrabAntesAcid>
-      <tpCat>${isDeath ? '3' : isReopen ? '2' : '1'}</tpCat>
+      <tpCat>${isDeath ? "" : isReopen ? '2' : '1'}</tpCat>
       <indCatObito>${isDeath ? 'S' : 'N'}</indCatObito>
       ${isDeath ? `<dtObito>${xmlEscape(dto.deathDate ?? dto.accidentDate)}</dtObito>` : ''}

[Survived] LogicalOperator
domain/src/builders/worker-adapter.ts:184:27
       <tpCat>${isDeath ? '3' : isReopen ? '2' : '1'}</tpCat>
       <indCatObito>${isDeath ? 'S' : 'N'}</indCatObito>
       ${isDeath ? `<dtObito>${xmlEscape(dto.deathDate ?? dto.accidentDate)}</dtObito>` : ''}
-      <indComunPolicia>${(dto.policeCommunication ?? isDeath) ? 'S' : 'N'}</indComunPolicia>
+      <indComunPolicia>${(dto.policeCommunication && isDeath) ? 'S' : 'N'}</indComunPolicia>
       <codSitGeradora>000000002</codSitGeradora>
       <iniciatCAT>1</iniciatCAT>

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:184:71
       <tpCat>${isDeath ? '3' : isReopen ? '2' : '1'}</tpCat>
       <indCatObito>${isDeath ? 'S' : 'N'}</indCatObito>
       ${isDeath ? `<dtObito>${xmlEscape(dto.deathDate ?? dto.accidentDate)}</dtObito>` : ''}
-      <indComunPolicia>${(dto.policeCommunication ?? isDeath) ? 'S' : 'N'}</indComunPolicia>
+      <indComunPolicia>${(dto.policeCommunication ?? isDeath) ? 'S' : ""}</indComunPolicia>
       <codSitGeradora>000000002</codSitGeradora>
       <iniciatCAT>1</iniciatCAT>

[Survived] LogicalOperator
domain/src/builders/worker-adapter.ts:189:22
       <iniciatCAT>1</iniciatCAT>
       <obsCAT>${xmlEscape(dto.observation ?? 'Testemunha informou queda no patio')}</obsCAT>
       <ultDiaTrab>${xmlEscape(dto.accidentDate)}</ultDiaTrab>
-      <houveAfast>${(dto.causedLeave ?? !isDeath) ? 'S' : 'N'}</houveAfast>
+      <houveAfast>${(dto.causedLeave && !isDeath) ? 'S' : 'N'}</houveAfast>
       <localAcidente><tpLocal>9</tpLocal><dscLocal>Patio operacional</dscLocal><dscLograd>Local do acidente</dscLograd><nrLograd>S/N</nrLograd></localAcidente>
       <parteAtingida><codParteAting>000000001</codParteAting><lateralidade>0</lateralidade></parteAtingida>

[Survived] BooleanLiteral
domain/src/builders/worker-adapter.ts:189:41
       <iniciatCAT>1</iniciatCAT>
       <obsCAT>${xmlEscape(dto.observation ?? 'Testemunha informou queda no patio')}</obsCAT>
       <ultDiaTrab>${xmlEscape(dto.accidentDate)}</ultDiaTrab>
-      <houveAfast>${(dto.causedLeave ?? !isDeath) ? 'S' : 'N'}</houveAfast>
+      <houveAfast>${(dto.causedLeave ?? isDeath) ? 'S' : 'N'}</houveAfast>
       <localAcidente><tpLocal>9</tpLocal><dscLocal>Patio operacional</dscLocal><dscLograd>Local do acidente</dscLograd><nrLograd>S/N</nrLograd></localAcidente>
       <parteAtingida><codParteAting>000000001</codParteAting><lateralidade>0</lateralidade></parteAtingida>

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:196:34
       ${dto.originalReceipt ? `<catOrigem><nrRecCatOrig>${xmlEscape(dto.originalReceipt)}</nrRecCatOrig></catOrigem>` : ''}
     </cat>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:200:26
 }
 
 function buildS2220Xml(dto: S2220ExamDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'examDate']);
+  validateRequired(dto, ["", 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'examDate']);
   assertPromotedWorkerVariantHandled('S-2220', dto.kind);
   const examCode = { admission: '0', periodic: '1', 'return-to-work': '2', termination: '9' }[dto.kind];

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:200:92
 }
 
 function buildS2220Xml(dto: S2220ExamDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'examDate']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', "", 'kind', 'examDate']);
   assertPromotedWorkerVariantHandled('S-2220', dto.kind);
   const examCode = { admission: '0', periodic: '1', 'return-to-work': '2', termination: '9' }[dto.kind];

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:202:71
 function buildS2220Xml(dto: S2220ExamDto, ctx: BuilderContext): BuiltXml {
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'examDate']);
   assertPromotedWorkerVariantHandled('S-2220', dto.kind);
-  const examCode = { admission: '0', periodic: '1', 'return-to-work': '2', termination: '9' }[dto.kind];
+  const examCode = { admission: '0', periodic: '1', 'return-to-work': "", termination: '9' }[dto.kind];
   const id = dto.eventId ?? eventId('S-2220', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2220'];

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:213:54
         <dtAso>${xmlEscape(dto.examDate)}</dtAso>
         <resAso>${xmlEscape(dto.resultCode ?? '1')}</resAso>
-        <medico><nmMed>${xmlEscape(dto.doctorName ?? 'Dra Monitoramento')}</nmMed><nrCRM>${xmlEscape(dto.doctorCrm ?? '12345')}</nrCRM><ufCRM>${xmlEscape(dto.doctorUf ?? 'SP')}</ufCRM></medico>
+        <medico><nmMed>${xmlEscape(dto.doctorName ?? "")}</nmMed><nrCRM>${xmlEscape(dto.doctorCrm ?? '12345')}</nrCRM><ufCRM>${xmlEscape(dto.doctorUf ?? 'SP')}</ufCRM></medico>
       </aso>
     </exMedOcup>`);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:213:171
         <dtAso>${xmlEscape(dto.examDate)}</dtAso>
         <resAso>${xmlEscape(dto.resultCode ?? '1')}</resAso>
-        <medico><nmMed>${xmlEscape(dto.doctorName ?? 'Dra Monitoramento')}</nmMed><nrCRM>${xmlEscape(dto.doctorCrm ?? '12345')}</nrCRM><ufCRM>${xmlEscape(dto.doctorUf ?? 'SP')}</ufCRM></medico>
+        <medico><nmMed>${xmlEscape(dto.doctorName ?? 'Dra Monitoramento')}</nmMed><nrCRM>${xmlEscape(dto.doctorCrm ?? '12345')}</nrCRM><ufCRM>${xmlEscape(dto.doctorUf ?? "")}</ufCRM></medico>
       </aso>
     </exMedOcup>`);

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:216:34
         <medico><nmMed>${xmlEscape(dto.doctorName ?? 'Dra Monitoramento')}</nmMed><nrCRM>${xmlEscape(dto.doctorCrm ?? '12345')}</nrCRM><ufCRM>${xmlEscape(dto.doctorUf ?? 'SP')}</ufCRM></medico>
       </aso>
     </exMedOcup>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:220:85
 }
 
 function buildS2230Xml(dto: S2230LeaveDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'startDate', 'leaveReasonCode']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', "", 'registration', 'kind', 'startDate', 'leaveReasonCode']);
   assertPromotedWorkerVariantHandled('S-2230', dto.kind);
   const id = dto.eventId ?? eventId('S-2230', dto.tenantId, `${dto.employeeId}:${dto.kind}`);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:220:71
 }
 
 function buildS2230Xml(dto: S2230LeaveDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'startDate', 'leaveReasonCode']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', "", 'cpf', 'registration', 'kind', 'startDate', 'leaveReasonCode']);
   assertPromotedWorkerVariantHandled('S-2230', dto.kind);
   const id = dto.eventId ?? eventId('S-2230', dto.tenantId, `${dto.employeeId}:${dto.kind}`);

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:223:18
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'startDate', 'leaveReasonCode']);
   assertPromotedWorkerVariantHandled('S-2230', dto.kind);
   const id = dto.eventId ?? eventId('S-2230', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
-  const detail = dto.kind === 'vacation'
+  const detail = dto.kind !== 'vacation'
     ? `<perAquis><dtInicio>${xmlEscape(dto.acquisitionStart ?? '2025-01-10')}</dtInicio><dtFim>${xmlEscape(dto.acquisitionEnd ?? '2026-01-09')}</dtFim></perAquis>`
     : `<observacao>${xmlEscape(dto.observation ?? 'Licenca medica homologada')}</observacao>`;

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:223:18
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'startDate', 'leaveReasonCode']);
   assertPromotedWorkerVariantHandled('S-2230', dto.kind);
   const id = dto.eventId ?? eventId('S-2230', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
-  const detail = dto.kind === 'vacation'
+  const detail = true
     ? `<perAquis><dtInicio>${xmlEscape(dto.acquisitionStart ?? '2025-01-10')}</dtInicio><dtFim>${xmlEscape(dto.acquisitionEnd ?? '2026-01-09')}</dtFim></perAquis>`
     : `<observacao>${xmlEscape(dto.observation ?? 'Licenca medica homologada')}</observacao>`;

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:224:64
   assertPromotedWorkerVariantHandled('S-2230', dto.kind);
   const id = dto.eventId ?? eventId('S-2230', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const detail = dto.kind === 'vacation'
-    ? `<perAquis><dtInicio>${xmlEscape(dto.acquisitionStart ?? '2025-01-10')}</dtInicio><dtFim>${xmlEscape(dto.acquisitionEnd ?? '2026-01-09')}</dtFim></perAquis>`
+    ? `<perAquis><dtInicio>${xmlEscape(dto.acquisitionStart ?? "")}</dtInicio><dtFim>${xmlEscape(dto.acquisitionEnd ?? '2026-01-09')}</dtFim></perAquis>`
     : `<observacao>${xmlEscape(dto.observation ?? 'Licenca medica homologada')}</observacao>`;
   const metadata = WORKER_EVENT_METADATA['S-2230'];

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:236:61
 function buildS2240Xml(dto: S2240ExposureDto, ctx: BuilderContext): BuiltXml {
   assertPromotedWorkerVariantHandled('S-2240', dto.operation);
-  const id = dto.eventId ?? eventId('S-2240', dto.tenantId, `${dto.employeeId}:${dto.operation}`);
+  const id = dto.eventId ?? eventId('S-2240', dto.tenantId, ``);
   const intensity = Number(dto.intensity).toFixed(4);
   const intensityText = Number(dto.intensity).toFixed(6);

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:244:9
     ${ideVinculo(dto.cpf, dto.registration)}
     <infoExpRisco>
       <dtIniCondicao>${xmlEscape(dto.startDate)}</dtIniCondicao>
-      ${dto.operation === 'end' ? `<dtFimCondicao>${xmlEscape(dto.endDate ?? dto.startDate)}</dtFimCondicao>` : ''}
+      ${true ? `<dtFimCondicao>${xmlEscape(dto.endDate ?? dto.startDate)}</dtFimCondicao>` : ''}
       <infoAmb><localAmb>1</localAmb><dscSetor>${xmlEscape(dto.sector)}</dscSetor><tpInsc>1</tpInsc><nrInsc>${fullRegistration(dto.workplaceRegistrationNumber)}</nrInsc></infoAmb>
       <infoAtiv><dscAtivDes>${xmlEscape(dto.activityDescription)} ${intensityText} dB(A)</dscAtivDes></infoAtiv>

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:244:9
     ${ideVinculo(dto.cpf, dto.registration)}
     <infoExpRisco>
       <dtIniCondicao>${xmlEscape(dto.startDate)}</dtIniCondicao>
-      ${dto.operation === 'end' ? `<dtFimCondicao>${xmlEscape(dto.endDate ?? dto.startDate)}</dtFimCondicao>` : ''}
+      ${false ? `<dtFimCondicao>${xmlEscape(dto.endDate ?? dto.startDate)}</dtFimCondicao>` : ''}
       <infoAmb><localAmb>1</localAmb><dscSetor>${xmlEscape(dto.sector)}</dscSetor><tpInsc>1</tpInsc><nrInsc>${fullRegistration(dto.workplaceRegistrationNumber)}</nrInsc></infoAmb>
       <infoAtiv><dscAtivDes>${xmlEscape(dto.activityDescription)} ${intensityText} dB(A)</dscAtivDes></infoAtiv>

[Survived] MethodExpression
domain/src/builders/worker-adapter.ts:255:31
       </agNoc>
       <respReg><cpfResp>${cpf(dto.responsibleCpf)}</cpfResp><ideOC>4</ideOC><nrOC>0001</nrOC><ufOC>SP</ufOC></respReg>
-      <obs><obsCompl>S-2240 ${dto.operation.toUpperCase()} gerado pelo inventario ambiental SGP.</obsCompl></obs>
+      <obs><obsCompl>S-2240 ${dto.operation.toLowerCase()} gerado pelo inventario ambiental SGP.</obsCompl></obs>
     </infoExpRisco>`);
   return builtXml(xml, metadata, [id]);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:261:92
 }
 
 function buildS2298Xml(dto: S2298ReintegrationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'reinstatementDate', 'decisionDate', 'originalS2299Receipt']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', "", 'kind', 'reinstatementDate', 'decisionDate', 'originalS2299Receipt']);
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:261:137
 }
 
 function buildS2298Xml(dto: S2298ReintegrationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'reinstatementDate', 'decisionDate', 'originalS2299Receipt']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'reinstatementDate', "", 'originalS2299Receipt']);
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
