[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:264:16
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'reinstatementDate', 'decisionDate', 'originalS2299Receipt']);
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
-  const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
+  const type = true ? '1' : dto.kind === 'amnesty' ? '2' : '9';
   const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
   const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:264:48
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'reinstatementDate', 'decisionDate', 'originalS2299Receipt']);
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
-  const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
+  const type = dto.kind === 'judicial' ? '1' : true ? '2' : '9';
   const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
   const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:265:22
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
   const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
-  const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
+  const processXml = true ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
   const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
   const metadata = WORKER_EVENT_METADATA['S-2298'];

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:265:22
   assertPromotedWorkerVariantHandled('S-2298', dto.kind);
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
   const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
-  const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
+  const processXml = false ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
   const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
   const metadata = WORKER_EVENT_METADATA['S-2298'];

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:266:22
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
   const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
   const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
-  const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
+  const amnestyXml = true ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
   const metadata = WORKER_EVENT_METADATA['S-2298'];
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:266:22
   const id = dto.eventId ?? eventId('S-2298', dto.tenantId, dto.sourceEventId);
   const type = dto.kind === 'judicial' ? '1' : dto.kind === 'amnesty' ? '2' : '9';
   const processXml = type === '1' ? `<nrProcJud>${xmlEscape(dto.processNumber ?? '12345678901234567890')}</nrProcJud>` : '';
-  const amnestyXml = type === '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
+  const amnestyXml = type !== '2' ? `<nrLeiAnistia>${xmlEscape(dto.processNumber ?? 'ANISTIA2026')}</nrLeiAnistia>` : '';
   const metadata = WORKER_EVENT_METADATA['S-2298'];
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:276:34
       <dtEfetRetorno>${xmlEscape(dto.reinstatementDate)}</dtEfetRetorno>
       <dtEfeito>${xmlEscape(dto.reinstatementDate)}</dtEfeito>
     </infoReintegr>`, `<indRetif>1</indRetif><nrRecibo>${xmlEscape(dto.originalS2299Receipt)}</nrRecibo>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:280:38
 }
 
 function buildS2299Xml(dto: S2299TerminationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'terminationDate', 'terminationReasonCode', 'ideDmDev']);
+  validateRequired(dto, ['tenantId', "", 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'terminationDate', 'terminationReasonCode', 'ideDmDev']);
   assertPromotedWorkerVariantHandled('S-2299', dto.kind);
   const rubrics = dto.rubrics.map(terminationRubricXml).join('\n              ');

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:280:92
 }
 
 function buildS2299Xml(dto: S2299TerminationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'terminationDate', 'terminationReasonCode', 'ideDmDev']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', "", 'kind', 'terminationDate', 'terminationReasonCode', 'ideDmDev']);
   assertPromotedWorkerVariantHandled('S-2299', dto.kind);
   const rubrics = dto.rubrics.map(terminationRubricXml).join('\n              ');

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:282:62
 function buildS2299Xml(dto: S2299TerminationDto, ctx: BuilderContext): BuiltXml {
   validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'employeeId', 'cpf', 'registration', 'kind', 'terminationDate', 'terminationReasonCode', 'ideDmDev']);
   assertPromotedWorkerVariantHandled('S-2299', dto.kind);
-  const rubrics = dto.rubrics.map(terminationRubricXml).join('\n              ');
+  const rubrics = dto.rubrics.map(terminationRubricXml).join("");
   const id = dto.eventId ?? eventId('S-2299', dto.tenantId, `${dto.employeeId}:${dto.kind}`);
   const metadata = WORKER_EVENT_METADATA['S-2299'];

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:290:22
     <infoDeslig>
       <mtvDeslig>${xmlEscape(dto.terminationReasonCode)}</mtvDeslig>
       <dtDeslig>${xmlEscape(dto.terminationDate)}</dtDeslig>
-      <indPagtoAPI>${dto.kind === 'with-notice' ? 'S' : 'N'}</indPagtoAPI>
+      <indPagtoAPI>${true ? 'S' : 'N'}</indPagtoAPI>
       ${dto.projectedNoticeEndDate ? `<dtProjFimAPI>${xmlEscape(dto.projectedNoticeEndDate)}</dtProjFimAPI>` : ''}
       <verbasResc>

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:290:22
     <infoDeslig>
       <mtvDeslig>${xmlEscape(dto.terminationReasonCode)}</mtvDeslig>
       <dtDeslig>${xmlEscape(dto.terminationDate)}</dtDeslig>
-      <indPagtoAPI>${dto.kind === 'with-notice' ? 'S' : 'N'}</indPagtoAPI>
+      <indPagtoAPI>${dto.kind !== 'with-notice' ? 'S' : 'N'}</indPagtoAPI>
       ${dto.projectedNoticeEndDate ? `<dtProjFimAPI>${xmlEscape(dto.projectedNoticeEndDate)}</dtProjFimAPI>` : ''}
       <verbasResc>

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:291:38
       <mtvDeslig>${xmlEscape(dto.terminationReasonCode)}</mtvDeslig>
       <dtDeslig>${xmlEscape(dto.terminationDate)}</dtDeslig>
       <indPagtoAPI>${dto.kind === 'with-notice' ? 'S' : 'N'}</indPagtoAPI>
-      ${dto.projectedNoticeEndDate ? `<dtProjFimAPI>${xmlEscape(dto.projectedNoticeEndDate)}</dtProjFimAPI>` : ''}
+      ${dto.projectedNoticeEndDate ? `` : ''}
       <verbasResc>
         <dmDev>

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:310:90
 }
 
 function buildS2300Xml(dto: S2300TsvStartDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'workerId', 'cpf', 'name', 'birthDate', 'registration', 'categoryCode', 'startDate', 'role']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'workerId', 'cpf', "", 'birthDate', 'registration', 'categoryCode', 'startDate', 'role']);
   assertPromotedWorkerVariantHandled('S-2300', dto.kind);
   const id = dto.eventId ?? eventId('S-2300', dto.tenantId, dto.workerId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:310:71
 }
 
 function buildS2300Xml(dto: S2300TsvStartDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'workerId', 'cpf', 'name', 'birthDate', 'registration', 'categoryCode', 'startDate', 'role']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', "", 'cpf', 'name', 'birthDate', 'registration', 'categoryCode', 'startDate', 'role']);
   assertPromotedWorkerVariantHandled('S-2300', dto.kind);
   const id = dto.eventId ?? eventId('S-2300', dto.tenantId, dto.workerId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:315:61
   const id = dto.eventId ?? eventId('S-2300', dto.tenantId, dto.workerId);
   const complement = tsvComplement(dto);
   const metadata = WORKER_EVENT_METADATA['S-2300'];
-  const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
-    ${tsvWorkerXml(dto.cpf, dto.name, dto.birthDate, dto.kind === 'council-member' ? 'M' : 'F', dto.email ?? `${dto.kind}@example.test`)}
-    <infoTSVInicio>
-      <cadIni>N</cadIni>
-      <matricula>${xmlEscape(dto.registration)}</matricula>
-      <codCateg>${xmlEscape(dto.categoryCode)}</codCateg>
-      <dtInicio>${xmlEscape(dto.startDate)}</dtInicio>
-      ${complement}
-    </infoTSVInicio>`);
+  const xml = envelope(metadata, id, ctx, dto.employerCnpj, ``);
   return builtXml(xml, metadata, [id]);
 }

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:316:54
   const complement = tsvComplement(dto);
   const metadata = WORKER_EVENT_METADATA['S-2300'];
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
-    ${tsvWorkerXml(dto.cpf, dto.name, dto.birthDate, dto.kind === 'council-member' ? 'M' : 'F', dto.email ?? `${dto.kind}@example.test`)}
+    ${tsvWorkerXml(dto.cpf, dto.name, dto.birthDate, true ? 'M' : 'F', dto.email ?? `${dto.kind}@example.test`)}
     <infoTSVInicio>
       <cadIni>N</cadIni>

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:316:54
   const complement = tsvComplement(dto);
   const metadata = WORKER_EVENT_METADATA['S-2300'];
   const xml = envelope(metadata, id, ctx, dto.employerCnpj, `
-    ${tsvWorkerXml(dto.cpf, dto.name, dto.birthDate, dto.kind === 'council-member' ? 'M' : 'F', dto.email ?? `${dto.kind}@example.test`)}
+    ${tsvWorkerXml(dto.cpf, dto.name, dto.birthDate, dto.kind !== 'council-member' ? 'M' : 'F', dto.email ?? `${dto.kind}@example.test`)}
     <infoTSVInicio>
       <cadIni>N</cadIni>

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:324:34
       <dtInicio>${xmlEscape(dto.startDate)}</dtInicio>
       ${complement}
     </infoTSVInicio>`);
-  return builtXml(xml, metadata, [id]);
+  return builtXml(xml, metadata, []);
 }
 

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:328:71
 }
 
 function buildS2306Xml(dto: S2306TsvContractChangeDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', 'changeDate']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', "", 'contractId', 'cpf', 'registration', 'changeDate']);
   assertPromotedWorkerVariantHandled('S-2306', dto.kind);
   const id = dto.eventId ?? eventId('S-2306', dto.tenantId, dto.contractId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:328:79
 }
 
 function buildS2306Xml(dto: S2306TsvContractChangeDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', 'changeDate']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', "", 'cpf', 'registration', 'changeDate']);
   assertPromotedWorkerVariantHandled('S-2306', dto.kind);
   const id = dto.eventId ?? eventId('S-2306', dto.tenantId, dto.contractId);

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:332:16
   assertPromotedWorkerVariantHandled('S-2306', dto.kind);
   const id = dto.eventId ?? eventId('S-2306', dto.tenantId, dto.contractId);
   const metadata = WORKER_EVENT_METADATA['S-2306'];
-  const info = dto.kind === 'role'
+  const info = true
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
     : dto.kind === 'pay'

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:332:16
   assertPromotedWorkerVariantHandled('S-2306', dto.kind);
   const id = dto.eventId ?? eventId('S-2306', dto.tenantId, dto.contractId);
   const metadata = WORKER_EVENT_METADATA['S-2306'];
-  const info = dto.kind === 'role'
+  const info = false
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
     : dto.kind === 'pay'

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:334:7
   const metadata = WORKER_EVENT_METADATA['S-2306'];
   const info = dto.kind === 'role'
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
-    : dto.kind === 'pay'
+    : true
       ? `<remuneracao><vrSalFx>${money(dto.salaryAmount ?? 0)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`
       : dto.kind === 'internship'

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:334:7
   const metadata = WORKER_EVENT_METADATA['S-2306'];
   const info = dto.kind === 'role'
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
-    : dto.kind === 'pay'
+    : false
       ? `<remuneracao><vrSalFx>${money(dto.salaryAmount ?? 0)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`
       : dto.kind === 'internship'

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:336:9
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
     : dto.kind === 'pay'
       ? `<remuneracao><vrSalFx>${money(dto.salaryAmount ?? 0)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`
-      : dto.kind === 'internship'
+      : dto.kind !== 'internship'
         : `<localTrabGeral><tpInsc>1</tpInsc><nrInsc>${fullRegistration(dto.workplaceRegistrationNumber ?? dto.employerCnpj)}</nrInsc></localTrabGeral>`;

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:336:9
     ? `<cargoFuncao><nmCargo>${xmlEscape(dto.role ?? 'TSV Alterado')}</nmCargo></cargoFuncao>`
     : dto.kind === 'pay'
       ? `<remuneracao><vrSalFx>${money(dto.salaryAmount ?? 0)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`
-      : dto.kind === 'internship'
+      : false
         : `<localTrabGeral><tpInsc>1</tpInsc><nrInsc>${fullRegistration(dto.workplaceRegistrationNumber ?? dto.employerCnpj)}</nrInsc></localTrabGeral>`;

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:349:116
 }
 
 function buildS2399Xml(dto: S2399TsvTerminationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', 'terminationDate', 'acceptedS2300Receipt']);
+  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', "", 'acceptedS2300Receipt']);
   assertPromotedWorkerVariantHandled('S-2399', dto.kind);
   const id = dto.eventId ?? eventId('S-2399', dto.tenantId, dto.contractId);

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:349:38
 }
 
 function buildS2399Xml(dto: S2399TsvTerminationDto, ctx: BuilderContext): BuiltXml {
-  validateRequired(dto, ['tenantId', 'sourceEventId', 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', 'terminationDate', 'acceptedS2300Receipt']);
+  validateRequired(dto, ['tenantId', "", 'employerCnpj', 'kind', 'contractId', 'cpf', 'registration', 'terminationDate', 'acceptedS2300Receipt']);
   assertPromotedWorkerVariantHandled('S-2399', dto.kind);
   const id = dto.eventId ?? eventId('S-2399', dto.tenantId, dto.contractId);

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:370:48
   ideEventoOverride?: string,
 ): string {
   const ideEventoXml = ideEventoOverride
-    ? `<ideEvento>${ideEventoOverride}<tpAmb>${ctx.environment === 'production' ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
+    ? `<ideEvento>${ideEventoOverride}<tpAmb>${ctx.environment !== 'production' ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
     : ideEvento(ctx, { includeRetification: true });
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:370:48
   ideEventoOverride?: string,
 ): string {
   const ideEventoXml = ideEventoOverride
-    ? `<ideEvento>${ideEventoOverride}<tpAmb>${ctx.environment === 'production' ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
+    ? `<ideEvento>${ideEventoOverride}<tpAmb>${false ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
     : ideEvento(ctx, { includeRetification: true });
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] BooleanLiteral
domain/src/builders/worker-adapter.ts:371:45
 ): string {
   const ideEventoXml = ideEventoOverride
     ? `<ideEvento>${ideEventoOverride}<tpAmb>${ctx.environment === 'production' ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
-    : ideEvento(ctx, { includeRetification: true });
+    : ideEvento(ctx, { includeRetification: false });
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">

[Survived] ObjectLiteral
domain/src/builders/worker-adapter.ts:371:22
 ): string {
   const ideEventoXml = ideEventoOverride
     ? `<ideEvento>${ideEventoOverride}<tpAmb>${ctx.environment === 'production' ? '1' : '2'}</tpAmb><procEmi>1</procEmi><verProc>${xmlEscape(ctx.processVersion ?? 'SGP-0.0.1')}</verProc></ideEvento>`
-    : ideEvento(ctx, { includeRetification: true });
+    : ideEvento(ctx, {});
   return withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:386:45
   eventCode: EsocialPromotedWorkerDtoEventClass,
   eventElement: WorkerMetadata['eventElement'],
   xsdFile: string,
-  receiptDependencies: readonly string[] = ['S-2200'],
+  receiptDependencies: readonly string[] = [""],
 ): WorkerMetadata {
   return {

[Survived] ArrayDeclaration
domain/src/builders/worker-adapter.ts:395:31
     eventElement,
     namespace: `http://www.esocial.gov.br/schema/evt/${eventElement}/v_S_01_03_00`,
     xsdBinding: `${XSD_ROOT}/${xsdFile}`,
-    tableVersionDependencies: ['S-1000'],
+    tableVersionDependencies: [],
     receiptDependencies,
   };

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:405:32
 }
 
 function dependentXml(dependent: S2205DependentChangeDto, index: number): string {
-  validateRequired(dependent, ['sourceDependentId', 'name', 'birthDate', 'relationshipCode']);
+  validateRequired(dependent, ["", 'name', 'birthDate', 'relationshipCode']);
   const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : '';

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:406:34
 
 function dependentXml(dependent: S2205DependentChangeDto, index: number): string {
   validateRequired(dependent, ['sourceDependentId', 'name', 'birthDate', 'relationshipCode']);
-  const cpfXml = dependent.cpf ? `<cpfDep>${cpf(dependent.cpf)}</cpfDep>` : '';
+  const cpfXml = dependent.cpf ? `` : '';
 }

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:411:55
 }
 
 function terminationRubricXml(rubric: S2299TerminationRubricDto): string {
-  validateRequired(rubric, ['rubricCode', 'quantity', 'amount']);
+  validateRequired(rubric, ['rubricCode', 'quantity', ""]);
 }

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:411:29
 }
 
 function terminationRubricXml(rubric: S2299TerminationRubricDto): string {
-  validateRequired(rubric, ['rubricCode', 'quantity', 'amount']);
+  validateRequired(rubric, ["", 'quantity', 'amount']);
 }

[Survived] StringLiteral
domain/src/builders/worker-adapter.ts:438:15
 }
 
 function tsvComplement(dto: S2300TsvStartDto): string {
-  const pay = `<remuneracao><vrSalFx>${money(dto.salaryAmount)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`;
+  const pay = ``;
   if (dto.kind === 'intern') {

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:439:7
 
 function tsvComplement(dto: S2300TsvStartDto): string {
   const pay = `<remuneracao><vrSalFx>${money(dto.salaryAmount)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`;
-  if (dto.kind === 'intern') {
+  if (true) {
   }

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:439:7
 
 function tsvComplement(dto: S2300TsvStartDto): string {
   const pay = `<remuneracao><vrSalFx>${money(dto.salaryAmount)}</vrSalFx><undSalFixo>5</undSalFixo></remuneracao>`;
-  if (dto.kind === 'intern') {
+  if (false) {
   }

[Survived] EqualityOperator
domain/src/builders/worker-adapter.ts:442:7
   if (dto.kind === 'intern') {
   }
-  if (dto.kind === 'council-member') {
+  if (dto.kind !== 'council-member') {
   }

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:442:7
   if (dto.kind === 'intern') {
   }
-  if (dto.kind === 'council-member') {
+  if (false) {
   }

[Survived] ConditionalExpression
domain/src/builders/worker-adapter.ts:449:19
 }
 
 function money(value: string | number): string {
-  const numeric = typeof value === 'number' ? value : Number(value);
+  const numeric = true ? value : Number(value);
   return Number.isFinite(numeric) ? numeric.toFixed(2) : String(value);
 }
