[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:64:51
   const policy = normalizeCircuitPolicy(input.policy);
   const snapshot = input.snapshot;
 
-  if (!snapshot || snapshot.state === 'CLOSED' || snapshot.state === 'HALF_OPEN') {
+  if (!snapshot || snapshot.state === 'CLOSED' || snapshot.state !== 'HALF_OPEN') {
     return {
       action: 'allow',

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:64:20
   const policy = normalizeCircuitPolicy(input.policy);
   const snapshot = input.snapshot;
 
-  if (!snapshot || snapshot.state === 'CLOSED' || snapshot.state === 'HALF_OPEN') {
+  if (!snapshot || false || snapshot.state === 'HALF_OPEN') {
     return {
       action: 'allow',

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:68:15
     return {
       action: 'allow',
       state: snapshot?.state ?? 'CLOSED',
-      reason: snapshot?.state === 'HALF_OPEN'
+      reason: true
         ? 'Circuit is half-open; allowing probe submission.'
         : 'Circuit is closed.',

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:68:15
     return {
       action: 'allow',
       state: snapshot?.state ?? 'CLOSED',
-      reason: snapshot?.state === 'HALF_OPEN'
+      reason: false
         ? 'Circuit is half-open; allowing probe submission.'
         : 'Circuit is closed.',

[Survived] ArithmeticOperator
domain/src/operations/circuit-breaker.ts:77:32
   const openedAtMs = snapshot.openedAt
     ? Date.parse(snapshot.openedAt)
     : input.now.getTime();
-  const nextCheckAt = new Date(openedAtMs + policy.openCooldownMs);
+  const nextCheckAt = new Date(openedAtMs - policy.openCooldownMs);
 
   if (input.now.getTime() < nextCheckAt.getTime()) {

[Survived] BlockStatement
domain/src/operations/circuit-breaker.ts:79:52
     : input.now.getTime();
   const nextCheckAt = new Date(openedAtMs + policy.openCooldownMs);
 
-  if (input.now.getTime() < nextCheckAt.getTime()) {
-    return {
-      action: 'defer',
-      state: 'OPEN',
-      reason: 'Circuit is open; submission is deferred.',
-      nextCheckAt: nextCheckAt.toISOString(),
-    };
-  }
+  if (input.now.getTime() < nextCheckAt.getTime()) {}
 
   return {

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:79:7
     : input.now.getTime();
   const nextCheckAt = new Date(openedAtMs + policy.openCooldownMs);
 
-  if (input.now.getTime() < nextCheckAt.getTime()) {
+  if (input.now.getTime() <= nextCheckAt.getTime()) {
     return {
       action: 'defer',

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:105:7
   const policy = normalizeCircuitPolicy(input.policy);
   const nowIso = input.now.toISOString();
 
-  if (input.outcome === 'success') {
+  if (input.outcome !== 'success') {
     const successCount =
       input.snapshot.state === 'HALF_OPEN'

[Survived] BlockStatement
domain/src/operations/circuit-breaker.ts:105:36
   const policy = normalizeCircuitPolicy(input.policy);
   const nowIso = input.now.toISOString();
 
-  if (input.outcome === 'success') {
-    const successCount =
-      input.snapshot.state === 'HALF_OPEN'
-        ? input.snapshot.successCount + 1
-        : 1;
-    const shouldClose =
-      input.snapshot.state !== 'HALF_OPEN' ||
-      successCount >= policy.halfOpenSuccessThreshold;
-
-    return {
-      ...input.snapshot,
-      state: shouldClose ? 'CLOSED' : 'HALF_OPEN',
-      failureCount: 0,
-      successCount,
-      openedAt: shouldClose ? undefined : input.snapshot.openedAt,
-      halfOpenedAt: shouldClose ? undefined : input.snapshot.halfOpenedAt,
-      lastSuccessAt: nowIso,
-      lastErrorCode: shouldClose ? undefined : input.snapshot.lastErrorCode,
-    };
-  }
+  if (input.outcome === 'success') {}
 
   const failureCount = input.snapshot.failureCount + 1;

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:107:7
 
   if (input.outcome === 'success') {
     const successCount =
-      input.snapshot.state === 'HALF_OPEN'
+      input.snapshot.state !== 'HALF_OPEN'
         ? input.snapshot.successCount + 1
         : 1;

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:107:7
 
   if (input.outcome === 'success') {
     const successCount =
-      input.snapshot.state === 'HALF_OPEN'
+      false
         ? input.snapshot.successCount + 1
         : 1;

[Survived] ArithmeticOperator
domain/src/operations/circuit-breaker.ts:108:11
   if (input.outcome === 'success') {
     const successCount =
       input.snapshot.state === 'HALF_OPEN'
-        ? input.snapshot.successCount + 1
+        ? input.snapshot.successCount - 1
         : 1;
     const shouldClose =

[Survived] LogicalOperator
domain/src/operations/circuit-breaker.ts:111:7
         ? input.snapshot.successCount + 1
         : 1;
     const shouldClose =
-      input.snapshot.state !== 'HALF_OPEN' ||
-      successCount >= policy.halfOpenSuccessThreshold;
+      input.snapshot.state !== 'HALF_OPEN' && successCount >= policy.halfOpenSuccessThreshold;
 
     return {

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:111:7
         ? input.snapshot.successCount + 1
         : 1;
     const shouldClose =
-      input.snapshot.state !== 'HALF_OPEN' ||
+      input.snapshot.state === 'HALF_OPEN' ||
       successCount >= policy.halfOpenSuccessThreshold;
 

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:112:7
         : 1;
     const shouldClose =
       input.snapshot.state !== 'HALF_OPEN' ||
-      successCount >= policy.halfOpenSuccessThreshold;
+      successCount < policy.halfOpenSuccessThreshold;
 
     return {

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:112:7
         : 1;
     const shouldClose =
       input.snapshot.state !== 'HALF_OPEN' ||
-      successCount >= policy.halfOpenSuccessThreshold;
+      false;
 
     return {

[Survived] ArithmeticOperator
domain/src/operations/circuit-breaker.ts:126:24
     };
   }
 
-  const failureCount = input.snapshot.failureCount + 1;
+  const failureCount = input.snapshot.failureCount - 1;
   const shouldOpen =
     input.snapshot.state === 'HALF_OPEN' ||

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:128:5
 
   const failureCount = input.snapshot.failureCount + 1;
   const shouldOpen =
-    input.snapshot.state === 'HALF_OPEN' ||
+    input.snapshot.state !== 'HALF_OPEN' ||
     failureCount >= policy.failureThreshold;
 

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:128:5
 
   const failureCount = input.snapshot.failureCount + 1;
   const shouldOpen =
-    input.snapshot.state === 'HALF_OPEN' ||
-    failureCount >= policy.failureThreshold;
+    false;
 
   return {

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:129:5
   const failureCount = input.snapshot.failureCount + 1;
   const shouldOpen =
     input.snapshot.state === 'HALF_OPEN' ||
-    failureCount >= policy.failureThreshold;
+    false;
 
   return {

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:129:5
   const failureCount = input.snapshot.failureCount + 1;
   const shouldOpen =
     input.snapshot.state === 'HALF_OPEN' ||
-    failureCount >= policy.failureThreshold;
+    failureCount > policy.failureThreshold;
 
   return {

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:152:7
   policy?: Partial<CircuitBreakerPolicy> | undefined;
 }>): CircuitBreakerOutcomeResult {
   const next = recordCircuitBreakerOutcome(input);
-  if (next.state === input.snapshot.state) {
+  if (false) {
     return { snapshot: next };
   }

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:152:7
   policy?: Partial<CircuitBreakerPolicy> | undefined;
 }>): CircuitBreakerOutcomeResult {
   const next = recordCircuitBreakerOutcome(input);
-  if (next.state === input.snapshot.state) {
+  if (next.state !== input.snapshot.state) {
     return { snapshot: next };
   }

[Survived] LogicalOperator
domain/src/operations/circuit-breaker.ts:186:16
     occurredAt: input.occurredAt,
     failureCount: input.to.failureCount,
     successCount: input.to.successCount,
-    errorCode: input.errorCode ?? input.to.lastErrorCode,
+    errorCode: input.errorCode && input.to.lastErrorCode,
   };
 }

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:203:28
   from: CircuitBreakerState,
   to: CircuitBreakerState,
 ): string {
-  if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
+  if (from === 'CLOSED' && to !== 'OPEN') return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:203:7
   from: CircuitBreakerState,
   to: CircuitBreakerState,
 ): string {
-  if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
+  if (true) return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:204:7
   to: CircuitBreakerState,
 ): string {
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
-  if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
+  if (true) return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
   if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:204:7
   to: CircuitBreakerState,
 ): string {
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
-  if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
+  if (true && to === 'HALF_OPEN') return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
   if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:205:7
 ): string {
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
-  if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
+  if (true) return 'half-open probe succeeded';
   if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';
   return `${from} -> ${to}`;

[Survived] ConditionalExpression
domain/src/operations/circuit-breaker.ts:205:7
 ): string {
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
-  if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
+  if (true && to === 'CLOSED') return 'half-open probe succeeded';
   if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';
   return `${from} -> ${to}`;

[Survived] EqualityOperator
domain/src/operations/circuit-breaker.ts:206:7
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
-  if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';
+  if (from !== 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';
   return `${from} -> ${to}`;
 }

[Survived] LogicalOperator
domain/src/operations/circuit-breaker.ts:206:7
   if (from === 'CLOSED' && to === 'OPEN') return 'failure threshold reached';
   if (from === 'OPEN' && to === 'HALF_OPEN') return 'cooldown elapsed';
   if (from === 'HALF_OPEN' && to === 'CLOSED') return 'half-open probe succeeded';
-  if (from === 'HALF_OPEN' && to === 'OPEN') return 'half-open probe failed';
+  if (from === 'HALF_OPEN' || to === 'OPEN') return 'half-open probe failed';
   return `${from} -> ${to}`;
 }
