[Survived] BlockStatement
domain/src/returns/parsers.ts:137:14
 export function parseEsocialReturnXml(xml: string): ParsedEsocialReturn {
   const document = parseReturnXmlDocument(xml, 'eSocial return');
   const fault = soapFaultText(document);
-  if (fault) {
-    return {
-      kind: 'soap_fault',
-      responseCode: 'SOAP_FAULT',
-      responseDescription: fault,
-      protocol: null,
-      receipt: null,
-      fault,
-    };
-  }
+  if (fault) {}
 
   const totalizerElement = totalizerEventElement(document);

[Survived] BlockStatement
domain/src/returns/parsers.ts:149:25
   }
 
   const totalizerElement = totalizerEventElement(document);
-  if (totalizerElement) {
-    const totalizer = parseTotalizerDocument(document, xml, totalizerElement);
-    return {
-      kind: 'totalizer',
-      responseCode: '201',
-      responseDescription: 'Totalizer received.',
-      protocol: null,
-      receipt: totalizer.sourceEventReceipt,
-      totalizer,
-    };
-  }
+  if (totalizerElement) {}
 
   if (firstElement(document, 'retornoEventos')) {

[Survived] BlockStatement
domain/src/returns/parsers.ts:161:49
     };
   }
 
-  if (firstElement(document, 'retornoEventos')) {
-    const processingReturn = parseProcessingDocument(document);
-    const primaryEvent = processingReturn.events[0];
-    return {
-      kind: 'processing',
-      responseCode: primaryEvent?.responseCode ?? processingReturn.responseCode,
-      responseDescription:
-        primaryEvent?.responseDescription ?? processingReturn.responseDescription,
-      protocol: processingReturn.protocol,
-      receipt: primaryEvent?.receipt ?? null,
-      processingReturn,
-    };
-  }
+  if (firstElement(document, 'retornoEventos')) {}
 
   if (firstElement(document, 'retornoEnvioLoteEventos')) {

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:161:7
     };
   }
 
-  if (firstElement(document, 'retornoEventos')) {
+  if (true) {
     const processingReturn = parseProcessingDocument(document);
     const primaryEvent = processingReturn.events[0];

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:175:7
     };
   }
 
-  if (firstElement(document, 'retornoEnvioLoteEventos')) {
+  if (false) {
     const protocolReturn = parseProtocolDocument(document);
     return {

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:175:7
     };
   }
 
-  if (firstElement(document, 'retornoEnvioLoteEventos')) {
+  if (true) {
     const protocolReturn = parseProtocolDocument(document);
     return {

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:195:7
 export function parseProtocolResponseXml(xml: string): ProtocolParseResult {
   const document = parseReturnXmlDocument(xml, 'eSocial protocol response');
   const fault = soapFaultText(document);
-  if (fault) {
+  if (true) {
     throw new ReturnXmlParseError(`eSocial protocol SOAP fault: ${fault}`);
   }

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:195:7
 export function parseProtocolResponseXml(xml: string): ProtocolParseResult {
   const document = parseReturnXmlDocument(xml, 'eSocial protocol response');
   const fault = soapFaultText(document);
-  if (fault) {
+  if (false) {
     throw new ReturnXmlParseError(`eSocial protocol SOAP fault: ${fault}`);
   }

[Survived] StringLiteral
domain/src/returns/parsers.ts:203:33
 
 export function protocolFromXml(xml: string): string {
   return firstText(
-    parseReturnXmlDocument(xml, 'eSocial protocol response'),
+    parseReturnXmlDocument(xml, ""),
     'protocoloEnvio',
   );

[Survived] BlockStatement
domain/src/returns/parsers.ts:211:14
 export function parseProcessingResponseXml(xml: string): BatchProcessingReturn {
   const document = parseReturnXmlDocument(xml, 'eSocial processing response');
   const fault = soapFaultText(document);
-  if (fault) {
-    throw new ReturnXmlParseError(`eSocial processing SOAP fault: ${fault}`);
-  }
+  if (fault) {}
   return parseProcessingDocument(document);
 }

[Survived] LogicalOperator
domain/src/returns/parsers.ts:230:5
 
 function parseProtocolDocument(document: ReturnXmlNode): ProtocolParseResult {
   const protocol =
-    firstOptionalText(document, 'protocoloEnvio') ??
-    firstOptionalText(document, 'nrRecibo');
+    firstOptionalText(document, 'protocoloEnvio') && firstOptionalText(document, 'nrRecibo');
   if (!protocol) {
     throw new ReturnXmlParseError(

[Survived] StringLiteral
domain/src/returns/parsers.ts:231:33
 function parseProtocolDocument(document: ReturnXmlNode): ProtocolParseResult {
   const protocol =
     firstOptionalText(document, 'protocoloEnvio') ??
-    firstOptionalText(document, 'nrRecibo');
+    firstOptionalText(document, "");
   if (!protocol) {
     throw new ReturnXmlParseError(

[Survived] LogicalOperator
domain/src/returns/parsers.ts:246:7
       ? firstOptionalText(status, 'descResposta')
       : null,
     receivedAt:
-      firstOptionalText(document, 'dhRecepcao') ??
-      firstOptionalText(document, 'dhProcessamento'),
+      firstOptionalText(document, 'dhRecepcao') && firstOptionalText(document, 'dhProcessamento'),
     employer: parseIdentity(firstElement(document, 'ideEmpregador')),
     transmitter: parseIdentity(firstElement(document, 'ideTransmissor')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:249:55
       firstOptionalText(document, 'dhRecepcao') ??
       firstOptionalText(document, 'dhProcessamento'),
     employer: parseIdentity(firstElement(document, 'ideEmpregador')),
-    transmitter: parseIdentity(firstElement(document, 'ideTransmissor')),
+    transmitter: parseIdentity(firstElement(document, "")),
   };
 }

[Survived] StringLiteral
domain/src/returns/parsers.ts:256:35
 function parseProcessingDocument(document: ReturnXmlNode): BatchProcessingReturn {
   const status = firstElement(document, 'status');
   if (!status) {
-    throw new ReturnXmlParseError('eSocial processing return is missing status.');
+    throw new ReturnXmlParseError("");
   }
   const responseCode = firstText(status, 'cdResposta');

[Survived] StringLiteral
domain/src/returns/parsers.ts:259:49
     throw new ReturnXmlParseError('eSocial processing return is missing status.');
   }
   const responseCode = firstText(status, 'cdResposta');
-  const responseDescription = firstText(status, 'descResposta');
+  const responseDescription = firstText(status, "");
 
   return {

[Survived] LogicalOperator
domain/src/returns/parsers.ts:263:7
 
   return {
     protocol:
-      firstOptionalText(document, 'protocoloEnvio') ??
-      firstOptionalText(document, 'nrRecibo'),
+      firstOptionalText(document, 'protocoloEnvio') && firstOptionalText(document, 'nrRecibo'),
     responseCode,
     responseDescription,

[Survived] LogicalOperator
domain/src/returns/parsers.ts:268:7
     responseCode,
     responseDescription,
     estimatedConclusionSeconds: numberOrNull(
-      firstOptionalText(status, 'tempoEstimadoConclusao') ??
-        firstOptionalText(status, 'tempoEstimado'),
+      firstOptionalText(status, 'tempoEstimadoConclusao') && firstOptionalText(status, 'tempoEstimado'),
     ),
     receivedAt:

[Survived] StringLiteral
domain/src/returns/parsers.ts:268:33
     responseCode,
     responseDescription,
     estimatedConclusionSeconds: numberOrNull(
-      firstOptionalText(status, 'tempoEstimadoConclusao') ??
+      firstOptionalText(status, "") ??
         firstOptionalText(status, 'tempoEstimado'),
     ),

[Survived] LogicalOperator
domain/src/returns/parsers.ts:272:7
         firstOptionalText(status, 'tempoEstimado'),
     ),
     receivedAt:
-      firstOptionalText(document, 'dhRecepcao') ??
-      firstOptionalText(document, 'dhRecepcaoLote'),
+      firstOptionalText(document, 'dhRecepcao') && firstOptionalText(document, 'dhRecepcaoLote'),
     processedAt:
       firstOptionalText(document, 'dhProcessamento') ??

[Survived] StringLiteral
domain/src/returns/parsers.ts:272:35
         firstOptionalText(status, 'tempoEstimado'),
     ),
     receivedAt:
-      firstOptionalText(document, 'dhRecepcao') ??
+      firstOptionalText(document, "") ??
       firstOptionalText(document, 'dhRecepcaoLote'),
     processedAt:

[Survived] LogicalOperator
domain/src/returns/parsers.ts:275:7
       firstOptionalText(document, 'dhRecepcao') ??
       firstOptionalText(document, 'dhRecepcaoLote'),
     processedAt:
-      firstOptionalText(document, 'dhProcessamento') ??
-      firstOptionalText(document, 'dhProcessamentoLote'),
+      firstOptionalText(document, 'dhProcessamento') && firstOptionalText(document, 'dhProcessamentoLote'),
     employer: parseIdentity(firstElement(document, 'ideEmpregador')),
     transmitter: parseIdentity(firstElement(document, 'ideTransmissor')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:277:52
     processedAt:
       firstOptionalText(document, 'dhProcessamento') ??
       firstOptionalText(document, 'dhProcessamentoLote'),
-    employer: parseIdentity(firstElement(document, 'ideEmpregador')),
+    employer: parseIdentity(firstElement(document, "")),
     transmitter: parseIdentity(firstElement(document, 'ideTransmissor')),
     occurrences: parseOccurrences(document),

[Survived] StringLiteral
domain/src/returns/parsers.ts:285:49
 }
 
 function parseEventReturns(document: ReturnXmlNode): EventProcessingReturn[] {
-  const retornoEventos = firstElement(document, 'retornoEventos');
+  const retornoEventos = firstElement(document, "");
   if (!retornoEventos) return [];
 

[Survived] StringLiteral
domain/src/returns/parsers.ts:289:51
   if (!retornoEventos) return [];
 
   return directChildElements(retornoEventos, 'evento').map((eventNode) => {
-    const retornoEvento = firstElement(eventNode, 'retornoEvento');
+    const retornoEvento = firstElement(eventNode, "");
     const processing = retornoEvento
       ? firstElement(retornoEvento, 'processamento')

[Survived] StringLiteral
domain/src/returns/parsers.ts:291:37
   return directChildElements(retornoEventos, 'evento').map((eventNode) => {
     const retornoEvento = firstElement(eventNode, 'retornoEvento');
     const processing = retornoEvento
-      ? firstElement(retornoEvento, 'processamento')
+      ? firstElement(retornoEvento, "")
       : null;
     const eventReference = attributeText(eventNode, 'Id');

[Survived] StringLiteral
domain/src/returns/parsers.ts:293:53
     const processing = retornoEvento
       ? firstElement(retornoEvento, 'processamento')
       : null;
-    const eventReference = attributeText(eventNode, 'Id');
+    const eventReference = attributeText(eventNode, "");
     if (!eventReference) {
       throw new ReturnXmlParseError(

[Survived] MethodExpression
domain/src/returns/parsers.ts:308:9
     return {
       eventReference,
       duplicate: ['true', '1'].includes(
-        (attributeText(eventNode, 'evtDupl') ?? '').toLowerCase(),
+        (attributeText(eventNode, 'evtDupl') ?? '').toUpperCase(),
       ),
       responseCode: firstText(processing, 'cdResposta'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:312:45
       ),
       responseCode: firstText(processing, 'cdResposta'),
       responseDescription: firstText(processing, 'descResposta'),
-      receipt: firstOptionalText(eventNode, 'nrRecibo'),
+      receipt: firstOptionalText(eventNode, ""),
       processedAt: firstOptionalText(processing, 'dhProcessamento'),
       errors: parseOccurrences(processing),

[Survived] StringLiteral
domain/src/returns/parsers.ts:327:11
       const description = directChildText(occurrence, 'descricao');
       if (!code || !description) {
         throw new ReturnXmlParseError(
-          'eSocial occurrence is missing codigo or descricao.',
+          "",
         );
       }

[Survived] LogicalOperator
domain/src/returns/parsers.ts:354:5
 
   const competence = monthCompetence(firstText(document, 'perApur'));
   const sourceEventReceipt =
-    firstOptionalText(document, 'nrRecArqBase') ??
-    firstOptionalText(document, 'nrRecEvt') ??
-    firstOptionalText(document, 'nrRecibo');
+    (firstOptionalText(document, 'nrRecArqBase') ?? firstOptionalText(document, 'nrRecEvt')) && firstOptionalText(document, 'nrRecibo');
   if (!sourceEventReceipt) {
     throw new ReturnXmlParseError(

[Survived] StringLiteral
domain/src/returns/parsers.ts:356:33
   const sourceEventReceipt =
     firstOptionalText(document, 'nrRecArqBase') ??
     firstOptionalText(document, 'nrRecEvt') ??
-    firstOptionalText(document, 'nrRecibo');
+    firstOptionalText(document, "");
   if (!sourceEventReceipt) {
     throw new ReturnXmlParseError(

[Survived] StringLiteral
domain/src/returns/parsers.ts:359:7
     firstOptionalText(document, 'nrRecibo');
   if (!sourceEventReceipt) {
     throw new ReturnXmlParseError(
-      'eSocial totalizer return is missing source event receipt.',
+      "",
     );
   }

[Survived] StringLiteral
domain/src/returns/parsers.ts:363:72
     );
   }
 
-  const eventId = attributeText(firstElement(document, eventElement)!, 'Id');
+  const eventId = attributeText(firstElement(document, eventElement)!, "");
   const payload = {
     kind,

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:389:5
   document: ReturnXmlNode,
 ): Record<string, unknown> {
   switch (kind) {
-    case 'S-5001':
-      return structuredS5001Payload(document);
+    case 'S-5001':
     case 'S-5002':
       return structuredS5002Payload(document);

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:391:5
   switch (kind) {
     case 'S-5001':
       return structuredS5001Payload(document);
-    case 'S-5002':
-      return structuredS5002Payload(document);
+    case 'S-5002':
     case 'S-5012':
       return structuredS5012Payload(document);

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:393:5
       return structuredS5001Payload(document);
     case 'S-5002':
       return structuredS5002Payload(document);
-    case 'S-5012':
-      return structuredS5012Payload(document);
+    case 'S-5012':
     case 'S-5011':
     case 'S-5013':

[Survived] StringLiteral
domain/src/returns/parsers.ts:410:40
       amount: moneyText(directChildText(base, 'valor')),
     }));
     const pisPasepBases = childElements(worker, 'basesPisPasep').map((base) => ({
-      valueType: directChildText(base, 'tpValorPisPasep'),
+      valueType: directChildText(base, ""),
       amount: moneyText(directChildText(base, 'valorPisPasep')),
     }));

[Survived] StringLiteral
domain/src/returns/parsers.ts:441:43
 function structuredS5002Payload(
   document: ReturnXmlNode,
 ): Record<string, unknown> {
-  const workers = childElements(document, 'ideTrabalhador').map(
+  const workers = childElements(document, "").map(
     structuredS5002Worker,
   );

[Survived] ArrowFunction
domain/src/returns/parsers.ts:445:5
     structuredS5002Worker,
   );
   const retroactiveAdjustments = workers.flatMap(
-    (worker) => worker.retroactiveAdjustments,
+    () => undefined,
   );
 

[Survived] StringLiteral
domain/src/returns/parsers.ts:478:48
   const demonstratives = directChildElements(worker, 'dmDev').map(
     structuredS5002Demonstrative,
   );
-  const totalInfo = directChildElement(worker, 'totInfoIR');
+  const totalInfo = directChildElement(worker, "");
   const consolidatedMonthlyRows = totalInfo
     ? directChildElements(totalInfo, 'consolidApurMen').map(s5002MonthlyRow)

[Survived] StringLiteral
domain/src/returns/parsers.ts:482:57
   const consolidatedMonthlyRows = totalInfo
     ? directChildElements(totalInfo, 'consolidApurMen').map(s5002MonthlyRow)
     : [];
-  const complementaryInfo = directChildElements(worker, 'infoIRComplem').map(
+  const complementaryInfo = directChildElements(worker, "").map(
     structuredS5002ComplementaryInfo,
   );

[Survived] EqualityOperator
domain/src/returns/parsers.ts:523:7
     consolidatedTaxableIncomeTotal,
     consolidatedOfficialPensionTotal,
     irrfTotal:
-      demonstratives.length > 0
+      demonstratives.length >= 0
         ? demonstrativeIrrfTotal
         : consolidatedIrrfTotal,

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:523:7
     consolidatedTaxableIncomeTotal,
     consolidatedOfficialPensionTotal,
     irrfTotal:
-      demonstratives.length > 0
+      true
         ? demonstrativeIrrfTotal
         : consolidatedIrrfTotal,

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:527:7
         ? demonstrativeIrrfTotal
         : consolidatedIrrfTotal,
     taxableIncomeTotal:
-      demonstratives.length > 0
+      true
         ? demonstrativeTaxableIncomeTotal
         : consolidatedTaxableIncomeTotal,

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:527:7
         ? demonstrativeIrrfTotal
         : consolidatedIrrfTotal,
     taxableIncomeTotal:
-      demonstratives.length > 0
+      false
         ? demonstrativeTaxableIncomeTotal
         : consolidatedTaxableIncomeTotal,

[Survived] EqualityOperator
domain/src/returns/parsers.ts:531:7
         ? demonstrativeTaxableIncomeTotal
         : consolidatedTaxableIncomeTotal,
     officialPensionTotal:
-      demonstratives.length > 0
+      demonstratives.length >= 0
         ? demonstrativeOfficialPensionTotal
         : consolidatedOfficialPensionTotal,

[Survived] EqualityOperator
domain/src/returns/parsers.ts:531:7
         ? demonstrativeTaxableIncomeTotal
         : consolidatedTaxableIncomeTotal,
     officialPensionTotal:
-      demonstratives.length > 0
+      demonstratives.length <= 0
         ? demonstrativeOfficialPensionTotal
         : consolidatedOfficialPensionTotal,

[Survived] ArrowFunction
domain/src/returns/parsers.ts:542:63
   taxableIncomeTotal: MoneyText;
   officialPensionTotal: MoneyText;
 } {
-  const incomeRows = directChildElements(dmDev, 'infoIR').map((row) => ({
-    infoType: directChildText(row, 'tpInfoIR'),
-    amount: moneyText(directChildText(row, 'valor')),
-    incomeDescription: directChildText(row, 'descRendimento'),
-    judicialRubricProcesses: directChildElements(row, 'infoProcJudRub').map(
-      (process) => ({
-        processNumber: directChildText(process, 'nrProc'),
-        courtState: directChildText(process, 'ufVara'),
-        cityCode: directChildText(process, 'codMunic'),
-        courtId: directChildText(process, 'idVara'),
-      }),
-    ),
-  }));
+  const incomeRows = directChildElements(dmDev, 'infoIR').map(() => undefined);
   const monthlyRows = directChildElements(dmDev, 'totApurMen').map(
     s5002MonthlyRow,

[Survived] StringLiteral
domain/src/returns/parsers.ts:542:49
   taxableIncomeTotal: MoneyText;
   officialPensionTotal: MoneyText;
 } {
-  const incomeRows = directChildElements(dmDev, 'infoIR').map((row) => ({
+  const incomeRows = directChildElements(dmDev, "").map((row) => ({
     infoType: directChildText(row, 'tpInfoIR'),
     amount: moneyText(directChildText(row, 'valor')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:544:44
 } {
   const incomeRows = directChildElements(dmDev, 'infoIR').map((row) => ({
     infoType: directChildText(row, 'tpInfoIR'),
-    amount: moneyText(directChildText(row, 'valor')),
+    amount: moneyText(directChildText(row, "")),
     incomeDescription: directChildText(row, 'descRendimento'),
     judicialRubricProcesses: directChildElements(row, 'infoProcJudRub').map(

[Survived] StringLiteral
domain/src/returns/parsers.ts:546:55
     infoType: directChildText(row, 'tpInfoIR'),
     amount: moneyText(directChildText(row, 'valor')),
     incomeDescription: directChildText(row, 'descRendimento'),
-    judicialRubricProcesses: directChildElements(row, 'infoProcJudRub').map(
+    judicialRubricProcesses: directChildElements(row, "").map(
       (process) => ({
         processNumber: directChildText(process, 'nrProc'),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:547:7
     amount: moneyText(directChildText(row, 'valor')),
     incomeDescription: directChildText(row, 'descRendimento'),
     judicialRubricProcesses: directChildElements(row, 'infoProcJudRub').map(
-      (process) => ({
-        processNumber: directChildText(process, 'nrProc'),
-        courtState: directChildText(process, 'ufVara'),
-        cityCode: directChildText(process, 'codMunic'),
-        courtId: directChildText(process, 'idVara'),
-      }),
+      () => undefined,
     ),
   }));

[Survived] StringLiteral
domain/src/returns/parsers.ts:555:50
       }),
     ),
   }));
-  const monthlyRows = directChildElements(dmDev, 'totApurMen').map(
+  const monthlyRows = directChildElements(dmDev, "").map(
     s5002MonthlyRow,
   );

[Survived] StringLiteral
domain/src/returns/parsers.ts:558:48
   const monthlyRows = directChildElements(dmDev, 'totApurMen').map(
     s5002MonthlyRow,
   );
-  const dailyRows = directChildElements(dmDev, 'totApurDia').map((total) => ({
+  const dailyRows = directChildElements(dmDev, "").map((total) => ({
     day: directChildText(total, 'perApurDia'),
     revenueCode: directChildText(total, 'CRDia'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:559:33
     s5002MonthlyRow,
   );
   const dailyRows = directChildElements(dmDev, 'totApurDia').map((total) => ({
-    day: directChildText(total, 'perApurDia'),
+    day: directChildText(total, ""),
     revenueCode: directChildText(total, 'CRDia'),
     taxationForm: directChildText(total, 'frmTribut'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:561:42
   const dailyRows = directChildElements(dmDev, 'totApurDia').map((total) => ({
     day: directChildText(total, 'perApurDia'),
     revenueCode: directChildText(total, 'CRDia'),
-    taxationForm: directChildText(total, 'frmTribut'),
+    taxationForm: directChildText(total, ""),
     foreignResidenceCountry: directChildText(total, 'paisResidExt'),
     paidAmount: moneyText(directChildText(total, 'vlrPagoDia')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:606:56
   officialPension13: MoneyText;
   irrf: MoneyText;
 } {
-  const irrfMonthly = moneyText(directChildText(total, 'vlrCRMen'));
+  const irrfMonthly = moneyText(directChildText(total, ""));
   const irrf13 = moneyText(directChildText(total, 'vlrCR13Men'));
 

[Survived] StringLiteral
domain/src/returns/parsers.ts:615:55
     thirteenthTaxableIncome: moneyText(
       directChildText(total, 'vlrRendTrib13'),
     ),
-    officialPension: moneyText(directChildText(total, 'vlrPrevOficial')),
+    officialPension: moneyText(directChildText(total, "")),
     officialPension13: moneyText(directChildText(total, 'vlrPrevOficial13')),
     irrf: sumMoneyText([irrfMonthly, irrf13]),

[Survived] StringLiteral
domain/src/returns/parsers.ts:622:30
     irrf13,
     exemptOver65: moneyText(directChildText(total, 'vlrParcIsenta65')),
     exemptOver65Thirteenth: moneyText(
-      directChildText(total, 'vlrParcIsenta65Dec'),
+      directChildText(total, ""),
     ),
     dailyAllowances: moneyText(directChildText(total, 'vlrDiarias')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:624:55
     exemptOver65Thirteenth: moneyText(
       directChildText(total, 'vlrParcIsenta65Dec'),
     ),
-    dailyAllowances: moneyText(directChildText(total, 'vlrDiarias')),
+    dailyAllowances: moneyText(directChildText(total, "")),
     costAllowance: moneyText(directChildText(total, 'vlrAjudaCusto')),
     contractTerminationIndemnity: moneyText(

[Survived] StringLiteral
domain/src/returns/parsers.ts:630:59
       directChildText(total, 'vlrIndResContrato'),
     ),
     vacationBonus: moneyText(directChildText(total, 'vlrAbonoPec')),
-    severeIllnessIncome: moneyText(directChildText(total, 'vlrRendMoleGrave')),
+    severeIllnessIncome: moneyText(directChildText(total, "")),
     severeIllnessThirteenth: moneyText(
       directChildText(total, 'vlrRendMoleGrave13'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:632:30
     vacationBonus: moneyText(directChildText(total, 'vlrAbonoPec')),
     severeIllnessIncome: moneyText(directChildText(total, 'vlrRendMoleGrave')),
     severeIllnessThirteenth: moneyText(
-      directChildText(total, 'vlrRendMoleGrave13'),
+      directChildText(total, ""),
     ),
     housingAid: moneyText(directChildText(total, 'vlrAuxMoradia')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:637:52
     housingAid: moneyText(directChildText(total, 'vlrAuxMoradia')),
     medicalGrant: moneyText(directChildText(total, 'vlrBolsaMedico')),
     medicalGrantThirteenth: moneyText(directChildText(total, 'vlrBolsaMedico13')),
-    lateInterest: moneyText(directChildText(total, 'vlrJurosMora')),
+    lateInterest: moneyText(directChildText(total, "")),
     otherExempt: moneyText(directChildText(total, 'vlrIsenOutros')),
     incomeDescription: directChildText(total, 'descRendimento'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:648:40
   const judicialExpenses = directChildElement(node, 'despProcJud');
 
   return {
-    processType: directChildText(node, 'tpProcRRA'),
+    processType: directChildText(node, ""),
     processNumber: directChildText(node, 'nrProcRRA'),
     description: directChildText(node, 'descRRA'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:649:42
 
   return {
     processType: directChildText(node, 'tpProcRRA'),
-    processNumber: directChildText(node, 'nrProcRRA'),
+    processNumber: directChildText(node, ""),
     description: directChildText(node, 'descRRA'),
     monthCount: directChildText(node, 'qtdMesesRRA'),

[Survived] ObjectLiteral
domain/src/returns/parsers.ts:653:9
     description: directChildText(node, 'descRRA'),
     monthCount: directChildText(node, 'qtdMesesRRA'),
     judicialExpenses: judicialExpenses
-      ? {
-          courtCosts: moneyText(directChildText(judicialExpenses, 'vlrDespCustas')),
-          attorneys: moneyText(
-            directChildText(judicialExpenses, 'vlrDespAdvogados'),
-          ),
-        }
+      ? {}
       : null,
     attorneys: directChildElements(node, 'ideAdv').map((attorney) => ({

[Survived] StringLiteral
domain/src/returns/parsers.ts:654:67
     monthCount: directChildText(node, 'qtdMesesRRA'),
     judicialExpenses: judicialExpenses
       ? {
-          courtCosts: moneyText(directChildText(judicialExpenses, 'vlrDespCustas')),
+          courtCosts: moneyText(directChildText(judicialExpenses, "")),
           attorneys: moneyText(
             directChildText(judicialExpenses, 'vlrDespAdvogados'),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:660:56
           ),
         }
       : null,
-    attorneys: directChildElements(node, 'ideAdv').map((attorney) => ({
-      registrationType: directChildText(attorney, 'tpInsc'),
-      registrationNumber: directChildText(attorney, 'nrInsc'),
-      amount: directChildText(attorney, 'vlrAdv'),
-    })),
+    attorneys: directChildElements(node, 'ideAdv').map(() => undefined),
   };
 }

[Survived] ObjectLiteral
domain/src/returns/parsers.ts:660:71
           ),
         }
       : null,
-    attorneys: directChildElements(node, 'ideAdv').map((attorney) => ({
-      registrationType: directChildText(attorney, 'tpInsc'),
-      registrationNumber: directChildText(attorney, 'nrInsc'),
-      amount: directChildText(attorney, 'vlrAdv'),
-    })),
+    attorneys: directChildElements(node, 'ideAdv').map((attorney) => ({})),
   };
 }

[Survived] StringLiteral
domain/src/returns/parsers.ts:661:51
         }
       : null,
     attorneys: directChildElements(node, 'ideAdv').map((attorney) => ({
-      registrationType: directChildText(attorney, 'tpInsc'),
+      registrationType: directChildText(attorney, ""),
       registrationNumber: directChildText(attorney, 'nrInsc'),
       amount: directChildText(attorney, 'vlrAdv'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:685:42
           number: directChildText(address, 'endNrLograd'),
           complement: directChildText(address, 'endComplem'),
           district: directChildText(address, 'endBairro'),
-          city: directChildText(address, 'endCidade'),
+          city: directChildText(address, ""),
           state: directChildText(address, 'endEstado'),
           postalCode: directChildText(address, 'endCodPostal'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:704:46
   const previousPeriod = directChildElement(node, 'perAnt');
 
   return {
-    medicalReportDate: directChildText(node, 'dtLaudo'),
+    medicalReportDate: directChildText(node, ""),
     previousPeriodAdjustment: previousPeriod
       ? {

[Survived] StringLiteral
domain/src/returns/parsers.ts:712:42
         }
       : null,
     dependents: directChildElements(node, 'ideDep').map((dependent) => ({
-      cpfDep: directChildText(dependent, 'cpfDep'),
+      cpfDep: directChildText(dependent, ""),
       depIrrf: directChildText(dependent, 'depIRRF'),
       birthDate: directChildText(dependent, 'dtNascto'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:714:45
     dependents: directChildElements(node, 'ideDep').map((dependent) => ({
       cpfDep: directChildText(dependent, 'cpfDep'),
       depIrrf: directChildText(dependent, 'depIRRF'),
-      birthDate: directChildText(dependent, 'dtNascto'),
+      birthDate: directChildText(dependent, ""),
       name: directChildText(dependent, 'nome'),
       relationshipType: directChildText(dependent, 'tpDep'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:724:42
     ),
     healthPlans: directChildElements(node, 'planSaude').map((plan) => ({
       operatorCnpj: directChildText(plan, 'cnpjOper'),
-      ansRegistry: directChildText(plan, 'regANS'),
+      ansRegistry: directChildText(plan, ""),
       holderAmount: moneyText(directChildText(plan, 'vlrSaudeTit')),
       dependents: directChildElements(plan, 'infoDepSau').map((dependent) => ({
