[Survived] ArrowFunction
domain/src/returns/parsers.ts:726:63
       operatorCnpj: directChildText(plan, 'cnpjOper'),
       ansRegistry: directChildText(plan, 'regANS'),
       holderAmount: moneyText(directChildText(plan, 'vlrSaudeTit')),
-      dependents: directChildElements(plan, 'infoDepSau').map((dependent) => ({
-        cpfDep: directChildText(dependent, 'cpfDep'),
-        amount: moneyText(directChildText(dependent, 'vlrSaudeDep')),
-      })),
+      dependents: directChildElements(plan, 'infoDepSau').map(() => undefined),
     })),
   };

[Survived] StringLiteral
domain/src/returns/parsers.ts:727:44
       ansRegistry: directChildText(plan, 'regANS'),
       holderAmount: moneyText(directChildText(plan, 'vlrSaudeTit')),
       dependents: directChildElements(plan, 'infoDepSau').map((dependent) => ({
-        cpfDep: directChildText(dependent, 'cpfDep'),
+        cpfDep: directChildText(dependent, ""),
         amount: moneyText(directChildText(dependent, 'vlrSaudeDep')),
       })),

[Survived] StringLiteral
domain/src/returns/parsers.ts:728:54
       holderAmount: moneyText(directChildText(plan, 'vlrSaudeTit')),
       dependents: directChildElements(plan, 'infoDepSau').map((dependent) => ({
         cpfDep: directChildText(dependent, 'cpfDep'),
-        amount: moneyText(directChildText(dependent, 'vlrSaudeDep')),
+        amount: moneyText(directChildText(dependent, "")),
       })),
     })),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:738:7
   return {
     revenueType: directChildText(node, 'tpCR'),
     dependentDeductions: directChildElements(node, 'dedDepen').map(
-      (deduction) => ({
-        incomeType: directChildText(deduction, 'tpRend'),
-        cpfDep: directChildText(deduction, 'cpfDep'),
-        amount: moneyText(directChildText(deduction, 'vlrDedDep')),
-      }),
+      () => undefined,
     ),
     alimony: directChildElements(node, 'penAlim').map((alimony) => ({

[Survived] ObjectLiteral
domain/src/returns/parsers.ts:738:23
   return {
     revenueType: directChildText(node, 'tpCR'),
     dependentDeductions: directChildElements(node, 'dedDepen').map(
-      (deduction) => ({
-        incomeType: directChildText(deduction, 'tpRend'),
-        cpfDep: directChildText(deduction, 'cpfDep'),
-        amount: moneyText(directChildText(deduction, 'vlrDedDep')),
-      }),
+      (deduction) => ({}),
     ),
     alimony: directChildElements(node, 'penAlim').map((alimony) => ({

[Survived] StringLiteral
domain/src/returns/parsers.ts:739:48
     revenueType: directChildText(node, 'tpCR'),
     dependentDeductions: directChildElements(node, 'dedDepen').map(
       (deduction) => ({
-        incomeType: directChildText(deduction, 'tpRend'),
+        incomeType: directChildText(deduction, ""),
         cpfDep: directChildText(deduction, 'cpfDep'),
         amount: moneyText(directChildText(deduction, 'vlrDedDep')),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:744:55
         amount: moneyText(directChildText(deduction, 'vlrDedDep')),
       }),
     ),
-    alimony: directChildElements(node, 'penAlim').map((alimony) => ({
-      incomeType: directChildText(alimony, 'tpRend'),
-      cpfDep: directChildText(alimony, 'cpfDep'),
-      amount: moneyText(directChildText(alimony, 'vlrDedPenAlim')),
-    })),
+    alimony: directChildElements(node, 'penAlim').map(() => undefined),
     complementaryPension: directChildElements(node, 'previdCompl').map(
       (pension) => ({

[Survived] StringLiteral
domain/src/returns/parsers.ts:746:40
     ),
     alimony: directChildElements(node, 'penAlim').map((alimony) => ({
       incomeType: directChildText(alimony, 'tpRend'),
-      cpfDep: directChildText(alimony, 'cpfDep'),
+      cpfDep: directChildText(alimony, ""),
       amount: moneyText(directChildText(alimony, 'vlrDedPenAlim')),
     })),

[Survived] StringLiteral
domain/src/returns/parsers.ts:747:50
     alimony: directChildElements(node, 'penAlim').map((alimony) => ({
       incomeType: directChildText(alimony, 'tpRend'),
       cpfDep: directChildText(alimony, 'cpfDep'),
-      amount: moneyText(directChildText(alimony, 'vlrDedPenAlim')),
+      amount: moneyText(directChildText(alimony, "")),
     })),
     complementaryPension: directChildElements(node, 'previdCompl').map(

[Survived] ArrowFunction
domain/src/returns/parsers.ts:750:7
       amount: moneyText(directChildText(alimony, 'vlrDedPenAlim')),
     })),
     complementaryPension: directChildElements(node, 'previdCompl').map(
-      (pension) => ({
-        pensionType: directChildText(pension, 'tpPrev'),
-        entityCnpj: directChildText(pension, 'cnpjEntidPC'),
-        monthlyDeduction: moneyText(directChildText(pension, 'vlrDedPC')),
-        thirteenthDeduction: moneyText(directChildText(pension, 'vlrDedPC13')),
-        sponsorContribution: moneyText(directChildText(pension, 'vlrPatrocFunp')),
-        sponsorThirteenthContribution: moneyText(
-          directChildText(pension, 'vlrPatrocFunp13'),
-        ),
-      }),
+      () => undefined,
     ),
     retentionProcesses: directChildElements(node, 'infoProcRet').map(

[Survived] StringLiteral
domain/src/returns/parsers.ts:752:46
     complementaryPension: directChildElements(node, 'previdCompl').map(
       (pension) => ({
         pensionType: directChildText(pension, 'tpPrev'),
-        entityCnpj: directChildText(pension, 'cnpjEntidPC'),
+        entityCnpj: directChildText(pension, ""),
         monthlyDeduction: moneyText(directChildText(pension, 'vlrDedPC')),
         thirteenthDeduction: moneyText(directChildText(pension, 'vlrDedPC13')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:761:51
         ),
       }),
     ),
-    retentionProcesses: directChildElements(node, 'infoProcRet').map(
+    retentionProcesses: directChildElements(node, "").map(
       structuredS5002RetentionProcess,
     ),

[Survived] StringLiteral
domain/src/returns/parsers.ts:771:43
   return {
     processType: directChildText(node, 'tpProcRet'),
     processNumber: directChildText(node, 'nrProcRet'),
-    suspensionCode: directChildText(node, 'codSusp'),
+    suspensionCode: directChildText(node, ""),
     values: directChildElements(node, 'infoValores').map((value) => ({
       assessmentType: directChildText(value, 'indApuracao'),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:772:58
     processType: directChildText(node, 'tpProcRet'),
     processNumber: directChildText(node, 'nrProcRet'),
     suspensionCode: directChildText(node, 'codSusp'),
-    values: directChildElements(node, 'infoValores').map((value) => ({
-      assessmentType: directChildText(value, 'indApuracao'),
-      notWithheldAmount: moneyText(directChildText(value, 'vlrNRetido')),
-      judicialDeposit: moneyText(directChildText(value, 'vlrDepJud')),
-      currentYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoCal')),
-      previousYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoAnt')),
-      suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),
-      suspendedDeductions: directChildElements(value, 'dedSusp').map(
-        (deduction) => ({
-          deductionType: directChildText(deduction, 'indTpDeducao'),
-          amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
-          entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
-          sponsorContribution: moneyText(
-            directChildText(deduction, 'vlrPatrocFunp'),
-          ),
-          beneficiaries: directChildElements(deduction, 'benefPen').map(
-            (beneficiary) => ({
-              cpfDep: directChildText(beneficiary, 'cpfDep'),
-              amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
-            }),
-          ),
-        }),
-      ),
-    })),
+    values: directChildElements(node, 'infoValores').map(() => undefined),
   };
 }

[Survived] ObjectLiteral
domain/src/returns/parsers.ts:772:70
     processType: directChildText(node, 'tpProcRet'),
     processNumber: directChildText(node, 'nrProcRet'),
     suspensionCode: directChildText(node, 'codSusp'),
-    values: directChildElements(node, 'infoValores').map((value) => ({
-      assessmentType: directChildText(value, 'indApuracao'),
-      notWithheldAmount: moneyText(directChildText(value, 'vlrNRetido')),
-      judicialDeposit: moneyText(directChildText(value, 'vlrDepJud')),
-      currentYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoCal')),
-      previousYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoAnt')),
-      suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),
-      suspendedDeductions: directChildElements(value, 'dedSusp').map(
-        (deduction) => ({
-          deductionType: directChildText(deduction, 'indTpDeducao'),
-          amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
-          entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
-          sponsorContribution: moneyText(
-            directChildText(deduction, 'vlrPatrocFunp'),
-          ),
-          beneficiaries: directChildElements(deduction, 'benefPen').map(
-            (beneficiary) => ({
-              cpfDep: directChildText(beneficiary, 'cpfDep'),
-              amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
-            }),
-          ),
-        }),
-      ),
-    })),
+    values: directChildElements(node, 'infoValores').map((value) => ({})),
   };
 }

[Survived] StringLiteral
domain/src/returns/parsers.ts:776:65
       assessmentType: directChildText(value, 'indApuracao'),
       notWithheldAmount: moneyText(directChildText(value, 'vlrNRetido')),
       judicialDeposit: moneyText(directChildText(value, 'vlrDepJud')),
-      currentYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoCal')),
+      currentYearCompensation: moneyText(directChildText(value, "")),
       previousYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoAnt')),
       suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),

[Survived] StringLiteral
domain/src/returns/parsers.ts:779:55
       currentYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoCal')),
       previousYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoAnt')),
       suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),
-      suspendedDeductions: directChildElements(value, 'dedSusp').map(
+      suspendedDeductions: directChildElements(value, "").map(
         (deduction) => ({
           deductionType: directChildText(deduction, 'indTpDeducao'),

[Survived] ArrowFunction
domain/src/returns/parsers.ts:780:9
       previousYearCompensation: moneyText(directChildText(value, 'vlrCmpAnoAnt')),
       suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),
       suspendedDeductions: directChildElements(value, 'dedSusp').map(
-        (deduction) => ({
-          deductionType: directChildText(deduction, 'indTpDeducao'),
-          amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
-          entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
-          sponsorContribution: moneyText(
-            directChildText(deduction, 'vlrPatrocFunp'),
-          ),
-          beneficiaries: directChildElements(deduction, 'benefPen').map(
-            (beneficiary) => ({
-              cpfDep: directChildText(beneficiary, 'cpfDep'),
-              amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
-            }),
-          ),
-        }),
+        () => undefined,
       ),
     })),

[Survived] StringLiteral
domain/src/returns/parsers.ts:781:53
       suspendedIncome: moneyText(directChildText(value, 'vlrRendSusp')),
       suspendedDeductions: directChildElements(value, 'dedSusp').map(
         (deduction) => ({
-          deductionType: directChildText(deduction, 'indTpDeducao'),
+          deductionType: directChildText(deduction, ""),
           amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
           entityCnpj: directChildText(deduction, 'cnpjEntidPC'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:782:56
       suspendedDeductions: directChildElements(value, 'dedSusp').map(
         (deduction) => ({
           deductionType: directChildText(deduction, 'indTpDeducao'),
-          amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
+          amount: moneyText(directChildText(deduction, "")),
           entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
           sponsorContribution: moneyText(

[Survived] StringLiteral
domain/src/returns/parsers.ts:783:50
         (deduction) => ({
           deductionType: directChildText(deduction, 'indTpDeducao'),
           amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
-          entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
+          entityCnpj: directChildText(deduction, ""),
           sponsorContribution: moneyText(
             directChildText(deduction, 'vlrPatrocFunp'),

[Survived] StringLiteral
domain/src/returns/parsers.ts:785:40
           amount: moneyText(directChildText(deduction, 'vlrDedSusp')),
           entityCnpj: directChildText(deduction, 'cnpjEntidPC'),
           sponsorContribution: moneyText(
-            directChildText(deduction, 'vlrPatrocFunp'),
+            directChildText(deduction, ""),
           ),
           beneficiaries: directChildElements(deduction, 'benefPen').map(

[Survived] ArrowFunction
domain/src/returns/parsers.ts:788:13
             directChildText(deduction, 'vlrPatrocFunp'),
           ),
           beneficiaries: directChildElements(deduction, 'benefPen').map(
-            (beneficiary) => ({
-              cpfDep: directChildText(beneficiary, 'cpfDep'),
-              amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
-            }),
+            () => undefined,
           ),
         }),

[Survived] StringLiteral
domain/src/returns/parsers.ts:789:52
           ),
           beneficiaries: directChildElements(deduction, 'benefPen').map(
             (beneficiary) => ({
-              cpfDep: directChildText(beneficiary, 'cpfDep'),
+              cpfDep: directChildText(beneficiary, ""),
               amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
             }),

[Survived] StringLiteral
domain/src/returns/parsers.ts:790:62
           beneficiaries: directChildElements(deduction, 'benefPen').map(
             (beneficiary) => ({
               cpfDep: directChildText(beneficiary, 'cpfDep'),
-              amount: moneyText(directChildText(beneficiary, 'vlrDepenSusp')),
+              amount: moneyText(directChildText(beneficiary, "")),
             }),
           ),

[Survived] StringLiteral
domain/src/returns/parsers.ts:816:35
     employer: employerInfo(document),
     sourceEventReceipt: infoIrrf ? directChildText(infoIrrf, 'nrRecArqBase') : null,
     informationIndicator: infoIrrf
-      ? directChildText(infoIrrf, 'indExistInfo')
+      ? directChildText(infoIrrf, "")
       : null,
     monthlyRows,

[Survived] ArrowFunction
domain/src/returns/parsers.ts:821:26
     monthlyRows,
     dailyRows,
     items: [
-      ...monthlyRows.map((row) => s5012DebitItem(row, 'MONTHLY', null)),
+      ...monthlyRows.map(() => undefined),
       ...dailyRows.map((row) => s5012DebitItem(row, 'DAILY', row.day)),
     ],

[Survived] ArrowFunction
domain/src/returns/parsers.ts:822:24
     dailyRows,
     items: [
       ...monthlyRows.map((row) => s5012DebitItem(row, 'MONTHLY', null)),
-      ...dailyRows.map((row) => s5012DebitItem(row, 'DAILY', row.day)),
+      ...dailyRows.map(() => undefined),
     ],
     monthlyIrrfTotal,

[Survived] ArrayDeclaration
domain/src/returns/parsers.ts:826:29
     ],
     monthlyIrrfTotal,
     dailyIrrfTotal,
-    irrfTotal: sumMoneyText([monthlyIrrfTotal, dailyIrrfTotal]),
+    irrfTotal: sumMoneyText([]),
   };
 }

[Survived] StringLiteral
domain/src/returns/parsers.ts:835:39
   irrf: MoneyText;
 } {
   return {
-    revenueCode: directChildText(row, 'CRMen'),
+    revenueCode: directChildText(row, ""),
     irrf: moneyText(directChildText(row, 'vrCRMen')),
   };

[Survived] StringLiteral
domain/src/returns/parsers.ts:848:42
   return {
     day: directChildText(row, 'perApurDia'),
     revenueCode: directChildText(row, 'CRDia'),
-    irrf: moneyText(directChildText(row, 'vrCRDia')),
+    irrf: moneyText(directChildText(row, "")),
   };
 }

[Survived] ObjectLiteral
domain/src/returns/parsers.ts:857:10
   period: 'MONTHLY' | 'DAILY',
   day: string | null,
 ): Record<string, string | null> {
-  return {
-    debitCode: row.revenueCode ?? 'IRRF',
-    baseAmount: '0.00',
-    amount: row.irrf,
-    period,
-    day,
-  };
+  return {};
 }
 

[Survived] LogicalOperator
domain/src/returns/parsers.ts:858:16
   day: string | null,
 ): Record<string, string | null> {
   return {
-    debitCode: row.revenueCode ?? 'IRRF',
+    debitCode: row.revenueCode && 'IRRF',
     baseAmount: '0.00',
     amount: row.irrf,

[Survived] BooleanLiteral
domain/src/returns/parsers.ts:870:7
   if (!node) return null;
   const tpInsc = directChildText(node, 'tpInsc');
   const nrInsc = directChildText(node, 'nrInsc');
-  if (!tpInsc || !nrInsc) return null;
+  if (tpInsc || !nrInsc) return null;
   const mapped =
     IDENTITY_FIELD_BY_TPINSC[tpInsc as keyof typeof IDENTITY_FIELD_BY_TPINSC];

[Survived] BlockStatement
domain/src/returns/parsers.ts:873:16
   if (!tpInsc || !nrInsc) return null;
   const mapped =
     IDENTITY_FIELD_BY_TPINSC[tpInsc as keyof typeof IDENTITY_FIELD_BY_TPINSC];
-  if (!mapped) {
-    throw new ReturnXmlParseError(`Unsupported eSocial tpInsc: ${tpInsc}`);
-  }
+  if (!mapped) {}
   const [type, field] = mapped;
   return {

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:873:7
   if (!tpInsc || !nrInsc) return null;
   const mapped =
     IDENTITY_FIELD_BY_TPINSC[tpInsc as keyof typeof IDENTITY_FIELD_BY_TPINSC];
-  if (!mapped) {
+  if (false) {
     throw new ReturnXmlParseError(`Unsupported eSocial tpInsc: ${tpInsc}`);
   }

[Survived] StringLiteral
domain/src/returns/parsers.ts:885:47
 }
 
 function employerInfo(document: ReturnXmlNode): Record<string, string | null> {
-  const employerNode = firstElement(document, 'ideEmpregador');
+  const employerNode = firstElement(document, "");
   return {
     registrationType: employerNode

[Survived] LogicalOperator
domain/src/returns/parsers.ts:900:5
   const fault = firstElement(document, 'Fault');
   if (!fault) return null;
   return (
-    firstOptionalText(fault, 'faultstring') ??
-    firstOptionalText(fault, 'Reason') ??
-    firstOptionalText(fault, 'Text') ??
-    'SOAP Fault'
+    (firstOptionalText(fault, 'faultstring') ?? firstOptionalText(fault, 'Reason') ?? firstOptionalText(fault, 'Text')) && 'SOAP Fault'
   );
 }

[Survived] LogicalOperator
domain/src/returns/parsers.ts:900:5
   const fault = firstElement(document, 'Fault');
   if (!fault) return null;
   return (
-    firstOptionalText(fault, 'faultstring') ??
-    firstOptionalText(fault, 'Reason') ??
+    firstOptionalText(fault, 'faultstring') && firstOptionalText(fault, 'Reason') ??
     firstOptionalText(fault, 'Text') ??
     'SOAP Fault'

[Survived] ArrowFunction
domain/src/returns/parsers.ts:909:45
 
 function totalizerEventElement(document: ReturnXmlNode): string | null {
   return (
-    Object.keys(KIND_BY_EVENT_ELEMENT).find((name) =>
-      Boolean(firstElement(document, name)),
+    Object.keys(KIND_BY_EVENT_ELEMENT).find(() => undefined,
     ) ?? null
   );

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:916:7
 }
 
 function occurrenceType(value: string | null): ReturnOccurrence['type'] {
-  if (value === '2') return 'WARNING';
+  if (true) return 'WARNING';
   if (value === '3') return 'HISTORY';
   return 'ERROR';

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:916:7
 }
 
 function occurrenceType(value: string | null): ReturnOccurrence['type'] {
-  if (value === '2') return 'WARNING';
+  if (false) return 'WARNING';
   if (value === '3') return 'HISTORY';
   return 'ERROR';

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:917:7
 
 function occurrenceType(value: string | null): ReturnOccurrence['type'] {
   if (value === '2') return 'WARNING';
-  if (value === '3') return 'HISTORY';
+  if (true) return 'HISTORY';
   return 'ERROR';
 }

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:917:7
 
 function occurrenceType(value: string | null): ReturnOccurrence['type'] {
   if (value === '2') return 'WARNING';
-  if (value === '3') return 'HISTORY';
+  if (false) return 'HISTORY';
   return 'ERROR';
 }

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:922:7
 }
 
 function numberOrNull(value: string | null): number | null {
-  if (!value) return null;
+  if (false) return null;
   const parsed = Number(value);
   return Number.isFinite(parsed) ? parsed : null;

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:922:7
 }
 
 function numberOrNull(value: string | null): number | null {
-  if (!value) return null;
+  if (true) return null;
   const parsed = Number(value);
   return Number.isFinite(parsed) ? parsed : null;

[Survived] MethodExpression
domain/src/returns/parsers.ts:928:19
 }
 
 function monthCompetence(value: string): string {
-  const trimmed = value.trim();
+  const trimmed = value;
   if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
   if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:929:7
 
 function monthCompetence(value: string): string {
   const trimmed = value.trim();
-  if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
+  if (false) return trimmed;
   if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);
   throw new ReturnXmlParseError(`Invalid eSocial competence: ${value}`);

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:929:7
 
 function monthCompetence(value: string): string {
   const trimmed = value.trim();
-  if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
+  if (true) return trimmed;
   if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);
   throw new ReturnXmlParseError(`Invalid eSocial competence: ${value}`);

[Survived] MethodExpression
domain/src/returns/parsers.ts:930:52
 function monthCompetence(value: string): string {
   const trimmed = value.trim();
   if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
-  if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);
+  if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed;
   throw new ReturnXmlParseError(`Invalid eSocial competence: ${value}`);
 }

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:930:7
 function monthCompetence(value: string): string {
   const trimmed = value.trim();
   if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
-  if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);
+  if (true) return trimmed.slice(0, 7);
   throw new ReturnXmlParseError(`Invalid eSocial competence: ${value}`);
 }

[Survived] StringLiteral
domain/src/returns/parsers.ts:931:33
   const trimmed = value.trim();
   if (/^\d{4}-\d{2}$/u.test(trimmed)) return trimmed;
   if (/^\d{4}-\d{2}-\d{2}$/u.test(trimmed)) return trimmed.slice(0, 7);
-  throw new ReturnXmlParseError(`Invalid eSocial competence: ${value}`);
+  throw new ReturnXmlParseError(``);
 }
 

[Survived] MethodExpression
domain/src/returns/parsers.ts:946:10
 }
 
 function directText(node: ReturnXmlNode): string {
-  return node.text.trim();
+  return node.text;
 }
 

[Survived] ArithmeticOperator
domain/src/returns/parsers.ts:951:35
 
 function sumMoneyText(values: Array<string | null>): string {
   return centsToMoney(
-    values.reduce((sum, value) => sum + moneyToCents(value), 0n),
+    values.reduce((sum, value) => sum - moneyToCents(value), 0n),
   );
 }

[Survived] BlockStatement
domain/src/returns/parsers.ts:955:50
   );
 }
 
-function moneyText(value: string | null): string {
-  return centsToMoney(moneyToCents(value));
-}
+function moneyText(value: string | null): string {}
 
 function moneyToCents(value: string | null): bigint {

[Survived] MethodExpression
domain/src/returns/parsers.ts:961:22
 
 function moneyToCents(value: string | null): bigint {
   if (!value) return 0n;
-  const normalized = value.trim().replace(',', '.');
+  const normalized = value.replace(',', '.');
   const sign = normalized.startsWith('-') ? -1n : 1n;
   const unsigned = normalized.replace(/^-/, '');

[Survived] MethodExpression
domain/src/returns/parsers.ts:962:16
 function moneyToCents(value: string | null): bigint {
   if (!value) return 0n;
   const normalized = value.trim().replace(',', '.');
-  const sign = normalized.startsWith('-') ? -1n : 1n;
+  const sign = normalized.endsWith('-') ? -1n : 1n;
   const unsigned = normalized.replace(/^-/, '');
   const [reais, cents = ''] = unsigned.split('.');

[Survived] StringLiteral
domain/src/returns/parsers.ts:962:38
 function moneyToCents(value: string | null): bigint {
   if (!value) return 0n;
   const normalized = value.trim().replace(',', '.');
-  const sign = normalized.startsWith('-') ? -1n : 1n;
+  const sign = normalized.startsWith("") ? -1n : 1n;
   const unsigned = normalized.replace(/^-/, '');
   const [reais, cents = ''] = unsigned.split('.');

[Survived] Regex
domain/src/returns/parsers.ts:963:39
   if (!value) return 0n;
   const normalized = value.trim().replace(',', '.');
   const sign = normalized.startsWith('-') ? -1n : 1n;
-  const unsigned = normalized.replace(/^-/, '');
+  const unsigned = normalized.replace(/-/, '');
   const [reais, cents = ''] = unsigned.split('.');
   return (

[Survived] StringLiteral
domain/src/returns/parsers.ts:963:45
   if (!value) return 0n;
   const normalized = value.trim().replace(',', '.');
   const sign = normalized.startsWith('-') ? -1n : 1n;
-  const unsigned = normalized.replace(/^-/, '');
+  const unsigned = normalized.replace(/^-/, "Stryker was here!");
   const [reais, cents = ''] = unsigned.split('.');
   return (

[Survived] StringLiteral
domain/src/returns/parsers.ts:964:25
   const normalized = value.trim().replace(',', '.');
   const sign = normalized.startsWith('-') ? -1n : 1n;
   const unsigned = normalized.replace(/^-/, '');
-  const [reais, cents = ''] = unsigned.split('.');
+  const [reais, cents = "Stryker was here!"] = unsigned.split('.');
   return (
     sign *

[Survived] ArithmeticOperator
domain/src/returns/parsers.ts:966:5
   const unsigned = normalized.replace(/^-/, '');
   const [reais, cents = ''] = unsigned.split('.');
   return (
-    sign *
-    (BigInt(reais || '0') * 100n +
-      BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
+    sign / (BigInt(reais || '0') * 100n + BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
   );
 }

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:967:13
   const [reais, cents = ''] = unsigned.split('.');
   return (
     sign *
-    (BigInt(reais || '0') * 100n +
+    (BigInt(true) * 100n +
       BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
   );

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:967:13
   const [reais, cents = ''] = unsigned.split('.');
   return (
     sign *
-    (BigInt(reais || '0') * 100n +
+    (BigInt(false) * 100n +
       BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
   );

[Survived] LogicalOperator
domain/src/returns/parsers.ts:968:15
   return (
     sign *
     (BigInt(reais || '0') * 100n +
-      BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
+      BigInt((cents.padEnd(2, '0').slice(0, 2) && '0').replace(/\D/gu, '0')))
   );
 }

[Survived] MethodExpression
domain/src/returns/parsers.ts:968:15
   return (
     sign *
     (BigInt(reais || '0') * 100n +
-      BigInt((cents.padEnd(2, '0').slice(0, 2) || '0').replace(/\D/gu, '0')))
+      BigInt((cents.padEnd(2, '0') || '0').replace(/\D/gu, '0')))
   );
 }

[Survived] EqualityOperator
domain/src/returns/parsers.ts:973:16
 }
 
 function centsToMoney(value: bigint): string {
-  const sign = value < 0n ? '-' : '';
+  const sign = value <= 0n ? '-' : '';
   const absolute = value < 0n ? -value : value;
   return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;

[Survived] EqualityOperator
domain/src/returns/parsers.ts:973:16
 }
 
 function centsToMoney(value: bigint): string {
-  const sign = value < 0n ? '-' : '';
+  const sign = value >= 0n ? '-' : '';
   const absolute = value < 0n ? -value : value;
   return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;

[Survived] EqualityOperator
domain/src/returns/parsers.ts:974:20
 
 function centsToMoney(value: bigint): string {
   const sign = value < 0n ? '-' : '';
-  const absolute = value < 0n ? -value : value;
+  const absolute = value <= 0n ? -value : value;
   return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;
 }

[Survived] EqualityOperator
domain/src/returns/parsers.ts:974:20
 
 function centsToMoney(value: bigint): string {
   const sign = value < 0n ? '-' : '';
-  const absolute = value < 0n ? -value : value;
+  const absolute = value >= 0n ? -value : value;
   return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;
 }

[Survived] ArithmeticOperator
domain/src/returns/parsers.ts:975:46
 function centsToMoney(value: bigint): string {
   const sign = value < 0n ? '-' : '';
   const absolute = value < 0n ? -value : value;
-  return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;
+  return `${sign}${absolute / 100n}.${String(absolute * 100n).padStart(2, '0')}`;
 }
 
