[Survived] ArithmeticOperator
domain/src/returns/parsers.ts:975:20
 function centsToMoney(value: bigint): string {
   const sign = value < 0n ? '-' : '';
   const absolute = value < 0n ? -value : value;
-  return `${sign}${absolute / 100n}.${String(absolute % 100n).padStart(2, '0')}`;
+  return `${sign}${absolute * 100n}.${String(absolute % 100n).padStart(2, '0')}`;
 }
 

[Survived] LogicalOperator
domain/src/returns/parsers.ts:979:10
 }
 
 function isPresent<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return value !== null || value !== undefined;
 }
 

[Survived] ConditionalExpression
domain/src/returns/parsers.ts:979:10
 }
 
 function isPresent<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return true;
 }
 
