[Survived] ArrowFunction
domain/src/submission/submission-router.ts:54:40
 export function routeSubmissionEventClass(
   eventClass: EsocialRelayEventClass,
 ): SubmissionRoute {
-  const route = SUBMISSION_ROUTES.find((candidate) =>
-    candidate.eventClasses.includes(eventClass),
+  const route = SUBMISSION_ROUTES.find(() => undefined,
   );
 
