[Survived] MethodExpression
domain/src/transport/submission-publishers.ts:82:21
 ): SubmissionFifoMetadata {
   return {
     // Per-tenant/event-class ordering avoids cross-tenant serialization.
-    messageGroupId: `${envelope.tenant_id}:${envelope.event_class}`.slice(0, 128),
+    messageGroupId: `${envelope.tenant_id}:${envelope.event_class}`,
     messageDeduplicationId: createHash('sha256')
       .update(`${envelope['idempotency-key']}:${outboundEventId}`)

[Survived] StringLiteral
domain/src/transport/submission-publishers.ts:82:21
 ): SubmissionFifoMetadata {
   return {
     // Per-tenant/event-class ordering avoids cross-tenant serialization.
-    messageGroupId: `${envelope.tenant_id}:${envelope.event_class}`.slice(0, 128),
+    messageGroupId: ``.slice(0, 128),
     messageDeduplicationId: createHash('sha256')
       .update(`${envelope['idempotency-key']}:${outboundEventId}`)
