[Survived] StringLiteral
domain/src/config/index.ts:74:39
     eventBusName: optionalNonEmpty(env, 'ESOCIAL_EVENT_BUS_NAME'),
     queues: {
       responseQueueUrl: optionalUrl(env, 'ESOCIAL_RESPONSE_QUEUE_URL'),
-      spoolQueueUrl: optionalUrl(env, 'ESOCIAL_SPOOL_QUEUE_URL'),
+      spoolQueueUrl: optionalUrl(env, ""),
       retryQueueUrl: optionalUrl(env, 'ESOCIAL_RETRY_QUEUE_URL'),
       dlqQueueUrl: optionalUrl(env, 'ESOCIAL_DLQ_QUEUE_URL'),

[Survived] LogicalOperator
domain/src/config/index.ts:81:9
     aws: {
       region: optionalNonEmpty(env, 'AWS_REGION') ?? 'us-east-1',
       secretsManagerEndpoint:
-        optionalUrl(env, 'AWS_ENDPOINT_URL_SECRETS_MANAGER')
-        ?? optionalUrl(env, 'AWS_ENDPOINT_URL'),
+        optionalUrl(env, 'AWS_ENDPOINT_URL_SECRETS_MANAGER') && optionalUrl(env, 'AWS_ENDPOINT_URL'),
     },
     soapEndpoints: loadSoapEndpointConfig(env),

[Survived] StringLiteral
domain/src/config/index.ts:81:26
     aws: {
       region: optionalNonEmpty(env, 'AWS_REGION') ?? 'us-east-1',
       secretsManagerEndpoint:
-        optionalUrl(env, 'AWS_ENDPOINT_URL_SECRETS_MANAGER')
+        optionalUrl(env, "")
         ?? optionalUrl(env, 'AWS_ENDPOINT_URL'),
     },

[Survived] StringLiteral
domain/src/config/index.ts:101:7
     responseQueueUrl: requireConfigValue(
       config.queues.responseQueueUrl,
       'ESOCIAL_RESPONSE_QUEUE_URL',
-      'ESOCIAL_RESPONSE_QUEUE_URL is required for the submission handler.',
+      "",
     ),
     spoolQueueUrl: requireConfigValue(

[Survived] StringLiteral
domain/src/config/index.ts:110:7
     ),
     retryQueueUrl: requireConfigValue(
       config.queues.retryQueueUrl,
-      'ESOCIAL_RETRY_QUEUE_URL',
+      "",
       'ESOCIAL_RETRY_QUEUE_URL is required for the submission handler.',
     ),

[Survived] StringLiteral
domain/src/config/index.ts:116:7
     dlqQueueUrl: requireConfigValue(
       config.queues.dlqQueueUrl,
       'ESOCIAL_DLQ_QUEUE_URL',
-      'ESOCIAL_DLQ_QUEUE_URL is required for the submission handler.',
+      "",
     ),
     eventBusName: requireConfigValue(

[Survived] StringLiteral
domain/src/config/index.ts:134:7
     databaseUrl: requireConfigValue(
       config.databaseUrl,
       'ESOCIAL_DATABASE_URL',
-      'ESOCIAL_DATABASE_URL is required for the return handler.',
+      "",
     ),
     spoolQueueUrl: requireConfigValue(

[Survived] StringLiteral
domain/src/config/index.ts:143:7
     ),
     dlqQueueUrl: requireConfigValue(
       config.queues.dlqQueueUrl,
-      'ESOCIAL_DLQ_QUEUE_URL',
+      "",
       'ESOCIAL_DLQ_QUEUE_URL is required for the return handler.',
     ),

[Survived] StringLiteral
domain/src/config/index.ts:149:7
     eventBusName: requireConfigValue(
       config.eventBusName,
       'ESOCIAL_EVENT_BUS_NAME',
-      'ESOCIAL_EVENT_BUS_NAME is required for the return handler.',
+      "",
     ),
   };

[Survived] BlockStatement
domain/src/config/index.ts:171:78
 
 export function readNodeEnvironment(env: EnvReader = process.env): NodeEnvironment {
   const value = optionalNonEmpty(env, 'NODE_ENV') ?? 'development';
-  if (value === 'development' || value === 'test' || value === 'production') {
-    return value;
-  }
+  if (value === 'development' || value === 'test' || value === 'production') {}
   throw new ConfigurationError(
     `NODE_ENV must be development, test, or production; received ${value}.`,

[Survived] ConditionalExpression
domain/src/config/index.ts:171:34
 
 export function readNodeEnvironment(env: EnvReader = process.env): NodeEnvironment {
   const value = optionalNonEmpty(env, 'NODE_ENV') ?? 'development';
-  if (value === 'development' || value === 'test' || value === 'production') {
+  if (value === 'development' || false || value === 'production') {
     return value;
   }

[Survived] ObjectLiteral
domain/src/config/index.ts:216:10
       retryQueueUrl: redact(config.queues.retryQueueUrl),
       dlqQueueUrl: redact(config.queues.dlqQueueUrl),
     },
-    aws: {
-      region: config.aws.region,
-      secretsManagerEndpoint: redact(config.aws.secretsManagerEndpoint),
-    },
+    aws: {},
     soapEndpoints: Object.fromEntries(
       Object.entries(config.soapEndpoints).map(([environment, endpoints]) => [

[Survived] OptionalChaining
domain/src/config/index.ts:224:26
       Object.entries(config.soapEndpoints).map(([environment, endpoints]) => [
         environment,
         {
-          submit: redact(endpoints?.submit),
+          submit: redact(endpoints.submit),
           returnQuery: redact(endpoints?.returnQuery),
         },

[Survived] OptionalChaining
domain/src/config/index.ts:225:31
         environment,
         {
           submit: redact(endpoints?.submit),
-          returnQuery: redact(endpoints?.returnQuery),
+          returnQuery: redact(endpoints.returnQuery),
         },
       ]),

[Survived] MethodExpression
domain/src/config/index.ts:236:29
   env: EnvReader,
   environment: SoapEnvironment,
 ): SoapEndpointSet | undefined {
-  const prefix = `ESOCIAL_${environment.toUpperCase()}`;
+  const prefix = `ESOCIAL_${environment.toLowerCase()}`;
   const submit = optionalUrl(env, `${prefix}_SOAP_SUBMIT_URL`);
   const returnQuery = optionalUrl(env, `${prefix}_SOAP_RETURN_URL`);

[Survived] StringLiteral
domain/src/config/index.ts:236:18
   env: EnvReader,
   environment: SoapEnvironment,
 ): SoapEndpointSet | undefined {
-  const prefix = `ESOCIAL_${environment.toUpperCase()}`;
+  const prefix = ``;
   const submit = optionalUrl(env, `${prefix}_SOAP_SUBMIT_URL`);
   const returnQuery = optionalUrl(env, `${prefix}_SOAP_RETURN_URL`);

[Survived] ConditionalExpression
domain/src/config/index.ts:239:7
   const prefix = `ESOCIAL_${environment.toUpperCase()}`;
   const submit = optionalUrl(env, `${prefix}_SOAP_SUBMIT_URL`);
   const returnQuery = optionalUrl(env, `${prefix}_SOAP_RETURN_URL`);
-  if (!submit && !returnQuery) return undefined;
+  if (false) return undefined;
   if (!submit) {
     throw new ConfigurationError(

[Survived] BooleanLiteral
domain/src/config/index.ts:239:7
   const prefix = `ESOCIAL_${environment.toUpperCase()}`;
   const submit = optionalUrl(env, `${prefix}_SOAP_SUBMIT_URL`);
   const returnQuery = optionalUrl(env, `${prefix}_SOAP_RETURN_URL`);
-  if (!submit && !returnQuery) return undefined;
+  if (submit && !returnQuery) return undefined;
   if (!submit) {
     throw new ConfigurationError(

[Survived] StringLiteral
domain/src/config/index.ts:244:7
     throw new ConfigurationError(
       `${prefix}_SOAP_SUBMIT_URL is required when ${prefix}_SOAP_RETURN_URL is configured.`,
       `${prefix}_SOAP_SUBMIT_URL`,
-      'CONFIG_SOAP_ENDPOINT_INCOMPLETE',
+      "",
     );
   }

[Survived] StringLiteral
domain/src/config/index.ts:249:7
   }
   if (!returnQuery) {
     throw new ConfigurationError(
-      `${prefix}_SOAP_RETURN_URL is required when ${prefix}_SOAP_SUBMIT_URL is configured.`,
+      ``,
       `${prefix}_SOAP_RETURN_URL`,
       'CONFIG_SOAP_ENDPOINT_INCOMPLETE',

[Survived] MethodExpression
domain/src/config/index.ts:268:19
 function optionalNonEmpty(env: EnvReader, key: string): string | undefined {
   const value = env[key];
   if (value === undefined) return undefined;
-  const trimmed = value.trim();
+  const trimmed = value;
   return trimmed.length > 0 ? trimmed : undefined;
 }

[Survived] EqualityOperator
domain/src/config/index.ts:269:10
   const value = env[key];
   if (value === undefined) return undefined;
   const trimmed = value.trim();
-  return trimmed.length > 0 ? trimmed : undefined;
+  return trimmed.length >= 0 ? trimmed : undefined;
 }
 

[Survived] EqualityOperator
domain/src/config/index.ts:269:10
   const value = env[key];
   if (value === undefined) return undefined;
   const trimmed = value.trim();
-  return trimmed.length > 0 ? trimmed : undefined;
+  return trimmed.length <= 0 ? trimmed : undefined;
 }
 

[Survived] BlockStatement
domain/src/config/index.ts:275:7
 function optionalUrl(env: EnvReader, key: string): string | undefined {
   const value = optionalNonEmpty(env, key);
   if (!value) return undefined;
-  try {
-    new URL(value);
-    return value;
-  } catch {
+  try {} catch {
     throw new ConfigurationError(
       `${key} must be a valid URL.`,

[Survived] BlockStatement
domain/src/config/index.ts:278:11
   try {
     new URL(value);
     return value;
-  } catch {
-    throw new ConfigurationError(
-      `${key} must be a valid URL.`,
-      key,
-      'CONFIG_URL_INVALID',
-    );
-  }
+  } catch {}
 }
 

[Survived] StringLiteral
domain/src/config/index.ts:280:7
     return value;
   } catch {
     throw new ConfigurationError(
-      `${key} must be a valid URL.`,
+      ``,
       key,
       'CONFIG_URL_INVALID',

[Survived] StringLiteral
domain/src/config/index.ts:282:7
     throw new ConfigurationError(
       `${key} must be a valid URL.`,
       key,
-      'CONFIG_URL_INVALID',
+      "",
     );
   }

[Survived] ConditionalExpression
domain/src/config/index.ts:288:10
 }
 
 function readBoolean(value: string | undefined): boolean {
-  return value === 'true' || value === '1';
+  return true;
 }
 

[Survived] ConditionalExpression
domain/src/config/index.ts:288:30
 }
 
 function readBoolean(value: string | undefined): boolean {
-  return value === 'true' || value === '1';
+  return value === 'true' || false;
 }
 

[Survived] ConditionalExpression
domain/src/config/index.ts:292:7
 }
 
 function redact(value: string | undefined): string | undefined {
-  if (!value) return undefined;
+  if (true) return undefined;
   return '[configured]';
 }

[Survived] BooleanLiteral
domain/src/config/index.ts:292:7
 }
 
 function redact(value: string | undefined): string | undefined {
-  if (!value) return undefined;
+  if (value) return undefined;
   return '[configured]';
 }
