[Survived] ArrayDeclaration
src/builders/s1020/builder.ts:11:25
   dto: S1020TaxLotationDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'sourceEntityId',
-    'employerCnpj',
-    'validityStart',
-    'lotationCode',
-  ]);
+  validateRequired(dto, []);
   const sourceEntityId = dto.sourceEntityId ?? dto.sourceEventId;
   return buildPromotedTableXml({

[Survived] StringLiteral
src/builders/s1020/builder.ts:16:5
     'sourceEventId',
     'sourceEntityId',
     'employerCnpj',
-    'validityStart',
+    "",
     'lotationCode',
   ]);

[Survived] StringLiteral
src/builders/s1020/builder.ts:17:5
     'sourceEntityId',
     'employerCnpj',
     'validityStart',
-    'lotationCode',
+    "",
   ]);
   const sourceEntityId = dto.sourceEntityId ?? dto.sourceEventId;

[Survived] EqualityOperator
src/builders/s1020/builder.ts:38:10
 }
 
 function environmentCode(ctx: BuilderContext): '1' | '2' {
-  return ctx.environment === 'production' ? '1' : '2';
+  return ctx.environment !== 'production' ? '1' : '2';
 }
 

[Survived] ConditionalExpression
src/builders/s1020/builder.ts:38:10
 }
 
 function environmentCode(ctx: BuilderContext): '1' | '2' {
-  return ctx.environment === 'production' ? '1' : '2';
+  return true ? '1' : '2';
 }
 
