[Survived] StringLiteral
src/builders/s1005/builder.ts:17:5
     'sourceEntityId',
     'employerCnpj',
     'validityStart',
-    'establishmentRegistrationNumber',
+    "",
   ]);
   const sourceEntityId = dto.sourceEntityId ?? dto.sourceEventId;

[Survived] ConditionalExpression
src/builders/s1005/builder.ts:36:10
 }
 
 function environmentCode(ctx: BuilderContext): '1' | '2' {
-  return ctx.environment === 'production' ? '1' : '2';
+  return false ? '1' : '2';
 }
 
