[Survived] StringLiteral
src/builders/s1050/builder.ts:18:5
     'employerCnpj',
     'validityStart',
     'workScheduleCode',
-    'description',
+    "",
     'dailyHours',
   ]);

[Survived] StringLiteral
src/builders/s1050/builder.ts:19:5
     'validityStart',
     'workScheduleCode',
     'description',
-    'dailyHours',
+    "",
   ]);
   const sourceEntityId = dto.sourceEntityId ?? dto.sourceEventId;
