[Survived] ArrowFunction
domain/src/xml/xsd-validation.ts:85:14
   constructor(readonly result: PromotedTableXsdValidationResult) {
     super(
       `eSocial ${result.eventClass} XML failed XSD validation: ${result.issues
-        .map((issue) => issue.message)
+        .map(() => undefined)
         .join('; ')}`,
     );

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:88:17
         .map((issue) => issue.message)
         .join('; ')}`,
     );
-    this.name = 'XsdValidationError';
+    this.name = "";
   }
 }

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:95:53
 export class InMemoryXsdValidationFailureSink implements XsdValidationFailureSink {
   readonly failures: XsdValidationFailureRecord[] = [];
 
-  record(failure: XsdValidationFailureRecord): void {
-    this.failures.push(failure);
-  }
+  record(failure: XsdValidationFailureRecord): void {}
 }
 

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:105:7
   sink: XsdValidationFailureSink,
 ): Promise<PromotedTableXsdValidationResult> {
   const result = validatePromotedTableXml(input);
-  if (!result.valid) {
+  if (result.valid) {
     await Promise.all(
       result.issues.map((issue) =>

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:105:22
   sink: XsdValidationFailureSink,
 ): Promise<PromotedTableXsdValidationResult> {
   const result = validatePromotedTableXml(input);
-  if (!result.valid) {
-    await Promise.all(
-      result.issues.map((issue) =>
-        sink.record(toFailureRecord(input, result, issue)),
-      ),
-    );
-  }
+  if (!result.valid) {}
   return result;
 }

[Survived] ArrowFunction
domain/src/xml/xsd-validation.ts:107:25
   const result = validatePromotedTableXml(input);
   if (!result.valid) {
     await Promise.all(
-      result.issues.map((issue) =>
-        sink.record(toFailureRecord(input, result, issue)),
+      result.issues.map(() => undefined,
       ),
     );

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:119:7
   input: PromotedTableXsdValidationInput,
 ): PromotedTableXsdValidationResult {
   const result = validatePromotedTableXml(input);
-  if (!result.valid) throw new XsdValidationError(result);
+  if (false) throw new XsdValidationError(result);
   return result;
 }

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:119:7
   input: PromotedTableXsdValidationInput,
 ): PromotedTableXsdValidationResult {
   const result = validatePromotedTableXml(input);
-  if (!result.valid) throw new XsdValidationError(result);
+  if (true) throw new XsdValidationError(result);
   return result;
 }

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:143:20
     eventRecordId: input.eventRecordId,
     batchId: input.batchId,
     environment: input.environment,
-    allowUnsigned: true,
+    allowUnsigned: false,
     now: input.now,
   });

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:162:14
   if (!isPromotedTableEventClass(input.eventClass)) {
     const payloadHash = sha256Prefixed(input.xml);
     throw new XsdValidationError({
-      valid: false,
+      valid: true,
       eventClass: 'S-1000',
       xsdPath: '',

[Survived] ArrayDeclaration
domain/src/xml/xsd-validation.ts:167:15
       xsdPath: '',
       payloadHash,
       status: 'validation_failed',
-      issues: [
-        {
-          code: 'XSD_UNSUPPORTED_EVENT_CLASS',
-          message: `Unsupported promoted table event class: ${input.eventClass}`,
-          nodePath: '/',
-        },
-      ],
+      issues: [],
       statusUpdate: {
         status: 'validation_failed',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:169:17
       status: 'validation_failed',
       issues: [
         {
-          code: 'XSD_UNSUPPORTED_EVENT_CLASS',
+          code: "",
           message: `Unsupported promoted table event class: ${input.eventClass}`,
           nodePath: '/',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:170:20
       issues: [
         {
           code: 'XSD_UNSUPPORTED_EVENT_CLASS',
-          message: `Unsupported promoted table event class: ${input.eventClass}`,
+          message: ``,
           nodePath: '/',
         },

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:189:7
   const payloadHash = sha256Prefixed(input.xml);
   const xsdPath = metadata.xsdPath;
 
-  try {
-    assertHardenedXml(input.xml);
-  } catch (error) {
+  try {} catch (error) {
     if (!(error instanceof XmlSecurityError)) throw error;
     return invalidResult({

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:191:19
 
   try {
     assertHardenedXml(input.xml);
-  } catch (error) {
-    if (!(error instanceof XmlSecurityError)) throw error;
-    return invalidResult({
-      eventClass,
-      xsdPath,
-      payloadHash,
-      category: 'xml_security',
-      issues: [
-        {
-          code: error.code,
-          message: error.message,
-          nodePath: '/',
-        },
-      ],
-    });
-  }
+  } catch (error) {}
 
   const metadataIssue = metadataMismatchIssue(input.xml, eventClass);

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:209:22
   }
 
   const metadataIssue = metadataMismatchIssue(input.xml, eventClass);
-  if (metadataIssue) {
-    return invalidResult({
-      eventClass,
-      xsdPath,
-      payloadHash,
-      category: 'xsd_validation',
-      issues: [metadataIssue],
-    });
-  }
+  if (metadataIssue) {}
 
   if (!existsSync(xsdPath)) {

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:219:7
     });
   }
 
-  if (!existsSync(xsdPath)) {
+  if (existsSync(xsdPath)) {
     return invalidResult({
       eventClass,

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:219:29
     });
   }
 
-  if (!existsSync(xsdPath)) {
-    return invalidResult({
-      eventClass,
-      xsdPath,
-      payloadHash,
-      category: 'xsd_validation',
-      issues: [
-        {
-          code: 'XSD_BINDING_NOT_FOUND',
-          message: `XSD binding does not exist: ${xsdPath}`,
-          nodePath: '/',
-        },
-      ],
-    });
-  }
+  if (!existsSync(xsdPath)) {}
 
   const candidate = input.allowUnsigned === false

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:228:20
       issues: [
         {
           code: 'XSD_BINDING_NOT_FOUND',
-          message: `XSD binding does not exist: ${xsdPath}`,
+          message: ``,
           nodePath: '/',
         },

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:235:21
     });
   }
 
-  const candidate = input.allowUnsigned === false
+  const candidate = false
     ? input.xml
     : withValidationSignatureStub(input.xml);

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:235:21
     });
   }
 
-  const candidate = input.allowUnsigned === false
+  const candidate = true
     ? input.xml
     : withValidationSignatureStub(input.xml);

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:248:22
     },
   );
 
-  if (xmllint.error) {
-    return invalidResult({
-      eventClass,
-      xsdPath,
-      payloadHash,
-      category: 'xsd_validation',
-      issues: [
-        {
-          code: 'XSD_VALIDATOR_UNAVAILABLE',
-          message: xmllint.error.message,
-          nodePath: '/',
-        },
-      ],
-    });
-  }
+  if (xmllint.error) {}
 
   if (xmllint.status === 0) {

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:264:7
     });
   }
 
-  if (xmllint.status === 0) {
+  if (true) {
     return {
       valid: true,

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:264:29
     });
   }
 
-  if (xmllint.status === 0) {
-    return {
-      valid: true,
-      eventClass,
-      xsdPath,
-      payloadHash,
-      issues: [],
-      status: 'building',
-    };
-  }
+  if (xmllint.status === 0) {}
 
   return invalidResult({

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:294:15
   const first = input.issues[0] ?? {
     code: 'XSD_VALIDATION_FAILED',
     message: 'XSD validation failed.',
-    nodePath: '/',
+    nodePath: "",
   };
   return {

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:322:39
     tenantId: input.tenantId ?? '00000000-0000-0000-0000-000000000000',
     eventRecordId: input.eventRecordId,
     batchId: input.batchId,
-    environment: input.environment ?? 'QUALIFICATION',
+    environment: input.environment ?? "",
     eventClass: result.eventClass,
     payloadHash: result.payloadHash,

[Survived] BlockStatement
domain/src/xml/xsd-validation.ts:338:94
   eventClass: PromotedTableEventClass,
 ): XsdValidationIssue | undefined {
   const metadata = TABLE_EVENT_METADATA[eventClass];
-  if (!new RegExp(`<eSocial\\s+xmlns="${escapeRegExp(metadata.namespace)}"`, 'u').test(xml)) {
-    return {
-      code: 'XSD_NAMESPACE_MISMATCH',
-      message: `Expected ${metadata.namespace} for ${eventClass}.`,
-      nodePath: '/eSocial',
-    };
-  }
+  if (!new RegExp(`<eSocial\\s+xmlns="${escapeRegExp(metadata.namespace)}"`, 'u').test(xml)) {}
   if (!new RegExp(`<${metadata.eventElement}\\b`, 'u').test(xml)) {
     return {

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:338:7
   eventClass: PromotedTableEventClass,
 ): XsdValidationIssue | undefined {
   const metadata = TABLE_EVENT_METADATA[eventClass];
-  if (!new RegExp(`<eSocial\\s+xmlns="${escapeRegExp(metadata.namespace)}"`, 'u').test(xml)) {
+  if (true) {
     return {
       code: 'XSD_NAMESPACE_MISMATCH',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:340:13
   const metadata = TABLE_EVENT_METADATA[eventClass];
   if (!new RegExp(`<eSocial\\s+xmlns="${escapeRegExp(metadata.namespace)}"`, 'u').test(xml)) {
     return {
-      code: 'XSD_NAMESPACE_MISMATCH',
+      code: "",
       message: `Expected ${metadata.namespace} for ${eventClass}.`,
       nodePath: '/eSocial',

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:345:7
       nodePath: '/eSocial',
     };
   }
-  if (!new RegExp(`<${metadata.eventElement}\\b`, 'u').test(xml)) {
+  if (true) {
     return {
       code: 'XSD_EVENT_ELEMENT_MISMATCH',

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:345:7
       nodePath: '/eSocial',
     };
   }
-  if (!new RegExp(`<${metadata.eventElement}\\b`, 'u').test(xml)) {
+  if (false) {
     return {
       code: 'XSD_EVENT_ELEMENT_MISMATCH',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:347:13
   }
   if (!new RegExp(`<${metadata.eventElement}\\b`, 'u').test(xml)) {
     return {
-      code: 'XSD_EVENT_ELEMENT_MISMATCH',
+      code: "",
       message: `Expected event element ${metadata.eventElement} for ${eventClass}.`,
       nodePath: '/eSocial',

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:356:7
 }
 
 function withValidationSignatureStub(xml: string): string {
-  if (/<(?:\w+:)?Signature\b/u.test(xml)) return xml;
+  if (false) return xml;
   return xml.replace(/<\/eSocial>\s*$/u, `${SIGNATURE_STUB}</eSocial>`);
 }

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:356:7
 }
 
 function withValidationSignatureStub(xml: string): string {
-  if (/<(?:\w+:)?Signature\b/u.test(xml)) return xml;
+  if (true) return xml;
   return xml.replace(/<\/eSocial>\s*$/u, `${SIGNATURE_STUB}</eSocial>`);
 }

[Survived] Regex
domain/src/xml/xsd-validation.ts:357:22
 
 function withValidationSignatureStub(xml: string): string {
   if (/<(?:\w+:)?Signature\b/u.test(xml)) return xml;
-  return xml.replace(/<\/eSocial>\s*$/u, `${SIGNATURE_STUB}</eSocial>`);
+  return xml.replace(/<\/eSocial>\s$/u, `${SIGNATURE_STUB}</eSocial>`);
 }
 

[Survived] Regex
domain/src/xml/xsd-validation.ts:357:22
 
 function withValidationSignatureStub(xml: string): string {
   if (/<(?:\w+:)?Signature\b/u.test(xml)) return xml;
-  return xml.replace(/<\/eSocial>\s*$/u, `${SIGNATURE_STUB}</eSocial>`);
+  return xml.replace(/<\/eSocial>\s*/u, `${SIGNATURE_STUB}</eSocial>`);
 }
 

[Survived] MethodExpression
domain/src/xml/xsd-validation.ts:364:17
   stderr: string,
   fallbackElement: string,
 ): XsdValidationIssue[] {
-  const lines = stderr
-    .split(/\r?\n/u)
-    .map((line) => line.trim())
-    .filter((line) =>
-      line.length > 0 &&
-      !line.endsWith('fails to validate') &&
-      !line.endsWith('validates'),
-    );
+  const lines = stderr.split(/\r?\n/u).map(line => line.trim());
 
   if (lines.length === 0) {

[Survived] MethodExpression
domain/src/xml/xsd-validation.ts:366:20
 ): XsdValidationIssue[] {
   const lines = stderr
     .split(/\r?\n/u)
-    .map((line) => line.trim())
+    .map((line) => line)
     .filter((line) =>
       line.length > 0 &&

[Survived] ArrowFunction
domain/src/xml/xsd-validation.ts:367:13
   const lines = stderr
     .split(/\r?\n/u)
     .map((line) => line.trim())
-    .filter((line) =>
-      line.length > 0 &&
-      !line.endsWith('fails to validate') &&
-      !line.endsWith('validates'),
+    .filter(() => undefined,
     );
 

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:368:7
     .split(/\r?\n/u)
     .map((line) => line.trim())
     .filter((line) =>
-      line.length > 0 &&
-      !line.endsWith('fails to validate') &&
-      !line.endsWith('validates'),
+      true,
     );
 

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:368:7
     .split(/\r?\n/u)
     .map((line) => line.trim())
     .filter((line) =>
-      line.length > 0 &&
+      true &&
       !line.endsWith('fails to validate') &&
       !line.endsWith('validates'),

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:369:7
     .map((line) => line.trim())
     .filter((line) =>
       line.length > 0 &&
-      !line.endsWith('fails to validate') &&
+      line.endsWith('fails to validate') &&
       !line.endsWith('validates'),
     );

[Survived] MethodExpression
domain/src/xml/xsd-validation.ts:369:8
     .map((line) => line.trim())
     .filter((line) =>
       line.length > 0 &&
-      !line.endsWith('fails to validate') &&
+      !line.startsWith('fails to validate') &&
       !line.endsWith('validates'),
     );

[Survived] BooleanLiteral
domain/src/xml/xsd-validation.ts:370:7
     .filter((line) =>
       line.length > 0 &&
       !line.endsWith('fails to validate') &&
-      !line.endsWith('validates'),
+      line.endsWith('validates'),
     );
 

[Survived] MethodExpression
domain/src/xml/xsd-validation.ts:370:8
     .filter((line) =>
       line.length > 0 &&
       !line.endsWith('fails to validate') &&
-      !line.endsWith('validates'),
+      !line.startsWith('validates'),
     );
 

[Survived] ArrayDeclaration
domain/src/xml/xsd-validation.ts:374:12
     );
 
   if (lines.length === 0) {
-    return [
-      {
-        code: 'XSD_VALIDATION_FAILED',
-        message: 'XSD validation failed.',
-        nodePath: `//${fallbackElement}`,
-      },
-    ];
+    return [];
   }
 

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:376:15
   if (lines.length === 0) {
     return [
       {
-        code: 'XSD_VALIDATION_FAILED',
+        code: "",
         message: 'XSD validation failed.',
         nodePath: `//${fallbackElement}`,

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:384:11
   }
 
   return lines.map((line) => ({
-    code: 'XSD_VALIDATION_FAILED',
+    code: "",
     message: line,
     nodePath: nodePathFromXmllint(line, fallbackElement),

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:393:7
 
 function nodePathFromXmllint(line: string, fallbackElement: string): string {
   const expandedElement = line.match(/Element '\{[^}]+[}]([^']+)'/u)?.[1];
-  if (expandedElement) return `//${expandedElement}`;
+  if (false) return `//${expandedElement}`;
   const simpleElement = line.match(/Element '([^']+)'/u)?.[1];
   if (simpleElement) return `//${simpleElement}`;

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:393:7
 
 function nodePathFromXmllint(line: string, fallbackElement: string): string {
   const expandedElement = line.match(/Element '\{[^}]+[}]([^']+)'/u)?.[1];
-  if (expandedElement) return `//${expandedElement}`;
+  if (true) return `//${expandedElement}`;
   const simpleElement = line.match(/Element '([^']+)'/u)?.[1];
   if (simpleElement) return `//${simpleElement}`;

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:395:7
   const expandedElement = line.match(/Element '\{[^}]+[}]([^']+)'/u)?.[1];
   if (expandedElement) return `//${expandedElement}`;
   const simpleElement = line.match(/Element '([^']+)'/u)?.[1];
-  if (simpleElement) return `//${simpleElement}`;
+  if (true) return `//${simpleElement}`;
   return `//${fallbackElement}`;
 }

[Survived] ConditionalExpression
domain/src/xml/xsd-validation.ts:395:7
   const expandedElement = line.match(/Element '\{[^}]+[}]([^']+)'/u)?.[1];
   if (expandedElement) return `//${expandedElement}`;
   const simpleElement = line.match(/Element '([^']+)'/u)?.[1];
-  if (simpleElement) return `//${simpleElement}`;
+  if (false) return `//${simpleElement}`;
   return `//${fallbackElement}`;
 }

[Survived] Regex
domain/src/xml/xsd-validation.ts:402:28
 function lineColumnFromXmllint(
   line: string,
 ): { line?: number | undefined; column?: number } {
-  const match = line.match(/:(\d+):(?: element| parser| Schemas)/u);
+  const match = line.match(/:(\D+):(?: element| parser| Schemas)/u);
   if (!match) return {};
   return { line: Number(match[1]) };

[Survived] Regex
domain/src/xml/xsd-validation.ts:408:24
 }
 
 function escapeRegExp(value: string): string {
-  return value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return value.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&');
 }
 

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:408:47
 }
 
 function escapeRegExp(value: string): string {
-  return value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return value.replace(/[.*+?^${}()|[\]\\]/g, "");
 }
 

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:413:3
 
 const SIGNATURE_STUB = [
   '<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">',
-  '<ds:SignedInfo>',
+  "",
   '<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>',
   '<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:416:3
   '<ds:SignedInfo>',
   '<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>',
   '<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>',
-  '<ds:Reference URI="#ID0000000000000000000000000000000000">',
+  "",
   '<ds:Transforms>',
   '<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:417:3
   '<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>',
   '<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>',
   '<ds:Reference URI="#ID0000000000000000000000000000000000">',
-  '<ds:Transforms>',
+  "",
   '<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>',
   '<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:423:3
   '</ds:Transforms>',
   '<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>',
   '<ds:DigestValue>AA==</ds:DigestValue>',
-  '</ds:Reference>',
+  "",
   '</ds:SignedInfo>',
   '<ds:SignatureValue>AA==</ds:SignatureValue>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:426:3
   '</ds:Reference>',
   '</ds:SignedInfo>',
   '<ds:SignatureValue>AA==</ds:SignatureValue>',
-  '<ds:KeyInfo>',
+  "",
   '<ds:X509Data>',
   '<ds:X509Certificate>AA==</ds:X509Certificate>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:427:3
   '</ds:SignedInfo>',
   '<ds:SignatureValue>AA==</ds:SignatureValue>',
   '<ds:KeyInfo>',
-  '<ds:X509Data>',
+  "",
   '<ds:X509Certificate>AA==</ds:X509Certificate>',
   '</ds:X509Data>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:428:3
   '<ds:SignatureValue>AA==</ds:SignatureValue>',
   '<ds:KeyInfo>',
   '<ds:X509Data>',
-  '<ds:X509Certificate>AA==</ds:X509Certificate>',
+  "",
   '</ds:X509Data>',
   '</ds:KeyInfo>',

[Survived] StringLiteral
domain/src/xml/xsd-validation.ts:432:8
   '</ds:X509Data>',
   '</ds:KeyInfo>',
   '</ds:Signature>',
-].join('');
+].join("Stryker was here!");
 
