[Survived] ArrayDeclaration
src/builders/s1202/builder.ts:14:25
   dto: S1202RppsRemunerationDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'employerCnpj',
-    'competence',
-    'payrollRunId',
-    'payrollRunStatus',
-  ]);
+  validateRequired(dto, []);
   const workers = requireNonEmptyArray(dto.workers, 'workers');
   return buildPromotedPeriodicXml({

[Survived] StringLiteral
src/builders/s1202/builder.ts:44:21
           worker.establishmentRegistrationNumber,
         ),
         ...optional('ideDmDev', worker.ideDmDev),
-        ...optional('eventId', worker.eventId),
+        ...optional("", worker.eventId),
         rubrics: rubrics.map(mapRubric),
       };

[Survived] ArrayDeclaration
src/builders/s1202/builder.ts:52:28
 }
 
 function mapRubric(rubric: EsocialPeriodicRubricLineDto) {
-  validateRequired(rubric, ['rubricCode', 'amount', 'kind']);
+  validateRequired(rubric, []);
   return {
     code: rubric.rubricCode,

[Survived] StringLiteral
src/builders/s1202/builder.ts:52:53
 }
 
 function mapRubric(rubric: EsocialPeriodicRubricLineDto) {
-  validateRequired(rubric, ['rubricCode', 'amount', 'kind']);
+  validateRequired(rubric, ['rubricCode', 'amount', ""]);
   return {
     code: rubric.rubricCode,

[Survived] StringLiteral
src/builders/s1202/builder.ts:55:17
   validateRequired(rubric, ['rubricCode', 'amount', 'kind']);
   return {
     code: rubric.rubricCode,
-    ...optional('tableCode', rubric.rubricTableId),
+    ...optional("", rubric.rubricTableId),
     amount: rubric.amount,
     ...optional('quantity', rubric.quantity),

[Survived] ConditionalExpression
src/builders/s1202/builder.ts:70:10
   key: Key,
   value: Value | undefined,
 ): Partial<Record<Key, Value>> {
-  return value === undefined ? {} : ({ [key]: value } as Record<Key, Value>);
+  return true ? {} : ({ [key]: value } as Record<Key, Value>);
 }
 

[Survived] EqualityOperator
src/builders/s1202/builder.ts:70:10
   key: Key,
   value: Value | undefined,
 ): Partial<Record<Key, Value>> {
-  return value === undefined ? {} : ({ [key]: value } as Record<Key, Value>);
+  return value !== undefined ? {} : ({ [key]: value } as Record<Key, Value>);
 }
 
