[Survived] StringLiteral
src/builders/s1207/builder.ts:46:21
           benefit.establishmentRegistrationNumber,
         ),
         ...optional('ideDmDev', benefit.ideDmDev),
-        ...optional('eventId', benefit.eventId),
+        ...optional("", benefit.eventId),
         rubrics: rubrics.map(mapRubric),
       };

[Survived] StringLiteral
src/builders/s1207/builder.ts:54:29
 }
 
 function mapRubric(rubric: EsocialPeriodicRubricLineDto) {
-  validateRequired(rubric, ['rubricCode', 'amount', 'kind']);
+  validateRequired(rubric, ["", 'amount', 'kind']);
   return {
     code: rubric.rubricCode,

[Survived] StringLiteral
src/builders/s1207/builder.ts:59:17
     code: rubric.rubricCode,
     ...optional('tableCode', rubric.rubricTableId),
     amount: rubric.amount,
-    ...optional('quantity', rubric.quantity),
+    ...optional("", rubric.quantity),
     kind: rubric.kind,
   };

[Survived] ConditionalExpression
src/builders/s1207/builder.ts:72:10
   key: Key,
   value: Value | undefined,
 ): Partial<Record<Key, Value>> {
-  return value === undefined ? {} : ({ [key]: value } as Record<Key, Value>);
+  return false ? {} : ({ [key]: value } as Record<Key, Value>);
 }
 
