[Survived] ArrayDeclaration
src/builders/s1210/builder.ts:18:25
   dto: S1210PaymentDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'employerCnpj',
-    'competence',
-    'paymentBatchId',
-    'paymentBatchStatus',
-    'confirmedTotal',
-  ]);
+  validateRequired(dto, []);
   const payments = requireNonEmptyArray(dto.payments, 'payments');
   payments.forEach((payment, index) => {

[Survived] StringLiteral
src/builders/s1210/builder.ts:24:5
     'employerCnpj',
     'competence',
     'paymentBatchId',
-    'paymentBatchStatus',
+    "",
     'confirmedTotal',
   ]);

[Survived] StringLiteral
src/builders/s1210/builder.ts:25:5
     'competence',
     'paymentBatchId',
     'paymentBatchStatus',
-    'confirmedTotal',
+    "",
   ]);
   const payments = requireNonEmptyArray(dto.payments, 'payments');

[Survived] BlockStatement
src/builders/s1210/builder.ts:28:40
     'confirmedTotal',
   ]);
   const payments = requireNonEmptyArray(dto.payments, 'payments');
-  payments.forEach((payment, index) => {
-    if (!nonEmptyString(payment.receiptReference)) {
-      throw new MissingReceiptReference(`payments[${index}].receiptReference`);
-    }
-  });
+  payments.forEach((payment, index) => {});
   return buildPromotedPeriodicXml({
     eventClass: 'S-1210',

[Survived] ConditionalExpression
src/builders/s1210/builder.ts:29:9
   ]);
   const payments = requireNonEmptyArray(dto.payments, 'payments');
   payments.forEach((payment, index) => {
-    if (!nonEmptyString(payment.receiptReference)) {
+    if (true) {
       throw new MissingReceiptReference(`payments[${index}].receiptReference`);
     }

[Survived] BlockStatement
src/builders/s1210/builder.ts:29:52
   ]);
   const payments = requireNonEmptyArray(dto.payments, 'payments');
   payments.forEach((payment, index) => {
-    if (!nonEmptyString(payment.receiptReference)) {
-      throw new MissingReceiptReference(`payments[${index}].receiptReference`);
-    }
+    if (!nonEmptyString(payment.receiptReference)) {}
   });
   return buildPromotedPeriodicXml({

[Survived] StringLiteral
src/builders/s1210/builder.ts:30:41
   const payments = requireNonEmptyArray(dto.payments, 'payments');
   payments.forEach((payment, index) => {
     if (!nonEmptyString(payment.receiptReference)) {
-      throw new MissingReceiptReference(`payments[${index}].receiptReference`);
+      throw new MissingReceiptReference(``);
     }
   });

[Survived] LogicalOperator
src/builders/s1210/builder.ts:42:33
     environment: environmentCode(ctx),
     paymentBatchId: dto.paymentBatchId,
     paymentBatchStatus: dto.paymentBatchStatus,
-    ...optional('payrollRunId', dto.payrollRunId ?? undefined),
+    ...optional('payrollRunId', dto.payrollRunId && undefined),
     confirmedTotal: dto.confirmedTotal,
     payments: payments.map((payment) => ({

[Survived] LogicalOperator
src/builders/s1210/builder.ts:49:35
       cpf: payment.cpf,
       amount: payment.amount,
       paymentDate: payment.paymentDate,
-      ...optional('payrollRunId', payment.payrollRunId ?? undefined),
+      ...optional('payrollRunId', payment.payrollRunId && undefined),
       ...optional('ideDmDev', payment.ideDmDev),
       ...optional('eventId', payment.eventId),

[Survived] StringLiteral
src/builders/s1210/builder.ts:49:19
       cpf: payment.cpf,
       amount: payment.amount,
       paymentDate: payment.paymentDate,
-      ...optional('payrollRunId', payment.payrollRunId ?? undefined),
+      ...optional("", payment.payrollRunId ?? undefined),
       ...optional('ideDmDev', payment.ideDmDev),
       ...optional('eventId', payment.eventId),

[Survived] StringLiteral
src/builders/s1210/builder.ts:50:19
       amount: payment.amount,
       paymentDate: payment.paymentDate,
       ...optional('payrollRunId', payment.payrollRunId ?? undefined),
-      ...optional('ideDmDev', payment.ideDmDev),
+      ...optional("", payment.ideDmDev),
       ...optional('eventId', payment.eventId),
     })),

[Survived] StringLiteral
src/builders/s1210/builder.ts:51:19
       paymentDate: payment.paymentDate,
       ...optional('payrollRunId', payment.payrollRunId ?? undefined),
       ...optional('ideDmDev', payment.ideDmDev),
-      ...optional('eventId', payment.eventId),
+      ...optional("", payment.eventId),
     })),
   });
