[Survived] ArrayDeclaration
src/builders/s1298/builder.ts:11:25
   dto: S1298ReopeningDto,
   ctx: BuilderContext = {},
 ): BuiltXml {
-  validateRequired(dto, [
-    'tenantId',
-    'sourceEventId',
-    'employerCnpj',
-    'competence',
-    'acceptedClosureReceipt',
-    'acceptedClosureAt',
-  ]);
+  validateRequired(dto, []);
   return buildPromotedPeriodicXml({
     eventClass: 'S-1298',

[Survived] StringLiteral
src/builders/s1298/builder.ts:23:17
     eventClass: 'S-1298',
     tenantId: dto.tenantId,
     sourceEventId: dto.sourceEventId,
-    ...optional('sourceEntityId', dto.sourceEntityId),
+    ...optional("", dto.sourceEntityId),
     competence: dto.competence,
     employerRegistrationNumber: dto.employerCnpj,
