[Survived] ArrayDeclaration
domain/src/builders/table-adapter.ts:17:15
   return {
     xml: built.xml,
     metadata: metadataFromTableEvent(built),
-    eventIds: [built.eventId],
+    eventIds: [],
     xmlSha256: built.xmlSha256,
   };
