[Survived] MethodExpression
xml/builders/tables/index.ts:279:18
   tenantId: string,
   sourceEntityId: string,
 ): string {
-  const digits = sha256(`${eventClass}:${tenantId}:${sourceEntityId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
-    .slice(0, 34);
+  const digits = sha256(`${eventClass}:${tenantId}:${sourceEntityId}`).replace(/[a-f]/g, char => String(char.charCodeAt(0) - 97));
   return `ID${digits}`;
 }

[Survived] StringLiteral
xml/builders/tables/index.ts:279:25
   tenantId: string,
   sourceEntityId: string,
 ): string {
-  const digits = sha256(`${eventClass}:${tenantId}:${sourceEntityId}`)
+  const digits = sha256(``)
     .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
     .slice(0, 34);

[Survived] ArithmeticOperator
xml/builders/tables/index.ts:280:41
   sourceEntityId: string,
 ): string {
   const digits = sha256(`${eventClass}:${tenantId}:${sourceEntityId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
+    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) + 97))
     .slice(0, 34);
   return `ID${digits}`;

[Survived] Regex
xml/builders/tables/index.ts:280:14
   sourceEntityId: string,
 ): string {
   const digits = sha256(`${eventClass}:${tenantId}:${sourceEntityId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
+    .replace(/[^a-f]/g, (char) => String(char.charCodeAt(0) - 97))
     .slice(0, 34);
   return `ID${digits}`;

[Survived] MethodExpression
xml/builders/tables/index.ts:330:16
       'establishment.registrationNumber',
     ),
   );
-  const cnae = onlyDigits(establishment.cnaePreponderante ?? '8411600').slice(
-    0,
-    7,
-  );
+  const cnae = onlyDigits(establishment.cnaePreponderante ?? '8411600');
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">

[Survived] ConditionalExpression
xml/builders/tables/index.ts:342:33
     <infoEstab>
       <inclusao>
         <ideEstab><tpInsc>1</tpInsc><nrInsc>${estab}</nrInsc><iniValid>${input.competence}</iniValid></ideEstab>
-        <dadosEstab><cnaePrep>${cnae || '8411600'}</cnaePrep></dadosEstab>
+        <dadosEstab><cnaePrep>${false}</cnaePrep></dadosEstab>
       </inclusao>
     </infoEstab>

[Survived] ConditionalExpression
xml/builders/tables/index.ts:342:33
     <infoEstab>
       <inclusao>
         <ideEstab><tpInsc>1</tpInsc><nrInsc>${estab}</nrInsc><iniValid>${input.competence}</iniValid></ideEstab>
-        <dadosEstab><cnaePrep>${cnae || '8411600'}</cnaePrep></dadosEstab>
+        <dadosEstab><cnaePrep>${true}</cnaePrep></dadosEstab>
       </inclusao>
     </infoEstab>

[Survived] MethodExpression
xml/builders/tables/index.ts:361:23
     ),
   );
   const code = xmlEscape(requireString(rubric.code, 'rubric.code'));
-  const description = xmlEscape(
-    requireString(rubric.description, 'rubric.description'),
-  ).slice(0, 100);
+  const description = xmlEscape(requireString(rubric.description, 'rubric.description'));
   const natureCode = xmlEscape(rubric.natureCode ?? '1000');
   const incidence = rubric.incidences ?? {};

[Survived] StringLiteral
xml/builders/tables/index.ts:362:39
   );
   const code = xmlEscape(requireString(rubric.code, 'rubric.code'));
   const description = xmlEscape(
-    requireString(rubric.description, 'rubric.description'),
+    requireString(rubric.description, ""),
   ).slice(0, 100);
   const natureCode = xmlEscape(rubric.natureCode ?? '1000');

[Survived] StringLiteral
xml/builders/tables/index.ts:370:32
     incidence.codIncPisPasep,
     rubric.type,
   );
-  const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
-<eSocial xmlns="${metadata.namespace}">
-  <evtTabRubrica Id="${eventId}">
-    ${ideEvento(input)}
-    ${ideEmpregador(employer)}
-    <infoRubrica>
-      <inclusao>
-        <ideRubrica><codRubr>${code}</codRubr><ideTabRubr>${xmlEscape(rubric.tableId ?? 'SGP')}</ideTabRubr><iniValid>${input.competence}</iniValid></ideRubrica>
-        <dadosRubrica>
-          <dscRubr>${description}</dscRubr>
-          <natRubr>${natureCode}</natRubr>
-          <tpRubr>${rubricType(rubric.type)}</tpRubr>
-          <codIncCP>${xmlEscape(incidence.codIncCP ?? '00')}</codIncCP>
-          <codIncIRRF>${xmlEscape(incidence.codIncIRRF ?? '9')}</codIncIRRF>
-          <codIncFGTS>${xmlEscape(incidence.codIncFGTS ?? '00')}</codIncFGTS>
-          <codIncCPRP>${xmlEscape(incidence.codIncCPRP ?? '00')}</codIncCPRP>
-          <codIncPisPasep>${codIncPisPasep}</codIncPisPasep>
-          <tetoRemun>${xmlEscape(rubric.remunerationCeiling ?? 'N')}</tetoRemun>
-        </dadosRubrica>
-      </inclusao>
-    </infoRubrica>
-  </evtTabRubrica>
-</eSocial>`);
+  const xml = withFinalNewline(``);
   return builtEvent(input, 'rubric', eventId, xml, metadata);
 }

[Survived] StringLiteral
xml/builders/tables/index.ts:382:55
           <dscRubr>${description}</dscRubr>
           <natRubr>${natureCode}</natRubr>
           <tpRubr>${rubricType(rubric.type)}</tpRubr>
-          <codIncCP>${xmlEscape(incidence.codIncCP ?? '00')}</codIncCP>
+          <codIncCP>${xmlEscape(incidence.codIncCP ?? "")}</codIncCP>
           <codIncIRRF>${xmlEscape(incidence.codIncIRRF ?? '9')}</codIncIRRF>
           <codIncFGTS>${xmlEscape(incidence.codIncFGTS ?? '00')}</codIncFGTS>

[Survived] StringLiteral
xml/builders/tables/index.ts:384:59
           <tpRubr>${rubricType(rubric.type)}</tpRubr>
           <codIncCP>${xmlEscape(incidence.codIncCP ?? '00')}</codIncCP>
           <codIncIRRF>${xmlEscape(incidence.codIncIRRF ?? '9')}</codIncIRRF>
-          <codIncFGTS>${xmlEscape(incidence.codIncFGTS ?? '00')}</codIncFGTS>
+          <codIncFGTS>${xmlEscape(incidence.codIncFGTS ?? "")}</codIncFGTS>
           <codIncCPRP>${xmlEscape(incidence.codIncCPRP ?? '00')}</codIncCPRP>
           <codIncPisPasep>${codIncPisPasep}</codIncPisPasep>

[Survived] StringLiteral
xml/builders/tables/index.ts:403:7
   const employer = employerRegistration(
     requireString(
       taxLotation.employerRegistrationNumber,
-      'taxLotation.employerRegistrationNumber',
+      "",
     ),
   );

[Survived] MethodExpression
xml/builders/tables/index.ts:406:16
       'taxLotation.employerRegistrationNumber',
     ),
   );
-  const code = xmlEscape(requireString(taxLotation.code, 'taxLotation.code')).slice(
-    0,
-    30,
-  );
+  const code = xmlEscape(requireString(taxLotation.code, 'taxLotation.code'));
   const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0').slice(0, 3);
   const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000')

[Survived] StringLiteral
xml/builders/tables/index.ts:406:58
       'taxLotation.employerRegistrationNumber',
     ),
   );
-  const code = xmlEscape(requireString(taxLotation.code, 'taxLotation.code')).slice(
+  const code = xmlEscape(requireString(taxLotation.code, "")).slice(
     0,
     30,

[Survived] MethodExpression
xml/builders/tables/index.ts:410:16
     0,
     30,
   );
-  const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0').slice(0, 3);
+  const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0');
   const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000')
     .padStart(4, '0')

[Survived] StringLiteral
xml/builders/tables/index.ts:410:41
     0,
     30,
   );
-  const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0').slice(0, 3);
+  const fpas = (taxLotation.fpasCode ?? "").padStart(3, '0').slice(0, 3);
   const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000')
     .padStart(4, '0')

[Survived] MethodExpression
xml/builders/tables/index.ts:411:26
     30,
   );
   const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0').slice(0, 3);
-  const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000')
-    .padStart(4, '0')
-    .slice(0, 4);
+  const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000').padStart(4, '0');
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">

[Survived] StringLiteral
xml/builders/tables/index.ts:411:57
     30,
   );
   const fpas = (taxLotation.fpasCode ?? '582').padStart(3, '0').slice(0, 3);
-  const thirdPartyCode = (taxLotation.thirdPartyCode ?? '0000')
+  const thirdPartyCode = (taxLotation.thirdPartyCode ?? "")
     .padStart(4, '0')
     .slice(0, 4);

[Survived] StringLiteral
xml/builders/tables/index.ts:434:58
 }
 
 function buildS1050(input: S1050TableDto): BuiltTableXmlEvent {
-  const workSchedule = requireObject(input.workSchedule, 'workSchedule');
+  const workSchedule = requireObject(input.workSchedule, "");
   const metadata = TABLE_EVENT_METADATA['S-1050'];
   const eventId = resolveEventId(input);

[Survived] StringLiteral
xml/builders/tables/index.ts:440:7
   const employer = employerRegistration(
     requireString(
       workSchedule.employerRegistrationNumber,
-      'workSchedule.employerRegistrationNumber',
+      "",
     ),
   );

[Survived] StringLiteral
xml/builders/tables/index.ts:444:38
     ),
   );
   const code = xmlEscape(
-    requireString(workSchedule.code, 'workSchedule.code'),
+    requireString(workSchedule.code, ""),
   );
   const description = xmlEscape(

[Survived] MethodExpression
xml/builders/tables/index.ts:446:23
   const code = xmlEscape(
     requireString(workSchedule.code, 'workSchedule.code'),
   );
-  const description = xmlEscape(
-    requireString(workSchedule.description, 'workSchedule.description'),
-  ).slice(0, 100);
+  const description = xmlEscape(requireString(workSchedule.description, 'workSchedule.description'));
   const duration = workDuration(workSchedule.dailyHours);
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] StringLiteral
xml/builders/tables/index.ts:447:45
     requireString(workSchedule.code, 'workSchedule.code'),
   );
   const description = xmlEscape(
-    requireString(workSchedule.description, 'workSchedule.description'),
+    requireString(workSchedule.description, ""),
   ).slice(0, 100);
   const duration = workDuration(workSchedule.dailyHours);

[Survived] StringLiteral
xml/builders/tables/index.ts:477:42
     ),
   );
   const processNumber = normalizedProcessNumber(
-    requireString(process.processNumber, 'process.processNumber'),
+    requireString(process.processNumber, ""),
   );
   const subject = xmlEscape(requireString(process.subject, 'process.subject')).slice(

[Survived] MethodExpression
xml/builders/tables/index.ts:479:19
   const processNumber = normalizedProcessNumber(
     requireString(process.processNumber, 'process.processNumber'),
   );
-  const subject = xmlEscape(requireString(process.subject, 'process.subject')).slice(
-    0,
-    255,
-  );
+  const subject = xmlEscape(requireString(process.subject, 'process.subject'));
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
 <eSocial xmlns="${metadata.namespace}">

[Survived] StringLiteral
xml/builders/tables/index.ts:490:65
     ${ideEmpregador(employer)}
     <infoProcesso>
       <inclusao>
-        <ideProcesso><tpProc>${xmlEscape(process.processType ?? '1')}</tpProc><nrProc>${processNumber}</nrProc><iniValid>${input.competence}</iniValid></ideProcesso>
+        <ideProcesso><tpProc>${xmlEscape(process.processType ?? "")}</tpProc><nrProc>${processNumber}</nrProc><iniValid>${input.competence}</iniValid></ideProcesso>
         <dadosProc><indMatProc>${xmlEscape(process.matterIndicator ?? '1')}</indMatProc><observacao>${subject}</observacao></dadosProc>
       </inclusao>

[Survived] BooleanLiteral
xml/builders/tables/index.ts:525:7
 }
 
 function assertBaseDto(input: TableEventDto): void {
-  if (!isPromotedTableEventClass(input.eventClass)) {
+  if (isPromotedTableEventClass(input.eventClass)) {
     throw new TableBuilderValidationError(
       `Unsupported table eventClass: ${String(input.eventClass)}`,

[Survived] BlockStatement
xml/builders/tables/index.ts:525:53
 }
 
 function assertBaseDto(input: TableEventDto): void {
-  if (!isPromotedTableEventClass(input.eventClass)) {
-    throw new TableBuilderValidationError(
-      `Unsupported table eventClass: ${String(input.eventClass)}`,
-    );
-  }
+  if (!isPromotedTableEventClass(input.eventClass)) {}
   requireString(input.tenantId, 'tenantId');
   requireString(input.sourceEntityId, 'sourceEntityId');

[Survived] BlockStatement
xml/builders/tables/index.ts:533:48
   requireString(input.tenantId, 'tenantId');
   requireString(input.sourceEntityId, 'sourceEntityId');
   requireString(input.competence, 'competence');
-  if (!/^\d{4}-\d{2}$/.test(input.competence)) {
-    throw new TableBuilderValidationError(
-      'Table builder DTO field competence must be YYYY-MM.',
-    );
-  }
+  if (!/^\d{4}-\d{2}$/.test(input.competence)) {}
   if (input.operation && input.operation !== 'inclusao') {
     throw new TableBuilderValidationError(

[Survived] BooleanLiteral
xml/builders/tables/index.ts:533:7
   requireString(input.tenantId, 'tenantId');
   requireString(input.sourceEntityId, 'sourceEntityId');
   requireString(input.competence, 'competence');
-  if (!/^\d{4}-\d{2}$/.test(input.competence)) {
+  if (/^\d{4}-\d{2}$/.test(input.competence)) {
     throw new TableBuilderValidationError(
       'Table builder DTO field competence must be YYYY-MM.',

[Survived] StringLiteral
xml/builders/tables/index.ts:535:7
   requireString(input.competence, 'competence');
   if (!/^\d{4}-\d{2}$/.test(input.competence)) {
     throw new TableBuilderValidationError(
-      'Table builder DTO field competence must be YYYY-MM.',
+      "",
     );
   }

[Survived] LogicalOperator
xml/builders/tables/index.ts:538:7
       'Table builder DTO field competence must be YYYY-MM.',
     );
   }
-  if (input.operation && input.operation !== 'inclusao') {
+  if (input.operation || input.operation !== 'inclusao') {
     throw new TableBuilderValidationError(
       `Unsupported table operation: ${input.operation}`,

[Survived] EqualityOperator
xml/builders/tables/index.ts:538:26
       'Table builder DTO field competence must be YYYY-MM.',
     );
   }
-  if (input.operation && input.operation !== 'inclusao') {
+  if (input.operation && input.operation === 'inclusao') {
     throw new TableBuilderValidationError(
       `Unsupported table operation: ${input.operation}`,

[Survived] BlockStatement
xml/builders/tables/index.ts:543:63
       `Unsupported table operation: ${input.operation}`,
     );
   }
-  if (input.environment && !/^[12]$/.test(input.environment)) {
-    throw new TableBuilderValidationError(
-      `Unsupported eSocial environment: ${input.environment}`,
-    );
-  }
+  if (input.environment && !/^[12]$/.test(input.environment)) {}
   if (input.eventId && !/^ID\d{34}$/.test(input.eventId)) {
     throw new TableBuilderValidationError(

[Survived] ConditionalExpression
xml/builders/tables/index.ts:543:7
       `Unsupported table operation: ${input.operation}`,
     );
   }
-  if (input.environment && !/^[12]$/.test(input.environment)) {
+  if (false) {
     throw new TableBuilderValidationError(
       `Unsupported eSocial environment: ${input.environment}`,

[Survived] BooleanLiteral
xml/builders/tables/index.ts:548:24
       `Unsupported eSocial environment: ${input.environment}`,
     );
   }
-  if (input.eventId && !/^ID\d{34}$/.test(input.eventId)) {
+  if (input.eventId && /^ID\d{34}$/.test(input.eventId)) {
     throw new TableBuilderValidationError(
       'Table builder DTO field eventId must match ID plus 34 digits.',

[Survived] ConditionalExpression
xml/builders/tables/index.ts:548:7
       `Unsupported eSocial environment: ${input.environment}`,
     );
   }
-  if (input.eventId && !/^ID\d{34}$/.test(input.eventId)) {
+  if (false) {
     throw new TableBuilderValidationError(
       'Table builder DTO field eventId must match ID plus 34 digits.',

[Survived] StringLiteral
xml/builders/tables/index.ts:550:7
   }
   if (input.eventId && !/^ID\d{34}$/.test(input.eventId)) {
     throw new TableBuilderValidationError(
-      'Table builder DTO field eventId must match ID plus 34 digits.',
+      "",
     );
   }

[Survived] StringLiteral
xml/builders/tables/index.ts:567:10
 }
 
 function ideEmpregador(cnpjRoot: string): string {
-  return `<ideEmpregador><tpInsc>1</tpInsc><nrInsc>${cnpjRoot}</nrInsc></ideEmpregador>`;
+  return ``;
 }
 

[Survived] ConditionalExpression
xml/builders/tables/index.ts:572:11
 
 function employerRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(
+  return (true ? digits.slice(0, 8) : '12345678').padStart(
     8,
     '0',

[Survived] MethodExpression
xml/builders/tables/index.ts:572:32
 
 function employerRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(
+  return (digits.length >= 8 ? digits : '12345678').padStart(
     8,
     '0',

[Survived] MethodExpression
xml/builders/tables/index.ts:581:27
 function fullRegistration(value: string): string {
   const digits = onlyDigits(value);
   return (
-    digits.length >= 14 ? digits.slice(0, 14) : '12345678000199'
+    digits.length >= 14 ? digits : '12345678000199'
   ).padStart(14, '0');
 }

[Survived] ConditionalExpression
xml/builders/tables/index.ts:581:5
 function fullRegistration(value: string): string {
   const digits = onlyDigits(value);
   return (
-    digits.length >= 14 ? digits.slice(0, 14) : '12345678000199'
+    false ? digits.slice(0, 14) : '12345678000199'
   ).padStart(14, '0');
 }

[Survived] Regex
xml/builders/tables/index.ts:586:32
 }
 
 function onlyDigits(value: string | number | boolean): string {
-  return String(value).replace(/\D/g, '');
+  return String(value).replace(/\d/g, '');
 }
 

[Survived] StringLiteral
xml/builders/tables/index.ts:586:39
 }
 
 function onlyDigits(value: string | number | boolean): string {
-  return String(value).replace(/\D/g, '');
+  return String(value).replace(/\D/g, "Stryker was here!");
 }
 

[Survived] StringLiteral
xml/builders/tables/index.ts:591:20
 
 function xmlEscape(value: string): string {
   return value
-    .replace(/&/g, '&amp;')
+    .replace(/&/g, "")
     .replace(/</g, '&lt;')
     .replace(/>/g, '&gt;')

[Survived] StringLiteral
xml/builders/tables/index.ts:594:20
     .replace(/&/g, '&amp;')
     .replace(/</g, '&lt;')
     .replace(/>/g, '&gt;')
-    .replace(/"/g, '&quot;')
+    .replace(/"/g, "")
     .replace(/'/g, '&apos;');
 }

[Survived] ConditionalExpression
xml/builders/tables/index.ts:602:5
   value: S1010TableDto['rubric']['type'],
 ): '1' | '2' | '3' | '4' {
   switch (value) {
-    case 'earning':
-      return '1';
+    case 'earning':
     case 'deduction':
       return '2';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:604:5
   switch (value) {
     case 'earning':
       return '1';
-    case 'deduction':
-      return '2';
+    case 'deduction':
     case 'informational':
       return '3';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:606:5
       return '1';
     case 'deduction':
       return '2';
-    case 'informational':
-      return '3';
+    case 'informational':
     case 'informational-deduction':
       return '4';

[Survived] LogicalOperator
xml/builders/tables/index.ts:618:5
   rubricKind: S1010TableDto['rubric']['type'],
 ): string {
   const value =
-    typeof raw === 'string' ||
-    typeof raw === 'number' ||
-    typeof raw === 'boolean'
+    (typeof raw === 'string' || typeof raw === 'number') && typeof raw === 'boolean'
       ? String(raw).trim()
       : '';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:618:5
   rubricKind: S1010TableDto['rubric']['type'],
 ): string {
   const value =
-    typeof raw === 'string' ||
-    typeof raw === 'number' ||
-    typeof raw === 'boolean'
+    true
       ? String(raw).trim()
       : '';

[Survived] EqualityOperator
xml/builders/tables/index.ts:619:5
 ): string {
   const value =
     typeof raw === 'string' ||
-    typeof raw === 'number' ||
+    typeof raw !== 'number' ||
     typeof raw === 'boolean'
       ? String(raw).trim()

[Survived] ConditionalExpression
xml/builders/tables/index.ts:619:5
 ): string {
   const value =
     typeof raw === 'string' ||
-    typeof raw === 'number' ||
+    false ||
     typeof raw === 'boolean'
       ? String(raw).trim()

[Survived] ConditionalExpression
xml/builders/tables/index.ts:620:5
   const value =
     typeof raw === 'string' ||
     typeof raw === 'number' ||
-    typeof raw === 'boolean'
+    false
       ? String(raw).trim()
       : '';

[Survived] EqualityOperator
xml/builders/tables/index.ts:620:5
   const value =
     typeof raw === 'string' ||
     typeof raw === 'number' ||
-    typeof raw === 'boolean'
+    typeof raw !== 'boolean'
       ? String(raw).trim()
       : '';

[Survived] MethodExpression
xml/builders/tables/index.ts:621:9
     typeof raw === 'string' ||
     typeof raw === 'number' ||
     typeof raw === 'boolean'
-      ? String(raw).trim()
+      ? String(raw)
       : '';
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';

[Survived] StringLiteral
xml/builders/tables/index.ts:622:9
     typeof raw === 'number' ||
     typeof raw === 'boolean'
       ? String(raw).trim()
-      : '';
+      : "Stryker was here!";
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
   if (/^(12|13)$/i.test(value)) return value;

[Survived] ConditionalExpression
xml/builders/tables/index.ts:623:7
     typeof raw === 'boolean'
       ? String(raw).trim()
       : '';
-  if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
+  if (true) return '00';
   if (/^(12|13)$/i.test(value)) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:623:7
     typeof raw === 'boolean'
       ? String(raw).trim()
       : '';
-  if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
+  if (false) return '00';
   if (/^(12|13)$/i.test(value)) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:624:7
       ? String(raw).trim()
       : '';
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
-  if (/^(12|13)$/i.test(value)) return value;
+  if (false) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
   return rubricKind === 'earning' || rubricKind === 'informational'

[Survived] ConditionalExpression
xml/builders/tables/index.ts:624:7
       ? String(raw).trim()
       : '';
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
-  if (/^(12|13)$/i.test(value)) return value;
+  if (true) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
   return rubricKind === 'earning' || rubricKind === 'informational'

[Survived] ConditionalExpression
xml/builders/tables/index.ts:625:7
       : '';
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
   if (/^(12|13)$/i.test(value)) return value;
-  if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
+  if (false) return '11';
   return rubricKind === 'earning' || rubricKind === 'informational'
     ? '11'

[Survived] ConditionalExpression
xml/builders/tables/index.ts:625:7
       : '';
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
   if (/^(12|13)$/i.test(value)) return value;
-  if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
+  if (true) return '11';
   return rubricKind === 'earning' || rubricKind === 'informational'
     ? '11'

[Survived] ConditionalExpression
xml/builders/tables/index.ts:626:10
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
   if (/^(12|13)$/i.test(value)) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
-  return rubricKind === 'earning' || rubricKind === 'informational'
+  return false
     ? '11'
     : '00';

[Survived] ConditionalExpression
xml/builders/tables/index.ts:626:10
   if (/^(00|0|false|none|nao|nao_base)$/i.test(value)) return '00';
   if (/^(12|13)$/i.test(value)) return value;
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
-  return rubricKind === 'earning' || rubricKind === 'informational'
+  return false || rubricKind === 'informational'
     ? '11'
     : '00';

[Survived] StringLiteral
xml/builders/tables/index.ts:628:7
   if (/^(11|true|1|base|monthly|mensal)$/i.test(value)) return '11';
   return rubricKind === 'earning' || rubricKind === 'informational'
     ? '11'
-    : '00';
+    : "";
 }
 

[Survived] ConditionalExpression
xml/builders/tables/index.ts:633:7
 
 function workDuration(value: string | number): string {
   const hours = Number(value);
-  if (!Number.isFinite(hours) || hours < 0) {
+  if (false) {
     throw new TableBuilderValidationError(
       'Table builder DTO field workSchedule.dailyHours must be a positive number.',

[Survived] ConditionalExpression
xml/builders/tables/index.ts:633:7
 
 function workDuration(value: string | number): string {
   const hours = Number(value);
-  if (!Number.isFinite(hours) || hours < 0) {
+  if (true) {
     throw new TableBuilderValidationError(
       'Table builder DTO field workSchedule.dailyHours must be a positive number.',

[Survived] StringLiteral
xml/builders/tables/index.ts:635:7
   const hours = Number(value);
   if (!Number.isFinite(hours) || hours < 0) {
     throw new TableBuilderValidationError(
-      'Table builder DTO field workSchedule.dailyHours must be a positive number.',
+      "",
     );
   }

[Survived] ArithmeticOperator
xml/builders/tables/index.ts:639:31
     );
   }
   const wholeHours = Math.trunc(hours);
-  const minutes = Math.trunc((hours - wholeHours) * 60);
+  const minutes = Math.trunc((hours + wholeHours) * 60);
   return `PT${wholeHours}H${minutes}M`;
 }

[Survived] ArithmeticOperator
xml/builders/tables/index.ts:639:30
     );
   }
   const wholeHours = Math.trunc(hours);
-  const minutes = Math.trunc((hours - wholeHours) * 60);
+  const minutes = Math.trunc((hours - wholeHours) / 60);
   return `PT${wholeHours}H${minutes}M`;
 }

[Survived] EqualityOperator
xml/builders/tables/index.ts:645:10
 
 function normalizedProcessNumber(value: string): string {
   const digits = value.replace(/\D/g, '');
-  return digits.length >= 17 ? digits.slice(0, 17) : '12345678901234567';
+  return digits.length > 17 ? digits.slice(0, 17) : '12345678901234567';
 }
 

[Survived] EqualityOperator
xml/builders/tables/index.ts:645:10
 
 function normalizedProcessNumber(value: string): string {
   const digits = value.replace(/\D/g, '');
-  return digits.length >= 17 ? digits.slice(0, 17) : '12345678901234567';
+  return digits.length < 17 ? digits.slice(0, 17) : '12345678901234567';
 }
 

[Survived] EqualityOperator
xml/builders/tables/index.ts:649:36
 }
 
 function requireString(value: unknown, path: string): string {
-  if (typeof value === 'string' && value.trim() !== '') return value;
+  if (typeof value === 'string' && value.trim() === '') return value;
   throw new TableBuilderValidationError(
     `Table builder DTO missing required field: ${path}`,

[Survived] MethodExpression
xml/builders/tables/index.ts:649:36
 }
 
 function requireString(value: unknown, path: string): string {
-  if (typeof value === 'string' && value.trim() !== '') return value;
+  if (typeof value === 'string' && value !== '') return value;
   throw new TableBuilderValidationError(
     `Table builder DTO missing required field: ${path}`,

[Survived] EqualityOperator
xml/builders/tables/index.ts:656:16
 }
 
 function requireObject<T extends object>(value: T | undefined, path: string): T {
-  if (value && typeof value === 'object') return value;
+  if (value && typeof value !== 'object') return value;
   throw new TableBuilderValidationError(
     `Table builder DTO missing required field: ${path}`,

[Survived] ConditionalExpression
xml/builders/tables/index.ts:656:16
 }
 
 function requireObject<T extends object>(value: T | undefined, path: string): T {
-  if (value && typeof value === 'object') return value;
+  if (value && true) return value;
   throw new TableBuilderValidationError(
     `Table builder DTO missing required field: ${path}`,

[Survived] StringLiteral
xml/builders/tables/index.ts:667:10
 }
 
 function withFinalNewline(xml: string): string {
-  return `${xml}\n`;
+  return ``;
 }
 
