[Survived] StringLiteral
xml/builders/periodic/index.ts:219:33
 
 const XSD_ROOT = 'packages/domain/src/xml/xsd/bundle';
 const DEFAULT_ENVIRONMENT: EsocialEnvironment = '2';
-const DEFAULT_PROCESS_EMITTER = '1';
+const DEFAULT_PROCESS_EMITTER = "";
 const DEFAULT_PROCESS_VERSION = 'SGP-0.0.1';
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:220:33
 const XSD_ROOT = 'packages/domain/src/xml/xsd/bundle';
 const DEFAULT_ENVIRONMENT: EsocialEnvironment = '2';
 const DEFAULT_PROCESS_EMITTER = '1';
-const DEFAULT_PROCESS_VERSION = 'SGP-0.0.1';
+const DEFAULT_PROCESS_VERSION = "";
 
 export const PERIODIC_EVENT_METADATA: Readonly<

[Survived] ArrayDeclaration
xml/builders/periodic/index.ts:320:14
     case 'S-1298':
       return [buildS1298(input)];
     case 'S-1299':
-      return [buildS1299(input)];
+      return [];
     default:
       return assertNever(input);

[Survived] MethodExpression
xml/builders/periodic/index.ts:338:18
   tenantId: string,
   sourceId: string,
 ): string {
-  const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
-    .slice(0, 34);
+  const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`).replace(/[a-f]/g, char => String(char.charCodeAt(0) - 97));
   return `ID${digits}`;
 }

[Survived] StringLiteral
xml/builders/periodic/index.ts:338:25
   tenantId: string,
   sourceId: string,
 ): string {
-  const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`)
+  const digits = sha256(``)
     .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
     .slice(0, 34);

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:339:41
   sourceId: string,
 ): string {
   const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
+    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) + 97))
     .slice(0, 34);
   return `ID${digits}`;

[Survived] StringLiteral
xml/builders/periodic/index.ts:345:50
 }
 
 function buildS1200(input: S1200PeriodicDto): BuiltPeriodicXmlEvent[] {
-  requireGeneratedStatus(input.payrollRunStatus, 'S-1200');
+  requireGeneratedStatus(input.payrollRunStatus, "");
   const payrollRunId = requireString(input.payrollRunId, 'payrollRunId');
   const workers = requireNonEmptyArray(input.workers, 'workers');

[Survived] StringLiteral
xml/builders/periodic/index.ts:359:56
   worker: S1200WorkerRemunerationDto,
 ): BuiltPeriodicXmlEvent {
   const employeeId = requireString(worker.employeeId, 'workers.employeeId');
-  const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
+  const rubrics = requireNonEmptyArray(worker.rubrics, "");
   const eventId = resolveLeafEventId(
     input,

[Survived] ArrowFunction
xml/builders/periodic/index.ts:367:32
   );
   const ideDmDev =
     worker.ideDmDev ?? demoId(payrollRunId, employeeId);
-  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('\n            ');
+  const itemsXml = rubrics.map(() => undefined).join('\n            ');
   const metadata = PERIODIC_EVENT_METADATA['S-1200'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] LogicalOperator
xml/builders/periodic/index.ts:381:38
       <infoPerApur>
         <ideEstabLot>
           <tpInsc>1</tpInsc>
-          <nrInsc>${fullRegistration(worker.establishmentRegistrationNumber ?? input.employerRegistrationNumber)}</nrInsc>
+          <nrInsc>${fullRegistration(worker.establishmentRegistrationNumber && input.employerRegistrationNumber)}</nrInsc>
           <codLotacao>${xmlEscape(worker.lotationCode ?? 'LOT01')}</codLotacao>
           <remunPerApur>

[Survived] StringLiteral
xml/builders/periodic/index.ts:382:58
         <ideEstabLot>
           <tpInsc>1</tpInsc>
           <nrInsc>${fullRegistration(worker.establishmentRegistrationNumber ?? input.employerRegistrationNumber)}</nrInsc>
-          <codLotacao>${xmlEscape(worker.lotationCode ?? 'LOT01')}</codLotacao>
+          <codLotacao>${xmlEscape(worker.lotationCode ?? "")}</codLotacao>
           <remunPerApur>
             <matricula>${cleanText(worker.registration, employeeId).slice(0, 30)}</matricula>

[Survived] MethodExpression
xml/builders/periodic/index.ts:384:26
           <nrInsc>${fullRegistration(worker.establishmentRegistrationNumber ?? input.employerRegistrationNumber)}</nrInsc>
           <codLotacao>${xmlEscape(worker.lotationCode ?? 'LOT01')}</codLotacao>
           <remunPerApur>
-            <matricula>${cleanText(worker.registration, employeeId).slice(0, 30)}</matricula>
+            <matricula>${cleanText(worker.registration, employeeId)}</matricula>
             ${itemsXml}
           </remunPerApur>

[Survived] StringLiteral
xml/builders/periodic/index.ts:413:58
 
 function buildS1202(input: S1202PeriodicDto): BuiltPeriodicXmlEvent[] {
   requireGeneratedStatus(input.payrollRunStatus, 'S-1202');
-  const payrollRunId = requireString(input.payrollRunId, 'payrollRunId');
+  const payrollRunId = requireString(input.payrollRunId, "");
   const workers = requireNonEmptyArray(input.workers, 'workers');
   return workers.map((worker) =>

[Survived] StringLiteral
xml/builders/periodic/index.ts:414:55
 function buildS1202(input: S1202PeriodicDto): BuiltPeriodicXmlEvent[] {
   requireGeneratedStatus(input.payrollRunStatus, 'S-1202');
   const payrollRunId = requireString(input.payrollRunId, 'payrollRunId');
-  const workers = requireNonEmptyArray(input.workers, 'workers');
+  const workers = requireNonEmptyArray(input.workers, "");
   return workers.map((worker) =>
     buildS1202Worker(input, payrollRunId, worker),

[Survived] StringLiteral
xml/builders/periodic/index.ts:427:59
 ): BuiltPeriodicXmlEvent {
   const employeeId = requireString(worker.employeeId, 'workers.employeeId');
   const rubrics = requireNonEmptyArray(worker.rubrics, 'workers.rubrics');
-  const categoryCode = requireString(worker.categoryCode, 'workers.categoryCode');
+  const categoryCode = requireString(worker.categoryCode, "");
   const eventId = resolveLeafEventId(
     input,

[Survived] StringLiteral
xml/builders/periodic/index.ts:431:5
   const eventId = resolveLeafEventId(
     input,
     worker.eventId,
-    `${payrollRunId}:${employeeId}`,
+    ``,
   );
   const ideDmDev =

[Survived] ArrowFunction
xml/builders/periodic/index.ts:435:32
   );
   const ideDmDev =
     worker.ideDmDev ?? demoId(payrollRunId, employeeId);
-  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('');
+  const itemsXml = rubrics.map(() => undefined).join('');
   const metadata = PERIODIC_EVENT_METADATA['S-1202'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] StringLiteral
xml/builders/periodic/index.ts:435:68
   );
   const ideDmDev =
     worker.ideDmDev ?? demoId(payrollRunId, employeeId);
-  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('');
+  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join("Stryker was here!");
   const metadata = PERIODIC_EVENT_METADATA['S-1202'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] ObjectLiteral
xml/builders/periodic/index.ts:468:14
     eventId,
     xml,
     metadata,
-    payload: {
-      payrollRunId,
-      employeeId,
-      ideDmDev,
-      codCateg: categoryCode,
-      rubricCount: rubrics.length,
-      totalsByRubric: totalsByRubric(rubrics),
-      totalsByTpRubrica: totalsByKind(rubrics),
-    },
+    payload: {},
   });
 }

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:494:7
   payrollRunId: string,
   benefit: S1207BenefitPaymentDto,
 ): BuiltPeriodicXmlEvent {
-  if (benefit.activeBenefitCount !== 1) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       'S-1207 emission requires exactly one active S-2410 benefit per beneficiary payroll row.',

[Survived] BlockStatement
xml/builders/periodic/index.ts:494:41
   payrollRunId: string,
   benefit: S1207BenefitPaymentDto,
 ): BuiltPeriodicXmlEvent {
-  if (benefit.activeBenefitCount !== 1) {
-    throw new PeriodicBuilderValidationError(
-      'S-1207 emission requires exactly one active S-2410 benefit per beneficiary payroll row.',
-    );
-  }
+  if (benefit.activeBenefitCount !== 1) {}
   const employeeId = requireString(benefit.employeeId, 'benefits.employeeId');
   const benefitSourceId = requireString(

[Survived] StringLiteral
xml/builders/periodic/index.ts:496:7
 ): BuiltPeriodicXmlEvent {
   if (benefit.activeBenefitCount !== 1) {
     throw new PeriodicBuilderValidationError(
-      'S-1207 emission requires exactly one active S-2410 benefit per beneficiary payroll row.',
+      "",
     );
   }

[Survived] StringLiteral
xml/builders/periodic/index.ts:499:56
       'S-1207 emission requires exactly one active S-2410 benefit per beneficiary payroll row.',
     );
   }
-  const employeeId = requireString(benefit.employeeId, 'benefits.employeeId');
+  const employeeId = requireString(benefit.employeeId, "");
   const benefitSourceId = requireString(
     benefit.benefitSourceId,

[Survived] StringLiteral
xml/builders/periodic/index.ts:506:5
   );
   const benefitSourceKind = requireBenefitSourceKind(
     benefit.benefitSourceKind,
-    'benefits.benefitSourceKind',
+    "",
   );
   const rubrics = requireNonEmptyArray(benefit.rubrics, 'benefits.rubrics');

[Survived] ArrowFunction
xml/builders/periodic/index.ts:520:32
     benefit.benefitNumber,
     'benefits.benefitNumber',
   );
-  const itemsXml = rubrics.map((rubric) => rubricXml(rubric)).join('');
+  const itemsXml = rubrics.map(() => undefined).join('');
   const metadata = PERIODIC_EVENT_METADATA['S-1207'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] LogicalOperator
xml/builders/periodic/index.ts:534:38
       <infoPerApur>
         <ideEstab>
           <tpInsc>1</tpInsc>
-          <nrInsc>${fullRegistration(benefit.establishmentRegistrationNumber ?? input.employerRegistrationNumber)}</nrInsc>
+          <nrInsc>${fullRegistration(benefit.establishmentRegistrationNumber && input.employerRegistrationNumber)}</nrInsc>
           ${itemsXml}
         </ideEstab>

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:570:25
   const paymentBatchId = requireString(input.paymentBatchId, 'paymentBatchId');
   const payments = requireNonEmptyArray(input.payments, 'payments');
   const emittedTotal = payments.reduce(
-    (total, payment) => total + cents(payment.amount),
+    (total, payment) => total - cents(payment.amount),
     0n,
   );

[Survived] BlockStatement
xml/builders/periodic/index.ts:574:39
     0n,
   );
   const expectedTotal = cents(input.confirmedTotal);
-  if (emittedTotal !== expectedTotal) {
-    throw new PeriodicBuilderValidationError(
-      `S-1210 vrLiq total ${moneyFromCents(
-        emittedTotal,
-      )} does not reconcile with confirmedTotal ${moneyFromCents(expectedTotal)}.`,
-    );
-  }
+  if (emittedTotal !== expectedTotal) {}
   return payments.map((payment) =>
     buildS1210Payment(input, paymentBatchId, payment),

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:574:7
     0n,
   );
   const expectedTotal = cents(input.confirmedTotal);
-  if (emittedTotal !== expectedTotal) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       `S-1210 vrLiq total ${moneyFromCents(

[Survived] StringLiteral
xml/builders/periodic/index.ts:576:7
   const expectedTotal = cents(input.confirmedTotal);
   if (emittedTotal !== expectedTotal) {
     throw new PeriodicBuilderValidationError(
-      `S-1210 vrLiq total ${moneyFromCents(
-        emittedTotal,
-      )} does not reconcile with confirmedTotal ${moneyFromCents(expectedTotal)}.`,
+      ``,
     );
   }

[Survived] StringLiteral
xml/builders/periodic/index.ts:591:56
   paymentBatchId: string,
   payment: S1210PaymentDto,
 ): BuiltPeriodicXmlEvent {
-  const employeeId = requireString(payment.employeeId, 'payments.employeeId');
+  const employeeId = requireString(payment.employeeId, "");
   const payrollRunId = payment.payrollRunId ?? input.payrollRunId ?? undefined;
   const sourceId = `${paymentBatchId}:${employeeId}`;

[Survived] StringLiteral
xml/builders/periodic/index.ts:599:32
     payment.ideDmDev ?? demoId(payrollRunId ?? paymentBatchId, employeeId);
   const amount = money(payment.amount);
   const metadata = PERIODIC_EVENT_METADATA['S-1210'];
-  const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>
-<eSocial xmlns="${metadata.namespace}">
-  <evtPgtos Id="${eventId}">
-    ${ideEventoFolhaMensal(input)}
-    ${ideEmpregadorXml(input.employerRegistrationNumber)}
-    <ideBenef>
-      <cpfBenef>${cpf(payment.cpf)}</cpfBenef>
-      <infoPgto>
-        <dtPgto>${dateOnly(payment.paymentDate)}</dtPgto>
-        <tpPgto>1</tpPgto>
-        <perRef>${input.competence}</perRef>
-        <ideDmDev>${xmlEscape(ideDmDev)}</ideDmDev>
-        <vrLiq>${amount}</vrLiq>
-      </infoPgto>
-    </ideBenef>
-  </evtPgtos>
-</eSocial>`);
+  const xml = withFinalNewline(``);
 
   return builtEvent(input, {

[Survived] LogicalOperator
xml/builders/periodic/index.ts:628:21
     metadata,
     payload: {
       paymentBatchId,
-      payrollRunId: payrollRunId ?? null,
+      payrollRunId: payrollRunId && null,
       employeeId,
       ideDmDev,

[Survived] MethodExpression
xml/builders/periodic/index.ts:637:19
 }
 
 function buildS1298(input: S1298PeriodicDto): BuiltPeriodicXmlEvent {
-  const receipt = requireString(
-    input.acceptedClosureReceipt,
-    'acceptedClosureReceipt',
-  ).trim();
+  const receipt = requireString(input.acceptedClosureReceipt, 'acceptedClosureReceipt');
   requireDateValue(input.acceptedClosureAt, 'acceptedClosureAt');
   const eventId =

[Survived] StringLiteral
xml/builders/periodic/index.ts:639:5
 function buildS1298(input: S1298PeriodicDto): BuiltPeriodicXmlEvent {
   const receipt = requireString(
     input.acceptedClosureReceipt,
-    'acceptedClosureReceipt',
+    "",
   ).trim();
   requireDateValue(input.acceptedClosureAt, 'acceptedClosureAt');

[Survived] StringLiteral
xml/builders/periodic/index.ts:673:5
 function buildS1299(input: S1299PeriodicDto): BuiltPeriodicXmlEvent {
   const pendingPeriodicEvents = requireArray(
     input.pendingPeriodicEvents,
-    'pendingPeriodicEvents',
+    "",
   );
   if (pendingPeriodicEvents.length > 0) {

[Survived] BlockStatement
xml/builders/periodic/index.ts:675:41
     input.pendingPeriodicEvents,
     'pendingPeriodicEvents',
   );
-  if (pendingPeriodicEvents.length > 0) {
-    throw new PeriodicBuilderValidationError(
-      'S-1299 closure requires all S-1200/S-1202/S-1207/S-1210 periodics to have accepted receipts.',
-    );
-  }
+  if (pendingPeriodicEvents.length > 0) {}
   const sourceEntityId = input.sourceEntityId ?? input.competence;
   const eventId =

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:675:7
     input.pendingPeriodicEvents,
     'pendingPeriodicEvents',
   );
-  if (pendingPeriodicEvents.length > 0) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       'S-1299 closure requires all S-1200/S-1202/S-1207/S-1210 periodics to have accepted receipts.',

[Survived] OptionalChaining
xml/builders/periodic/index.ts:686:5
     buildPeriodicEsocialEventId(input.eventClass, input.tenantId, input.competence);
   assertEventId(eventId, 'eventId');
   const remunerationCount = requireNonNegativeCount(
-    input.acceptedEventCounts?.remuneration,
+    input.acceptedEventCounts.remuneration,
     'acceptedEventCounts.remuneration',
   );

[Survived] OptionalChaining
xml/builders/periodic/index.ts:690:5
     'acceptedEventCounts.remuneration',
   );
   const paymentCount = requireNonNegativeCount(
-    input.acceptedEventCounts?.payments,
+    input.acceptedEventCounts.payments,
     'acceptedEventCounts.payments',
   );

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:693:27
     input.acceptedEventCounts?.payments,
     'acceptedEventCounts.payments',
   );
-  const hasRemuneration = remunerationCount > 0;
+  const hasRemuneration = false;
   const hasPayments = paymentCount > 0;
   const metadata = PERIODIC_EVENT_METADATA['S-1299'];

[Survived] EqualityOperator
xml/builders/periodic/index.ts:693:27
     input.acceptedEventCounts?.payments,
     'acceptedEventCounts.payments',
   );
-  const hasRemuneration = remunerationCount > 0;
+  const hasRemuneration = remunerationCount <= 0;
   const hasPayments = paymentCount > 0;
   const metadata = PERIODIC_EVENT_METADATA['S-1299'];

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:694:23
     'acceptedEventCounts.payments',
   );
   const hasRemuneration = remunerationCount > 0;
-  const hasPayments = paymentCount > 0;
+  const hasPayments = false;
   const metadata = PERIODIC_EVENT_METADATA['S-1299'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:694:23
     'acceptedEventCounts.payments',
   );
   const hasRemuneration = remunerationCount > 0;
-  const hasPayments = paymentCount > 0;
+  const hasPayments = true;
   const metadata = PERIODIC_EVENT_METADATA['S-1299'];
   const xml = withFinalNewline(`<?xml version="1.0" encoding="UTF-8"?>

[Survived] StringLiteral
xml/builders/periodic/index.ts:702:43
     ${ideEventoFolhaSemRetificacao(input)}
     ${ideEmpregadorXml(input.employerRegistrationNumber)}
     <infoFech>
-      <evtRemun>${hasRemuneration ? 'S' : 'N'}</evtRemun>
+      <evtRemun>${hasRemuneration ? 'S' : ""}</evtRemun>
       <evtPgtos>${hasPayments ? 'S' : 'N'}</evtPgtos>
       <evtComProd>N</evtComProd>

[Survived] BlockStatement
xml/builders/periodic/index.ts:764:55
   };
 }
 
-function assertBaseDto(input: PeriodicEventDto): void {
-  if (!isPromotedPeriodicEventClass(input.eventClass)) {
-    throw new PeriodicBuilderValidationError(
-      `Unsupported periodic eventClass: ${String(input.eventClass)}`,
-    );
-  }
-  requireString(input.tenantId, 'tenantId');
-  requireString(input.competence, 'competence');
-  if (!/^\d{4}-\d{2}$/.test(input.competence)) {
-    throw new PeriodicBuilderValidationError(
-      'Periodic builder DTO field competence must be YYYY-MM.',
-    );
-  }
-  requireString(input.employerRegistrationNumber, 'employerRegistrationNumber');
-  if (input.operation && input.operation !== 'original') {
-    throw new PeriodicBuilderValidationError(
-      `Unsupported periodic operation: ${input.operation}`,
-    );
-  }
-  if (input.environment && !/^[12]$/.test(input.environment)) {
-    throw new PeriodicBuilderValidationError(
-      `Unsupported eSocial environment: ${input.environment}`,
-    );
-  }
-}
+function assertBaseDto(input: PeriodicEventDto): void {}
 
 function resolveLeafEventId(

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:765:7
 }
 
 function assertBaseDto(input: PeriodicEventDto): void {
-  if (!isPromotedPeriodicEventClass(input.eventClass)) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       `Unsupported periodic eventClass: ${String(input.eventClass)}`,

[Survived] BooleanLiteral
xml/builders/periodic/index.ts:765:7
 }
 
 function assertBaseDto(input: PeriodicEventDto): void {
-  if (!isPromotedPeriodicEventClass(input.eventClass)) {
+  if (isPromotedPeriodicEventClass(input.eventClass)) {
     throw new PeriodicBuilderValidationError(
       `Unsupported periodic eventClass: ${String(input.eventClass)}`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:772:7
   }
   requireString(input.tenantId, 'tenantId');
   requireString(input.competence, 'competence');
-  if (!/^\d{4}-\d{2}$/.test(input.competence)) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       'Periodic builder DTO field competence must be YYYY-MM.',

[Survived] BlockStatement
xml/builders/periodic/index.ts:772:48
   }
   requireString(input.tenantId, 'tenantId');
   requireString(input.competence, 'competence');
-  if (!/^\d{4}-\d{2}$/.test(input.competence)) {
-    throw new PeriodicBuilderValidationError(
-      'Periodic builder DTO field competence must be YYYY-MM.',
-    );
-  }
+  if (!/^\d{4}-\d{2}$/.test(input.competence)) {}
   requireString(input.employerRegistrationNumber, 'employerRegistrationNumber');
   if (input.operation && input.operation !== 'original') {

[Survived] BlockStatement
xml/builders/periodic/index.ts:778:58
     );
   }
   requireString(input.employerRegistrationNumber, 'employerRegistrationNumber');
-  if (input.operation && input.operation !== 'original') {
-    throw new PeriodicBuilderValidationError(
-      `Unsupported periodic operation: ${input.operation}`,
-    );
-  }
+  if (input.operation && input.operation !== 'original') {}
   if (input.environment && !/^[12]$/.test(input.environment)) {
     throw new PeriodicBuilderValidationError(

[Survived] EqualityOperator
xml/builders/periodic/index.ts:778:26
     );
   }
   requireString(input.employerRegistrationNumber, 'employerRegistrationNumber');
-  if (input.operation && input.operation !== 'original') {
+  if (input.operation && input.operation === 'original') {
     throw new PeriodicBuilderValidationError(
       `Unsupported periodic operation: ${input.operation}`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:783:7
       `Unsupported periodic operation: ${input.operation}`,
     );
   }
-  if (input.environment && !/^[12]$/.test(input.environment)) {
+  if (true) {
     throw new PeriodicBuilderValidationError(
       `Unsupported eSocial environment: ${input.environment}`,

[Survived] BlockStatement
xml/builders/periodic/index.ts:783:63
       `Unsupported periodic operation: ${input.operation}`,
     );
   }
-  if (input.environment && !/^[12]$/.test(input.environment)) {
-    throw new PeriodicBuilderValidationError(
-      `Unsupported eSocial environment: ${input.environment}`,
-    );
-  }
+  if (input.environment && !/^[12]$/.test(input.environment)) {}
 }
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:785:7
   }
   if (input.environment && !/^[12]$/.test(input.environment)) {
     throw new PeriodicBuilderValidationError(
-      `Unsupported eSocial environment: ${input.environment}`,
+      ``,
     );
   }

[Survived] BlockStatement
xml/builders/periodic/index.ts:801:60
   return resolved;
 }
 
-function assertEventId(value: string, field: string): void {
-  if (!/^ID\d{34}$/.test(value)) {
-    throw new PeriodicBuilderValidationError(
-      `Periodic builder DTO field ${field} must match ID plus 34 digits.`,
-    );
-  }
-}
+function assertEventId(value: string, field: string): void {}
 
 function requireGeneratedStatus(value: string, eventClass: string): void {

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:802:7
 }
 
 function assertEventId(value: string, field: string): void {
-  if (!/^ID\d{34}$/.test(value)) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must match ID plus 34 digits.`,

[Survived] BooleanLiteral
xml/builders/periodic/index.ts:802:7
 }
 
 function assertEventId(value: string, field: string): void {
-  if (!/^ID\d{34}$/.test(value)) {
+  if (/^ID\d{34}$/.test(value)) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must match ID plus 34 digits.`,

[Survived] StringLiteral
xml/builders/periodic/index.ts:804:7
 function assertEventId(value: string, field: string): void {
   if (!/^ID\d{34}$/.test(value)) {
     throw new PeriodicBuilderValidationError(
-      `Periodic builder DTO field ${field} must match ID plus 34 digits.`,
+      ``,
     );
   }

[Survived] BlockStatement
xml/builders/periodic/index.ts:809:74
   }
 }
 
-function requireGeneratedStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'payrollRunStatus') !== 'GENERATED') {
-    throw new PeriodicBuilderValidationError(
-      `${eventClass} emission requires payrollRunStatus=GENERATED.`,
-    );
-  }
-}
+function requireGeneratedStatus(value: string, eventClass: string): void {}
 
 function requirePaidStatus(value: string, eventClass: string): void {

[Survived] EqualityOperator
xml/builders/periodic/index.ts:810:7
 }
 
 function requireGeneratedStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'payrollRunStatus') !== 'GENERATED') {
+  if (requireString(value, 'payrollRunStatus') === 'GENERATED') {
     throw new PeriodicBuilderValidationError(
       `${eventClass} emission requires payrollRunStatus=GENERATED.`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:810:7
 }
 
 function requireGeneratedStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'payrollRunStatus') !== 'GENERATED') {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       `${eventClass} emission requires payrollRunStatus=GENERATED.`,

[Survived] BlockStatement
xml/builders/periodic/index.ts:817:69
   }
 }
 
-function requirePaidStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'paymentBatchStatus') !== 'PAID') {
-    throw new PeriodicBuilderValidationError(
-      `${eventClass} emission requires paymentBatchStatus=PAID.`,
-    );
-  }
-}
+function requirePaidStatus(value: string, eventClass: string): void {}
 
 function requireString(value: unknown, field: string): string {

[Survived] BlockStatement
xml/builders/periodic/index.ts:818:62
 }
 
 function requirePaidStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'paymentBatchStatus') !== 'PAID') {
-    throw new PeriodicBuilderValidationError(
-      `${eventClass} emission requires paymentBatchStatus=PAID.`,
-    );
-  }
+  if (requireString(value, 'paymentBatchStatus') !== 'PAID') {}
 }
 

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:818:7
 }
 
 function requirePaidStatus(value: string, eventClass: string): void {
-  if (requireString(value, 'paymentBatchStatus') !== 'PAID') {
+  if (true) {
     throw new PeriodicBuilderValidationError(
       `${eventClass} emission requires paymentBatchStatus=PAID.`,

[Survived] StringLiteral
xml/builders/periodic/index.ts:820:7
 function requirePaidStatus(value: string, eventClass: string): void {
   if (requireString(value, 'paymentBatchStatus') !== 'PAID') {
     throw new PeriodicBuilderValidationError(
-      `${eventClass} emission requires paymentBatchStatus=PAID.`,
+      ``,
     );
   }

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:826:36
 }
 
 function requireString(value: unknown, field: string): string {
-  if (typeof value !== 'string' || value.trim() === '') {
+  if (typeof value !== 'string' || false) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} is required.`,

[Survived] EqualityOperator
xml/builders/periodic/index.ts:826:36
 }
 
 function requireString(value: unknown, field: string): string {
-  if (typeof value !== 'string' || value.trim() === '') {
+  if (typeof value !== 'string' || value.trim() !== '') {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} is required.`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:838:33
   value: unknown,
   field: string,
 ): S1207BenefitSourceKind {
-  if (value === 'RETIREMENT' || value === 'PENSION') return value;
+  if (value === 'RETIREMENT' || false) return value;
   throw new PeriodicBuilderValidationError(
     `Periodic builder DTO field ${field} must be RETIREMENT or PENSION.`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:838:7
   value: unknown,
   field: string,
 ): S1207BenefitSourceKind {
-  if (value === 'RETIREMENT' || value === 'PENSION') return value;
+  if (false || value === 'PENSION') return value;
   throw new PeriodicBuilderValidationError(
     `Periodic builder DTO field ${field} must be RETIREMENT or PENSION.`,

[Survived] StringLiteral
xml/builders/periodic/index.ts:840:5
 ): S1207BenefitSourceKind {
   if (value === 'RETIREMENT' || value === 'PENSION') return value;
   throw new PeriodicBuilderValidationError(
-    `Periodic builder DTO field ${field} must be RETIREMENT or PENSION.`,
+    ``,
   );
 }

[Survived] StringLiteral
xml/builders/periodic/index.ts:852:7
       : undefined;
   if (!date || Number.isNaN(date.getTime())) {
     throw new PeriodicBuilderValidationError(
-      `Periodic builder DTO field ${field} must be a valid date.`,
+      ``,
     );
   }

[Survived] EqualityOperator
xml/builders/periodic/index.ts:861:7
 function requireNonNegativeCount(value: unknown, field: string): number {
   const numeric = typeof value === 'number'
     ? value
-    : typeof value === 'string'
+    : typeof value !== 'string'
       ? Number(value)
       : Number.NaN;

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:861:7
 function requireNonNegativeCount(value: unknown, field: string): number {
   const numeric = typeof value === 'number'
     ? value
-    : typeof value === 'string'
+    : false
       ? Number(value)
       : Number.NaN;

[Survived] BooleanLiteral
xml/builders/periodic/index.ts:864:7
     : typeof value === 'string'
       ? Number(value)
       : Number.NaN;
-  if (!Number.isInteger(numeric) || numeric < 0) {
+  if (Number.isInteger(numeric) || numeric < 0) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must be a non-negative integer.`,

[Survived] LogicalOperator
xml/builders/periodic/index.ts:864:7
     : typeof value === 'string'
       ? Number(value)
       : Number.NaN;
-  if (!Number.isInteger(numeric) || numeric < 0) {
+  if (!Number.isInteger(numeric) && numeric < 0) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must be a non-negative integer.`,
