[Survived] StringLiteral
xml/builders/periodic/index.ts:866:7
       : Number.NaN;
   if (!Number.isInteger(numeric) || numeric < 0) {
     throw new PeriodicBuilderValidationError(
-      `Periodic builder DTO field ${field} must be a non-negative integer.`,
+      ``,
     );
   }

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:877:7
   field: string,
 ): readonly T[] {
   const array = requireArray(value, field);
-  if (array.length === 0) {
+  if (true) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must contain at least one item.`,

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:877:7
   field: string,
 ): readonly T[] {
   const array = requireArray(value, field);
-  if (array.length === 0) {
+  if (false) {
     throw new PeriodicBuilderValidationError(
       `Periodic builder DTO field ${field} must contain at least one item.`,

[Survived] StringLiteral
xml/builders/periodic/index.ts:879:7
   const array = requireArray(value, field);
   if (array.length === 0) {
     throw new PeriodicBuilderValidationError(
-      `Periodic builder DTO field ${field} must contain at least one item.`,
+      ``,
     );
   }

[Survived] EqualityOperator
xml/builders/periodic/index.ts:889:32
   value: readonly T[] | undefined,
   field: string,
 ): readonly T[] {
-  if (!Array.isArray(value) || value.length === 0) {
+  if (!Array.isArray(value) || value.length !== 0) {
     if (Array.isArray(value)) return value;
     throw new PeriodicBuilderValidationError(

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:889:32
   value: readonly T[] | undefined,
   field: string,
 ): readonly T[] {
-  if (!Array.isArray(value) || value.length === 0) {
+  if (!Array.isArray(value) || false) {
     if (Array.isArray(value)) return value;
     throw new PeriodicBuilderValidationError(

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:919:5
   field: string,
 ): PeriodicRubricKind {
   if (
-    value === 'EARNING' ||
-    value === 'DEDUCTION' ||
-    value === 'INFORMATION' ||
+    false ||
     value === 'BASE'
   ) {

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:919:5
   field: string,
 ): PeriodicRubricKind {
   if (
-    value === 'EARNING' ||
-    value === 'DEDUCTION' ||
+    false ||
     value === 'INFORMATION' ||
     value === 'BASE'

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:920:5
 ): PeriodicRubricKind {
   if (
     value === 'EARNING' ||
-    value === 'DEDUCTION' ||
+    false ||
     value === 'INFORMATION' ||
     value === 'BASE'

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:921:5
   if (
     value === 'EARNING' ||
     value === 'DEDUCTION' ||
-    value === 'INFORMATION' ||
+    false ||
     value === 'BASE'
   ) {

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:922:5
     value === 'EARNING' ||
     value === 'DEDUCTION' ||
     value === 'INFORMATION' ||
-    value === 'BASE'
+    false
   ) {
     return value;

[Survived] BlockStatement
xml/builders/periodic/index.ts:923:5
     value === 'DEDUCTION' ||
     value === 'INFORMATION' ||
     value === 'BASE'
-  ) {
-    return value;
-  }
+  ) {}
   throw new PeriodicBuilderValidationError(
     `Periodic builder DTO field ${field} must be a supported rubric kind.`,

[Survived] StringLiteral
xml/builders/periodic/index.ts:932:34
 }
 
 function rubricXml(rubric: PeriodicRubricDto): string {
-  requireRubricKind(rubric.kind, 'rubrics.kind');
+  requireRubricKind(rubric.kind, "");
   const quantity =
     rubric.quantity === null || rubric.quantity === undefined

[Survived] MethodExpression
xml/builders/periodic/index.ts:937:34
     rubric.quantity === null || rubric.quantity === undefined
       ? ''
       : `<qtdRubr>${decimal(rubric.quantity, 4)}</qtdRubr>`;
-  return `<itensRemun><codRubr>${xmlEscape(
-    requireString(rubric.code, 'rubrics.code'),
-  ).slice(0, 30)}</codRubr><ideTabRubr>${xmlEscape(
+  return `<itensRemun><codRubr>${xmlEscape(requireString(rubric.code, 'rubrics.code'))}</codRubr><ideTabRubr>${xmlEscape(
     rubric.tableCode ?? 'SGP',
   ).slice(0, 8)}</ideTabRubr>${quantity}<vrRubr>${money(

[Survived] StringLiteral
xml/builders/periodic/index.ts:937:10
     rubric.quantity === null || rubric.quantity === undefined
       ? ''
       : `<qtdRubr>${decimal(rubric.quantity, 4)}</qtdRubr>`;
-  return `<itensRemun><codRubr>${xmlEscape(
-    requireString(rubric.code, 'rubrics.code'),
-  ).slice(0, 30)}</codRubr><ideTabRubr>${xmlEscape(
-    rubric.tableCode ?? 'SGP',
-  ).slice(0, 8)}</ideTabRubr>${quantity}<vrRubr>${money(
-    rubric.amount,
-  )}</vrRubr><indApurIR>0</indApurIR></itensRemun>`;
+  return ``;
 }
 

[Survived] MethodExpression
xml/builders/periodic/index.ts:939:42
       : `<qtdRubr>${decimal(rubric.quantity, 4)}</qtdRubr>`;
   return `<itensRemun><codRubr>${xmlEscape(
     requireString(rubric.code, 'rubrics.code'),
-  ).slice(0, 30)}</codRubr><ideTabRubr>${xmlEscape(
-    rubric.tableCode ?? 'SGP',
-  ).slice(0, 8)}</ideTabRubr>${quantity}<vrRubr>${money(
+  ).slice(0, 30)}</codRubr><ideTabRubr>${xmlEscape(rubric.tableCode ?? 'SGP')}</ideTabRubr>${quantity}<vrRubr>${money(
     rubric.amount,
   )}</vrRubr><indApurIR>0</indApurIR></itensRemun>`;

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:952:7
   return rubrics.reduce<Record<string, string>>((totals, rubric) => {
     const kind = requireRubricKind(rubric.kind, 'rubrics.kind');
     totals[kind] = moneyFromCents(
-      cents(totals[kind] ?? '0.00') + cents(rubric.amount),
+      cents(totals[kind] ?? '0.00') - cents(rubric.amount),
     );
     return totals;

[Survived] StringLiteral
xml/builders/periodic/index.ts:962:45
   rubrics: readonly PeriodicRubricDto[],
 ): Record<string, string> {
   return rubrics.reduce<Record<string, string>>((totals, rubric) => {
-    const code = requireString(rubric.code, 'rubrics.code');
+    const code = requireString(rubric.code, "");
     totals[code] = moneyFromCents(
       cents(totals[code] ?? '0.00') + cents(rubric.amount),

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:964:7
   return rubrics.reduce<Record<string, string>>((totals, rubric) => {
     const code = requireString(rubric.code, 'rubrics.code');
     totals[code] = moneyFromCents(
-      cents(totals[code] ?? '0.00') + cents(rubric.amount),
+      cents(totals[code] ?? '0.00') - cents(rubric.amount),
     );
     return totals;

[Survived] MethodExpression
xml/builders/periodic/index.ts:971:10
 }
 
 function cpf(value: string | null | undefined): string {
-  return onlyDigits(value).padStart(11, '0').slice(0, 11);
+  return onlyDigits(value).padStart(11, '0');
 }
 

[Survived] MethodExpression
xml/builders/periodic/index.ts:975:19
 }
 
 function cleanText(value: string | null | undefined, fallback: string): string {
-  const cleaned = String(value ?? fallback).trim();
+  const cleaned = String(value ?? fallback);
   return xmlEscape(cleaned || fallback);
 }

[Survived] LogicalOperator
xml/builders/periodic/index.ts:975:26
 }
 
 function cleanText(value: string | null | undefined, fallback: string): string {
-  const cleaned = String(value ?? fallback).trim();
+  const cleaned = String(value && fallback).trim();
   return xmlEscape(cleaned || fallback);
 }

[Survived] LogicalOperator
xml/builders/periodic/index.ts:976:20
 
 function cleanText(value: string | null | undefined, fallback: string): string {
   const cleaned = String(value ?? fallback).trim();
-  return xmlEscape(cleaned || fallback);
+  return xmlEscape(cleaned && fallback);
 }
 

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:981:11
 
 function employerRegistration(value: string | null | undefined): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(
+  return (false ? digits.slice(0, 8) : '12345678').padStart(
     8,
     '0',

[Survived] EqualityOperator
xml/builders/periodic/index.ts:981:11
 
 function employerRegistration(value: string | null | undefined): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(
+  return (digits.length < 8 ? digits.slice(0, 8) : '12345678').padStart(
     8,
     '0',

[Survived] StringLiteral
xml/builders/periodic/index.ts:983:5
   const digits = onlyDigits(value);
   return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(
     8,
-    '0',
+    "",
   );
 }

[Survived] EqualityOperator
xml/builders/periodic/index.ts:990:5
 function fullRegistration(value: string | null | undefined): string {
   const digits = onlyDigits(value);
   return (
-    digits.length >= 14 ? digits.slice(0, 14) : '12345678000199'
+    digits.length > 14 ? digits.slice(0, 14) : '12345678000199'
   ).padStart(14, '0');
 }

[Survived] LogicalOperator
xml/builders/periodic/index.ts:995:17
 }
 
 function onlyDigits(value: string | number | boolean | null | undefined): string {
-  return String(value ?? '').replace(/\D/g, '');
+  return String(value && '').replace(/\D/g, '');
 }
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:995:26
 }
 
 function onlyDigits(value: string | number | boolean | null | undefined): string {
-  return String(value ?? '').replace(/\D/g, '');
+  return String(value ?? "Stryker was here!").replace(/\D/g, '');
 }
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:1001:20
 function xmlEscape(value: string): string {
   return value
     .replace(/&/g, '&amp;')
-    .replace(/</g, '&lt;')
+    .replace(/</g, "")
     .replace(/>/g, '&gt;')
     .replace(/"/g, '&quot;')

[Survived] StringLiteral
xml/builders/periodic/index.ts:1002:20
   return value
     .replace(/&/g, '&amp;')
     .replace(/</g, '&lt;')
-    .replace(/>/g, '&gt;')
+    .replace(/>/g, "")
     .replace(/"/g, '&quot;')
     .replace(/'/g, '&apos;');

[Survived] MethodExpression
xml/builders/periodic/index.ts:1008:58
 }
 
 function demoId(sourceId: string, entityId: string): string {
-  return `DM${sourceId.replace(/\D/g, '').slice(0, 10)}${entityId
-    .replace(/\D/g, '')
-    .slice(0, 10)}`.slice(0, 30);
+  return `DM${sourceId.replace(/\D/g, '').slice(0, 10)}${entityId.replace(/\D/g, '')}`.slice(0, 30);
 }
 

[Survived] MethodExpression
xml/builders/periodic/index.ts:1008:10
 }
 
 function demoId(sourceId: string, entityId: string): string {
-  return `DM${sourceId.replace(/\D/g, '').slice(0, 10)}${entityId
-    .replace(/\D/g, '')
-    .slice(0, 10)}`.slice(0, 30);
+  return `DM${sourceId.replace(/\D/g, '').slice(0, 10)}${entityId.replace(/\D/g, '').slice(0, 10)}`;
 }
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:1009:21
 
 function demoId(sourceId: string, entityId: string): string {
   return `DM${sourceId.replace(/\D/g, '').slice(0, 10)}${entityId
-    .replace(/\D/g, '')
+    .replace(/\D/g, "Stryker was here!")
     .slice(0, 10)}`.slice(0, 30);
 }

[Survived] MethodExpression
xml/builders/periodic/index.ts:1014:10
 }
 
 function dateOnly(value: Date | string): string {
-  return requireDateValue(value, 'paymentDate').toISOString().slice(0, 10);
+  return requireDateValue(value, 'paymentDate').toISOString();
 }
 

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:1023:17
 
 function decimal(value: string | number, scale: number): string {
   const [wholeRaw = '0', fractionRaw = ''] = String(value).split('.');
-  const whole = wholeRaw.replace(/[^\d-]/g, '') || '0';
+  const whole = true;
   const fraction = fractionRaw
     .replace(/\D/g, '')

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:1023:17
 
 function decimal(value: string | number, scale: number): string {
   const [wholeRaw = '0', fractionRaw = ''] = String(value).split('.');
-  const whole = wholeRaw.replace(/[^\d-]/g, '') || '0';
+  const whole = false;
   const fraction = fractionRaw
     .replace(/\D/g, '')

[Survived] MethodExpression
xml/builders/periodic/index.ts:1024:20
 function decimal(value: string | number, scale: number): string {
   const [wholeRaw = '0', fractionRaw = ''] = String(value).split('.');
   const whole = wholeRaw.replace(/[^\d-]/g, '') || '0';
-  const fraction = fractionRaw
-    .replace(/\D/g, '')
-    .padEnd(scale, '0')
-    .slice(0, scale);
+  const fraction = fractionRaw.replace(/\D/g, '').padEnd(scale, '0');
   return `${whole}.${fraction}`;
 }

[Survived] StringLiteral
xml/builders/periodic/index.ts:1026:20
   const whole = wholeRaw.replace(/[^\d-]/g, '') || '0';
   const fraction = fractionRaw
     .replace(/\D/g, '')
-    .padEnd(scale, '0')
+    .padEnd(scale, "")
     .slice(0, scale);
   return `${whole}.${fraction}`;

[Survived] StringLiteral
xml/builders/periodic/index.ts:1028:10
     .replace(/\D/g, '')
     .padEnd(scale, '0')
     .slice(0, scale);
-  return `${whole}.${fraction}`;
+  return ``;
 }
 

[Survived] StringLiteral
xml/builders/periodic/index.ts:1032:65
 }
 
 function cents(value: string | number): bigint {
-  const [wholeRaw = '0', fractionRaw = ''] = money(value).split('.');
+  const [wholeRaw = '0', fractionRaw = ''] = money(value).split("");
   return (
     BigInt(wholeRaw) * 100n + BigInt(fractionRaw.padEnd(2, '0').slice(0, 2))

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:1034:5
 function cents(value: string | number): bigint {
   const [wholeRaw = '0', fractionRaw = ''] = money(value).split('.');
   return (
-    BigInt(wholeRaw) * 100n + BigInt(fractionRaw.padEnd(2, '0').slice(0, 2))
+    BigInt(wholeRaw) / 100n + BigInt(fractionRaw.padEnd(2, '0').slice(0, 2))
   );
 }

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:1034:5
 function cents(value: string | number): bigint {
   const [wholeRaw = '0', fractionRaw = ''] = money(value).split('.');
   return (
-    BigInt(wholeRaw) * 100n + BigInt(fractionRaw.padEnd(2, '0').slice(0, 2))
+    BigInt(wholeRaw) * 100n - BigInt(fractionRaw.padEnd(2, '0').slice(0, 2))
   );
 }

[Survived] EqualityOperator
xml/builders/periodic/index.ts:1039:16
 }
 
 function moneyFromCents(value: bigint): string {
-  const sign = value < 0n ? '-' : '';
+  const sign = value <= 0n ? '-' : '';
   const abs = value < 0n ? -value : value;
   return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;

[Survived] EqualityOperator
xml/builders/periodic/index.ts:1039:16
 }
 
 function moneyFromCents(value: bigint): string {
-  const sign = value < 0n ? '-' : '';
+  const sign = value >= 0n ? '-' : '';
   const abs = value < 0n ? -value : value;
   return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;

[Survived] ConditionalExpression
xml/builders/periodic/index.ts:1040:15
 
 function moneyFromCents(value: bigint): string {
   const sign = value < 0n ? '-' : '';
-  const abs = value < 0n ? -value : value;
+  const abs = false ? -value : value;
   return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;
 }

[Survived] EqualityOperator
xml/builders/periodic/index.ts:1040:15
 
 function moneyFromCents(value: bigint): string {
   const sign = value < 0n ? '-' : '';
-  const abs = value < 0n ? -value : value;
+  const abs = value <= 0n ? -value : value;
   return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;
 }

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:1041:41
 function moneyFromCents(value: bigint): string {
   const sign = value < 0n ? '-' : '';
   const abs = value < 0n ? -value : value;
-  return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;
+  return `${sign}${abs / 100n}.${String(abs * 100n).padStart(2, '0')}`;
 }
 

[Survived] ArithmeticOperator
xml/builders/periodic/index.ts:1041:20
 function moneyFromCents(value: bigint): string {
   const sign = value < 0n ? '-' : '';
   const abs = value < 0n ? -value : value;
-  return `${sign}${abs / 100n}.${String(abs % 100n).padStart(2, '0')}`;
+  return `${sign}${abs * 100n}.${String(abs % 100n).padStart(2, '0')}`;
 }
 

[Survived] MethodExpression
xml/builders/periodic/index.ts:1049:10
 }
 
 function withFinalNewline(value: string): string {
-  return value.endsWith('\n') ? value : `${value}\n`;
+  return value.startsWith('\n') ? value : `${value}\n`;
 }
 
