[Survived] MethodExpression
domain/src/operations/retry.ts:201:26
   const classification =
     input.classification ?? classifyRetryFailure(input.error);
   const detail = classifyRetryFailureDetail(input.error, policy);
-  const currentAttempt = Math.max(0, Math.floor(input.attempt));
+  const currentAttempt = Math.min(0, Math.floor(input.attempt));
   const policyBudget = policy.budgets[classification];
   const maxAttempts =

[Survived] MethodExpression
domain/src/operations/retry.ts:206:21
   const maxAttempts =
     input.maxAttempts === undefined
       ? policyBudget
-      : Math.max(0, Math.min(policyBudget, Math.floor(input.maxAttempts)));
+      : Math.max(0, Math.max(policyBudget, Math.floor(input.maxAttempts)));
   const retryable = input.classification
     ? isRetryable(input.error, classification, policy)

[Survived] MethodExpression
domain/src/operations/retry.ts:206:9
   const maxAttempts =
     input.maxAttempts === undefined
       ? policyBudget
-      : Math.max(0, Math.min(policyBudget, Math.floor(input.maxAttempts)));
+      : Math.min(0, Math.min(policyBudget, Math.floor(input.maxAttempts)));
   const retryable = input.classification
     ? isRetryable(input.error, classification, policy)

[Survived] MethodExpression
domain/src/operations/retry.ts:210:27
   const retryable = input.classification
     ? isRetryable(input.error, classification, policy)
     : detail.retryable;
-  const budgetRemaining = Math.max(0, maxAttempts - currentAttempt);
+  const budgetRemaining = Math.min(0, maxAttempts - currentAttempt);
 
   if (!retryable || budgetRemaining <= 0) {

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:210:39
   const retryable = input.classification
     ? isRetryable(input.error, classification, policy)
     : detail.retryable;
-  const budgetRemaining = Math.max(0, maxAttempts - currentAttempt);
+  const budgetRemaining = Math.max(0, maxAttempts + currentAttempt);
 
   if (!retryable || budgetRemaining <= 0) {

[Survived] ConditionalExpression
domain/src/operations/retry.ts:212:21
     : detail.retryable;
   const budgetRemaining = Math.max(0, maxAttempts - currentAttempt);
 
-  if (!retryable || budgetRemaining <= 0) {
+  if (!retryable || false) {
     return {
       action: 'dlq',

[Survived] BlockStatement
domain/src/operations/retry.ts:212:43
     : detail.retryable;
   const budgetRemaining = Math.max(0, maxAttempts - currentAttempt);
 
-  if (!retryable || budgetRemaining <= 0) {
-    return {
-      action: 'dlq',
-      classification,
-      attempt: currentAttempt,
-      maxAttempts,
-      budgetRemaining,
-      retryable,
-      reason: !retryable
-        ? `${classification} failure is terminal.`
-        : `${classification} retry budget exhausted.`,
-    };
-  }
+  if (!retryable || budgetRemaining <= 0) {}
 
   const delayMs = calculateBackoffDelayMs({

[Survived] BooleanLiteral
domain/src/operations/retry.ts:220:15
       maxAttempts,
       budgetRemaining,
       retryable,
-      reason: !retryable
+      reason: retryable
         ? `${classification} failure is terminal.`
         : `${classification} retry budget exhausted.`,

[Survived] StringLiteral
domain/src/operations/retry.ts:221:11
       budgetRemaining,
       retryable,
       reason: !retryable
-        ? `${classification} failure is terminal.`
+        ? ``
         : `${classification} retry budget exhausted.`,
     };

[Survived] StringLiteral
domain/src/operations/retry.ts:222:11
       retryable,
       reason: !retryable
         ? `${classification} failure is terminal.`
-        : `${classification} retry budget exhausted.`,
+        : ``,
     };
   }

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:232:34
     jitterSeed: input.jitterSeed,
     policy,
   });
-  const nextAttemptAt = new Date(input.occurredAt.getTime() + delayMs).toISOString();
+  const nextAttemptAt = new Date(input.occurredAt.getTime() - delayMs).toISOString();
 
   return {

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:238:18
     action: 'retry',
     classification,
     attempt: currentAttempt,
-    nextAttempt: currentAttempt + 1,
+    nextAttempt: currentAttempt - 1,
     maxAttempts,
     budgetRemaining,

[Survived] StringLiteral
domain/src/operations/retry.ts:244:13
     delayMs,
     nextAttemptAt,
     retryable,
-    reason: `${classification} failure scheduled for retry.`,
+    reason: ``,
   };
 }

[Survived] BooleanLiteral
domain/src/operations/retry.ts:259:45
   policy: RetryPolicy = DEFAULT_RETRY_POLICY,
 ): RetryFailureClassificationDetail {
   if (!error) {
-    return classificationDetail('internal', false, policy);
+    return classificationDetail('internal', true, policy);
   }
 

[Survived] ConditionalExpression
domain/src/operations/retry.ts:262:7
     return classificationDetail('internal', false, policy);
   }
 
-  if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {
+  if (false) {
     return classificationDetail('malformed', false, policy);
   }

[Survived] BlockStatement
domain/src/operations/retry.ts:262:89
     return classificationDetail('internal', false, policy);
   }
 
-  if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {
-    return classificationDetail('malformed', false, policy);
-  }
+  if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {}
   if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
     return classificationDetail('timeout', true, policy);

[Survived] BooleanLiteral
domain/src/operations/retry.ts:263:46
   }
 
   if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {
-    return classificationDetail('malformed', false, policy);
+    return classificationDetail('malformed', true, policy);
   }
   if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {

[Survived] BlockStatement
domain/src/operations/retry.ts:265:62
   if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {
     return classificationDetail('malformed', false, policy);
   }
-  if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
-    return classificationDetail('timeout', true, policy);
-  }
+  if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {}
   if (error.category === 'transport') {
     return classificationDetail('transport', true, policy);

[Survived] ConditionalExpression
domain/src/operations/retry.ts:265:7
   if (/MALFORMED|NOT_OBJECT|UNSUPPORTED_VERSION|UNSUPPORTED_FAMILY/iu.test(error.code)) {
     return classificationDetail('malformed', false, policy);
   }
-  if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
+  if (false) {
     return classificationDetail('timeout', true, policy);
   }

[Survived] BooleanLiteral
domain/src/operations/retry.ts:266:44
     return classificationDetail('malformed', false, policy);
   }
   if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
-    return classificationDetail('timeout', true, policy);
+    return classificationDetail('timeout', false, policy);
   }
   if (error.category === 'transport') {

[Survived] BlockStatement
domain/src/operations/retry.ts:268:39
   if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
     return classificationDetail('timeout', true, policy);
   }
-  if (error.category === 'transport') {
-    return classificationDetail('transport', true, policy);
-  }
+  if (error.category === 'transport') {}
   if (
     error.category === 'authentication' ||

[Survived] ConditionalExpression
domain/src/operations/retry.ts:268:7
   if (/TIMEOUT|ETIMEDOUT|SOCKET_TIMEOUT/iu.test(error.code)) {
     return classificationDetail('timeout', true, policy);
   }
-  if (error.category === 'transport') {
+  if (false) {
     return classificationDetail('transport', true, policy);
   }

[Survived] BooleanLiteral
domain/src/operations/retry.ts:269:46
     return classificationDetail('timeout', true, policy);
   }
   if (error.category === 'transport') {
-    return classificationDetail('transport', true, policy);
+    return classificationDetail('transport', false, policy);
   }
   if (

[Survived] EqualityOperator
domain/src/operations/retry.ts:272:5
     return classificationDetail('transport', true, policy);
   }
   if (
-    error.category === 'authentication' ||
+    error.category !== 'authentication' ||
     /CERT|CERTIFICATE|EXPIRED|AUTH|UNAUTHORIZED|FORBIDDEN/iu.test(error.code)
   ) {

[Survived] ConditionalExpression
domain/src/operations/retry.ts:272:5
     return classificationDetail('transport', true, policy);
   }
   if (
-    error.category === 'authentication' ||
-    /CERT|CERTIFICATE|EXPIRED|AUTH|UNAUTHORIZED|FORBIDDEN/iu.test(error.code)
+    false
   ) {
     return classificationDetail('authentication', true, policy);

[Survived] BlockStatement
domain/src/operations/retry.ts:274:5
   if (
     error.category === 'authentication' ||
     /CERT|CERTIFICATE|EXPIRED|AUTH|UNAUTHORIZED|FORBIDDEN/iu.test(error.code)
-  ) {
-    return classificationDetail('authentication', true, policy);
-  }
+  ) {}
 
   return classificationDetail(error.category, false, policy);

[Survived] BooleanLiteral
domain/src/operations/retry.ts:275:51
     error.category === 'authentication' ||
     /CERT|CERTIFICATE|EXPIRED|AUTH|UNAUTHORIZED|FORBIDDEN/iu.test(error.code)
   ) {
-    return classificationDetail('authentication', true, policy);
+    return classificationDetail('authentication', false, policy);
   }
 

[Survived] BooleanLiteral
domain/src/operations/retry.ts:278:47
     return classificationDetail('authentication', true, policy);
   }
 
-  return classificationDetail(error.category, false, policy);
+  return classificationDetail(error.category, true, policy);
 }
 

[Survived] MethodExpression
domain/src/operations/retry.ts:288:20
   policy?: RetryPolicy | undefined;
 }>): number {
   const policy = input.policy ?? DEFAULT_RETRY_POLICY;
-  const exponent = Math.max(0, input.attempt - 1);
+  const exponent = Math.min(0, input.attempt - 1);
   const rawDelay = Math.min(
     policy.maxDelayMs,

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:288:32
   policy?: RetryPolicy | undefined;
 }>): number {
   const policy = input.policy ?? DEFAULT_RETRY_POLICY;
-  const exponent = Math.max(0, input.attempt - 1);
+  const exponent = Math.max(0, input.attempt + 1);
   const rawDelay = Math.min(
     policy.maxDelayMs,

[Survived] MethodExpression
domain/src/operations/retry.ts:289:20
 }>): number {
   const policy = input.policy ?? DEFAULT_RETRY_POLICY;
   const exponent = Math.max(0, input.attempt - 1);
-  const rawDelay = Math.min(
-    policy.maxDelayMs,
-    policy.baseDelayMs * (policy.multiplier ** exponent),
-  );
+  const rawDelay = Math.max(policy.maxDelayMs, policy.baseDelayMs * policy.multiplier ** exponent);
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
   const centeredJitter = (hashFraction(seed) * 2) - 1;

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:291:5
   const exponent = Math.max(0, input.attempt - 1);
   const rawDelay = Math.min(
     policy.maxDelayMs,
-    policy.baseDelayMs * (policy.multiplier ** exponent),
+    policy.baseDelayMs / policy.multiplier ** exponent,
   );
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;

[Survived] StringLiteral
domain/src/operations/retry.ts:293:36
     policy.maxDelayMs,
     policy.baseDelayMs * (policy.multiplier ** exponent),
   );
-  const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
+  const seed = input.jitterSeed ?? ``;
   const centeredJitter = (hashFraction(seed) * 2) - 1;
   const multiplier = 1 + (centeredJitter * policy.jitterRatio);

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:294:27
     policy.baseDelayMs * (policy.multiplier ** exponent),
   );
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
-  const centeredJitter = (hashFraction(seed) * 2) - 1;
+  const centeredJitter = (hashFraction(seed) / 2) - 1;
   const multiplier = 1 + (centeredJitter * policy.jitterRatio);
 

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:294:26
     policy.baseDelayMs * (policy.multiplier ** exponent),
   );
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
-  const centeredJitter = (hashFraction(seed) * 2) - 1;
+  const centeredJitter = hashFraction(seed) * 2 + 1;
   const multiplier = 1 + (centeredJitter * policy.jitterRatio);
 

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:295:22
   );
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
   const centeredJitter = (hashFraction(seed) * 2) - 1;
-  const multiplier = 1 + (centeredJitter * policy.jitterRatio);
+  const multiplier = 1 - centeredJitter * policy.jitterRatio;
 
   return Math.max(0, Math.round(rawDelay * multiplier));

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:295:27
   );
   const seed = input.jitterSeed ?? `${input.classification}:${input.attempt}`;
   const centeredJitter = (hashFraction(seed) * 2) - 1;
-  const multiplier = 1 + (centeredJitter * policy.jitterRatio);
+  const multiplier = 1 + (centeredJitter / policy.jitterRatio);
 
   return Math.max(0, Math.round(rawDelay * multiplier));

[Survived] MethodExpression
domain/src/operations/retry.ts:297:10
   const centeredJitter = (hashFraction(seed) * 2) - 1;
   const multiplier = 1 + (centeredJitter * policy.jitterRatio);
 
-  return Math.max(0, Math.round(rawDelay * multiplier));
+  return Math.min(0, Math.round(rawDelay * multiplier));
 }
 

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:297:33
   const centeredJitter = (hashFraction(seed) * 2) - 1;
   const multiplier = 1 + (centeredJitter * policy.jitterRatio);
 
-  return Math.max(0, Math.round(rawDelay * multiplier));
+  return Math.max(0, Math.round(rawDelay / multiplier));
 }
 

[Survived] ConditionalExpression
domain/src/operations/retry.ts:311:16
     classification: input.decision.classification,
     errorCode: input.error.code,
     errorMessage: input.error.message,
-    retryable: input.decision.retryable && input.decision.action === 'retry',
+    retryable: true,
     delayMs: input.decision.delayMs,
     nextAttemptAt: input.decision.nextAttemptAt,

[Survived] ConditionalExpression
domain/src/operations/retry.ts:311:44
     classification: input.decision.classification,
     errorCode: input.error.code,
     errorMessage: input.error.message,
-    retryable: input.decision.retryable && input.decision.action === 'retry',
+    retryable: input.decision.retryable && true,
     delayMs: input.decision.delayMs,
     nextAttemptAt: input.decision.nextAttemptAt,

[Survived] BlockStatement
domain/src/operations/retry.ts:371:22
 
   for (const record of records) {
     const gate = await input.circuitGate?.shouldDefer(record, now);
-    if (gate?.defer) {
-      await input.repository.defer({
-        retryScheduleId: record.retryScheduleId,
-        nextAttemptAt: gate.nextAttemptAt,
-        reason: gate.reason,
-      });
-      deferred += 1;
-      continue;
-    }
+    if (gate?.defer) {}
 
     if (record.budgetRemaining <= 0 || record.attemptCount >= record.maxAttempts) {

[Survived] AssignmentOperator
domain/src/operations/retry.ts:377:7
         nextAttemptAt: gate.nextAttemptAt,
         reason: gate.reason,
       });
-      deferred += 1;
+      deferred -= 1;
       continue;
     }

[Survived] EqualityOperator
domain/src/operations/retry.ts:381:40
       continue;
     }
 
-    if (record.budgetRemaining <= 0 || record.attemptCount >= record.maxAttempts) {
+    if (record.budgetRemaining <= 0 || record.attemptCount > record.maxAttempts) {
       const error = retryRecordError(record, nowIso);
       const decision = decideRetry({

[Survived] EqualityOperator
domain/src/operations/retry.ts:381:40
       continue;
     }
 
-    if (record.budgetRemaining <= 0 || record.attemptCount >= record.maxAttempts) {
+    if (record.budgetRemaining <= 0 || record.attemptCount < record.maxAttempts) {
       const error = retryRecordError(record, nowIso);
       const decision = decideRetry({

[Survived] ArrayDeclaration
domain/src/operations/retry.ts:397:17
       });
       const terminal = buildTerminalDlqPayload({
         request: record.originalEnvelope,
-        errors: [error],
+        errors: [],
         occurredAt: nowIso,
         finalAttempt: record.attemptCount,

[Survived] ArrayDeclaration
domain/src/operations/retry.ts:401:25
         occurredAt: nowIso,
         finalAttempt: record.attemptCount,
         lastClassification: record.lastClassification,
-        attemptHistory: [evidence],
+        attemptHistory: [],
       });
       await input.repository.moveToDlq({

[Survived] AssignmentOperator
domain/src/operations/retry.ts:413:7
           eventRecordId: record.eventRecordId,
         }),
       });
-      dlq += 1;
+      dlq -= 1;
       continue;
     }

[Survived] AssignmentOperator
domain/src/operations/retry.ts:424:5
       dispatchedAt: nowIso,
       attempt: retryRequest.attempt,
     });
-    dispatched += 1;
+    dispatched -= 1;
   }
 

[Survived] StringLiteral
domain/src/operations/retry.ts:473:44
   const primaryError = input.errors[0];
   const classification =
     input.lastClassification ?? classifyRetryFailure(primaryError);
-  const replayTopic = input.replayTopic ?? 'sgp.esocial.replay';
+  const replayTopic = input.replayTopic ?? "";
 
   return {

[Survived] ArrowFunction
domain/src/operations/retry.ts:489:34
     kind: input.request.kind,
     status: 'dlq',
     final_attempt: input.finalAttempt ?? input.request.attempt,
-    dlq_reason: input.errors.map((error) => error.message).join('; '),
+    dlq_reason: input.errors.map(() => undefined).join('; '),
     failed_at: input.occurredAt,
     errors: input.errors,

[Survived] StringLiteral
domain/src/operations/retry.ts:489:65
     kind: input.request.kind,
     status: 'dlq',
     final_attempt: input.finalAttempt ?? input.request.attempt,
-    dlq_reason: input.errors.map((error) => error.message).join('; '),
+    dlq_reason: input.errors.map((error) => error.message).join(""),
     failed_at: input.occurredAt,
     errors: input.errors,

[Survived] BooleanLiteral
domain/src/operations/retry.ts:506:17
       replay_topic: replayTopic,
       schema_version: 'v1',
       idempotency_derivation: 'esocial:v1:replay:sha256(original-idempotency-key + replay-request-id)',
-      eligible: true,
+      eligible: false,
     },
   };

[Survived] ConditionalExpression
domain/src/operations/retry.ts:527:41
   classification: RetryFailureClassification,
   policy: RetryPolicy = DEFAULT_RETRY_POLICY,
 ): boolean {
-  if (error?.retryable !== undefined && error.retryable === false) {
+  if (error?.retryable !== undefined && true) {
     return false;
   }

[Survived] ConditionalExpression
domain/src/operations/retry.ts:527:7
   classification: RetryFailureClassification,
   policy: RetryPolicy = DEFAULT_RETRY_POLICY,
 ): boolean {
-  if (error?.retryable !== undefined && error.retryable === false) {
+  if (false) {
     return false;
   }

[Survived] BooleanLiteral
domain/src/operations/retry.ts:528:12
   policy: RetryPolicy = DEFAULT_RETRY_POLICY,
 ): boolean {
   if (error?.retryable !== undefined && error.retryable === false) {
-    return false;
+    return true;
   }
   const detail = classifyRetryFailureDetail(error, policy);

[Survived] EqualityOperator
domain/src/operations/retry.ts:531:7
     return false;
   }
   const detail = classifyRetryFailureDetail(error, policy);
-  if (detail.category === classification) return detail.retryable;
+  if (detail.category !== classification) return detail.retryable;
   return classification === 'transport' ||
     classification === 'timeout' ||

[Survived] ConditionalExpression
domain/src/operations/retry.ts:531:7
     return false;
   }
   const detail = classifyRetryFailureDetail(error, policy);
-  if (detail.category === classification) return detail.retryable;
+  if (true) return detail.retryable;
   return classification === 'transport' ||
     classification === 'timeout' ||

[Survived] ConditionalExpression
domain/src/operations/retry.ts:532:10
   }
   const detail = classifyRetryFailureDetail(error, policy);
   if (detail.category === classification) return detail.retryable;
-  return classification === 'transport' ||
-    classification === 'timeout' ||
-    classification === 'authentication';
+  return true;
 }
 

[Survived] ConditionalExpression
domain/src/operations/retry.ts:532:10
   }
   const detail = classifyRetryFailureDetail(error, policy);
   if (detail.category === classification) return detail.retryable;
-  return classification === 'transport' ||
-    classification === 'timeout' ||
-    classification === 'authentication';
+  return false;
 }
 

[Survived] ConditionalExpression
domain/src/operations/retry.ts:533:5
   const detail = classifyRetryFailureDetail(error, policy);
   if (detail.category === classification) return detail.retryable;
   return classification === 'transport' ||
-    classification === 'timeout' ||
+    false ||
     classification === 'authentication';
 }

[Survived] ConditionalExpression
domain/src/operations/retry.ts:534:5
   if (detail.category === classification) return detail.retryable;
   return classification === 'transport' ||
     classification === 'timeout' ||
-    classification === 'authentication';
+    false;
 }
 

[Survived] EqualityOperator
domain/src/operations/retry.ts:534:5
   if (detail.category === classification) return detail.retryable;
   return classification === 'transport' ||
     classification === 'timeout' ||
-    classification === 'authentication';
+    classification !== 'authentication';
 }
 

[Survived] ConditionalExpression
domain/src/operations/retry.ts:554:15
   occurredAt: string,
 ): EsocialContractError {
   return {
-    category: record.lastClassification === 'timeout'
+    category: true
       ? 'transport'
       : record.lastClassification as EsocialErrorCategory,

[Survived] ConditionalExpression
domain/src/operations/retry.ts:554:15
   occurredAt: string,
 ): EsocialContractError {
   return {
-    category: record.lastClassification === 'timeout'
+    category: false
       ? 'transport'
       : record.lastClassification as EsocialErrorCategory,

[Survived] BooleanLiteral
domain/src/operations/retry.ts:559:16
       : record.lastClassification as EsocialErrorCategory,
     code: record.lastErrorCode ?? 'ESOCIAL_RETRY_BUDGET_EXHAUSTED',
     message: record.lastErrorMessage,
-    retryable: false,
+    retryable: true,
     occurred_at: occurredAt,
   };

[Survived] MethodExpression
domain/src/operations/retry.ts:565:15
 }
 
 function hashFraction(seed: string): number {
-  const hex = createHash('sha256').update(seed).digest('hex').slice(0, 12);
+  const hex = createHash('sha256').update(seed).digest('hex');
   return Number.parseInt(hex, 16) / 0xffffffffffff;
 }

[Survived] ArithmeticOperator
domain/src/operations/retry.ts:566:10
 
 function hashFraction(seed: string): number {
   const hex = createHash('sha256').update(seed).digest('hex').slice(0, 12);
-  return Number.parseInt(hex, 16) / 0xffffffffffff;
+  return Number.parseInt(hex, 16) * 0xffffffffffff;
 }
 

[Survived] StringLiteral
domain/src/operations/retry.ts:570:31
 }
 
 function sha256Prefixed(value: string): string {
-  return `sha256:${createHash('sha256').update(value).digest('hex')}`;
+  return `sha256:${createHash("").update(value).digest('hex')}`;
 }
 

[Survived] BlockStatement
domain/src/operations/retry.ts:574:29
 }
 
 function canonicalJson(value: unknown): string {
-  if (Array.isArray(value)) {
-    return `[${value.map(canonicalJson).join(',')}]`;
-  }
+  if (Array.isArray(value)) {}
   if (typeof value === 'object' && value !== null) {
     return `{${Object.entries(value)

[Survived] BlockStatement
domain/src/operations/retry.ts:577:52
   if (Array.isArray(value)) {
     return `[${value.map(canonicalJson).join(',')}]`;
   }
-  if (typeof value === 'object' && value !== null) {
-    return `{${Object.entries(value)
-      .sort(([left], [right]) => left.localeCompare(right))
-      .map(([key, nested]) => `${JSON.stringify(key)}:${canonicalJson(nested)}`)
-      .join(',')}}`;
-  }
+  if (typeof value === 'object' && value !== null) {}
   return JSON.stringify(value);
 }

[Survived] MethodExpression
domain/src/operations/retry.ts:578:16
     return `[${value.map(canonicalJson).join(',')}]`;
   }
   if (typeof value === 'object' && value !== null) {
-    return `{${Object.entries(value)
-      .sort(([left], [right]) => left.localeCompare(right))
+    return `{${Object.entries(value)
       .map(([key, nested]) => `${JSON.stringify(key)}:${canonicalJson(nested)}`)
       .join(',')}}`;

[Survived] ArrowFunction
domain/src/operations/retry.ts:580:12
   if (typeof value === 'object' && value !== null) {
     return `{${Object.entries(value)
       .sort(([left], [right]) => left.localeCompare(right))
-      .map(([key, nested]) => `${JSON.stringify(key)}:${canonicalJson(nested)}`)
+      .map(() => undefined)
       .join(',')}}`;
   }

[Survived] StringLiteral
domain/src/operations/retry.ts:581:13
     return `{${Object.entries(value)
       .sort(([left], [right]) => left.localeCompare(right))
       .map(([key, nested]) => `${JSON.stringify(key)}:${canonicalJson(nested)}`)
-      .join(',')}}`;
+      .join("")}}`;
   }
   return JSON.stringify(value);

[Survived] ConditionalExpression
domain/src/operations/retry.ts:587:18
 }
 
 function signedPayloadSha256(payload: unknown): string | undefined {
-  const record = typeof payload === 'object' && payload !== null && !Array.isArray(payload)
+  const record = true
     ? payload as Record<string, unknown>
     : {};

[Survived] ConditionalExpression
domain/src/operations/retry.ts:587:18
 }
 
 function signedPayloadSha256(payload: unknown): string | undefined {
-  const record = typeof payload === 'object' && payload !== null && !Array.isArray(payload)
+  const record = true && !Array.isArray(payload)
     ? payload as Record<string, unknown>
     : {};

[Survived] LogicalOperator
domain/src/operations/retry.ts:590:26
   const record = typeof payload === 'object' && payload !== null && !Array.isArray(payload)
     ? payload as Record<string, unknown>
     : {};
-  const signedEnvelope = typeof record['signedEnvelope'] === 'object' &&
-    record['signedEnvelope'] !== null &&
+  const signedEnvelope = typeof record['signedEnvelope'] === 'object' || record['signedEnvelope'] !== null &&
     !Array.isArray(record['signedEnvelope'])
     ? record['signedEnvelope'] as Record<string, unknown>

[Survived] LogicalOperator
domain/src/operations/retry.ts:590:26
   const record = typeof payload === 'object' && payload !== null && !Array.isArray(payload)
     ? payload as Record<string, unknown>
     : {};
-  const signedEnvelope = typeof record['signedEnvelope'] === 'object' &&
-    record['signedEnvelope'] !== null &&
-    !Array.isArray(record['signedEnvelope'])
+  const signedEnvelope = typeof record['signedEnvelope'] === 'object' && record['signedEnvelope'] !== null || !Array.isArray(record['signedEnvelope'])
     ? record['signedEnvelope'] as Record<string, unknown>
     : {};

[Survived] ConditionalExpression
domain/src/operations/retry.ts:591:5
     ? payload as Record<string, unknown>
     : {};
   const signedEnvelope = typeof record['signedEnvelope'] === 'object' &&
-    record['signedEnvelope'] !== null &&
+    true &&
     !Array.isArray(record['signedEnvelope'])
     ? record['signedEnvelope'] as Record<string, unknown>
