[Survived] ArrowFunction
domain/src/observability/logger.ts:109:31
 }
 
 export function createPinoLogger(options: LoggerFactoryOptions): StructuredLogger {
-  const now = options.now ?? (() => new Date());
+  const now = options.now ?? (() => undefined);
   const sink = options.sink;
   const pinoLogger = pino(

[Survived] StringLiteral
domain/src/observability/logger.ts:115:19
     {
       base: null,
       level: options.level ?? defaultLogLevel(),
-      messageKey: 'message',
+      messageKey: "",
       timestamp: false,
       formatters: {

[Survived] BooleanLiteral
domain/src/observability/logger.ts:116:18
       base: null,
       level: options.level ?? defaultLogLevel(),
       messageKey: 'message',
-      timestamp: false,
+      timestamp: true,
       formatters: {
         level(label) {

[Survived] BlockStatement
domain/src/observability/logger.ts:125:37
     },
     sink
       ? {
-          write(line: string): void {
-            sink(line.trimEnd());
-          },
+          write(line: string): void {},
         }
       : undefined,

[Survived] MethodExpression
domain/src/observability/logger.ts:126:18
     sink
       ? {
           write(line: string): void {
-            sink(line.trimEnd());
+            sink(line.trimStart());
           },
         }

[Survived] BlockStatement
domain/src/observability/logger.ts:135:11
   function write(
     level: StructuredLogLevel,
     input: Omit<StructuredLogInput, 'level' | 'service'>,
-  ): void {
-    const entry = buildStructuredLogEntry({
-      ...input,
-      level,
-      service: options.service,
-      now: now(),
-    });
-    writePino(pinoLogger, level, entry);
-  }
+  ): void {}
 
   return {

[Survived] ArrowFunction
domain/src/observability/logger.ts:146:12
   }
 
   return {
-    debug: (input) => write('debug', input),
+    debug: () => undefined,
     info: (input) => write('info', input),
     warn: (input) => write('warn', input),

[Survived] ArrowFunction
domain/src/observability/logger.ts:147:11
 
   return {
     debug: (input) => write('debug', input),
-    info: (input) => write('info', input),
+    info: () => undefined,
     warn: (input) => write('warn', input),
     error: (input) => write('error', input),

[Survived] ArrowFunction
domain/src/observability/logger.ts:148:11
   return {
     debug: (input) => write('debug', input),
     info: (input) => write('info', input),
-    warn: (input) => write('warn', input),
+    warn: () => undefined,
     error: (input) => write('error', input),
   };

[Survived] ArrowFunction
domain/src/observability/logger.ts:149:12
     debug: (input) => write('debug', input),
     info: (input) => write('info', input),
     warn: (input) => write('warn', input),
-    error: (input) => write('error', input),
+    error: () => undefined,
   };
 }

[Survived] StringLiteral
domain/src/observability/logger.ts:160:33
   now?: (() => Date) | undefined;
 }> = {}): StructuredLogger {
   return createPinoLogger({
-    service: options.service ?? 'esocial',
+    service: options.service ?? "",
     sink: options.sink,
     level: options.level,

[Survived] BlockStatement
domain/src/observability/logger.ts:206:79
   }) as StructuredLogContext;
 }
 
-export function assertRequiredLogFields(entry: Record<string, unknown>): void {
-  for (const field of ESOCIAL_LOG_FIELD_NAMES) {
-    if (!Object.hasOwn(entry, field)) {
-      throw new Error(`Structured log entry is missing ${field}.`);
-    }
-  }
-}
+export function assertRequiredLogFields(entry: Record<string, unknown>): void {}
 
 function defaultLogLevel(): StructuredLogLevel {

[Survived] BlockStatement
domain/src/observability/logger.ts:207:48
 }
 
 export function assertRequiredLogFields(entry: Record<string, unknown>): void {
-  for (const field of ESOCIAL_LOG_FIELD_NAMES) {
-    if (!Object.hasOwn(entry, field)) {
-      throw new Error(`Structured log entry is missing ${field}.`);
-    }
-  }
+  for (const field of ESOCIAL_LOG_FIELD_NAMES) {}
 }
 

[Survived] BlockStatement
domain/src/observability/logger.ts:208:39
 
 export function assertRequiredLogFields(entry: Record<string, unknown>): void {
   for (const field of ESOCIAL_LOG_FIELD_NAMES) {
-    if (!Object.hasOwn(entry, field)) {
-      throw new Error(`Structured log entry is missing ${field}.`);
-    }
+    if (!Object.hasOwn(entry, field)) {}
   }
 }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:208:9
 
 export function assertRequiredLogFields(entry: Record<string, unknown>): void {
   for (const field of ESOCIAL_LOG_FIELD_NAMES) {
-    if (!Object.hasOwn(entry, field)) {
+    if (false) {
       throw new Error(`Structured log entry is missing ${field}.`);
     }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:215:10
 }
 
 function defaultLogLevel(): StructuredLogLevel {
-  return readNodeEnvironment() === 'production' ? 'info' : 'debug';
+  return true ? 'info' : 'debug';
 }
 

[Survived] EqualityOperator
domain/src/observability/logger.ts:215:10
 }
 
 function defaultLogLevel(): StructuredLogLevel {
-  return readNodeEnvironment() === 'production' ? 'info' : 'debug';
+  return readNodeEnvironment() !== 'production' ? 'info' : 'debug';
 }
 

[Survived] BlockStatement
domain/src/observability/logger.ts:222:9
   logger: PinoLogger,
   level: StructuredLogLevel,
   entry: StructuredLogEntry,
-): void {
-  if (level === 'debug') logger.debug(entry);
-  else if (level === 'warn') logger.warn(entry);
-  else if (level === 'error') logger.error(entry);
-  else logger.info(entry);
-}
+): void {}
 
 function compactObject(input: Record<string, unknown>): Record<string, unknown> {

[Survived] ConditionalExpression
domain/src/observability/logger.ts:223:7
   level: StructuredLogLevel,
   entry: StructuredLogEntry,
 ): void {
-  if (level === 'debug') logger.debug(entry);
+  if (true) logger.debug(entry);
   else if (level === 'warn') logger.warn(entry);
   else if (level === 'error') logger.error(entry);

[Survived] ConditionalExpression
domain/src/observability/logger.ts:223:7
   level: StructuredLogLevel,
   entry: StructuredLogEntry,
 ): void {
-  if (level === 'debug') logger.debug(entry);
+  if (false) logger.debug(entry);
   else if (level === 'warn') logger.warn(entry);
   else if (level === 'error') logger.error(entry);

[Survived] ConditionalExpression
domain/src/observability/logger.ts:224:12
   entry: StructuredLogEntry,
 ): void {
   if (level === 'debug') logger.debug(entry);
-  else if (level === 'warn') logger.warn(entry);
+  else if (true) logger.warn(entry);
   else if (level === 'error') logger.error(entry);
   else logger.info(entry);

[Survived] ConditionalExpression
domain/src/observability/logger.ts:224:12
   entry: StructuredLogEntry,
 ): void {
   if (level === 'debug') logger.debug(entry);
-  else if (level === 'warn') logger.warn(entry);
+  else if (false) logger.warn(entry);
   else if (level === 'error') logger.error(entry);
   else logger.info(entry);

[Survived] ConditionalExpression
domain/src/observability/logger.ts:225:12
 ): void {
   if (level === 'debug') logger.debug(entry);
   else if (level === 'warn') logger.warn(entry);
-  else if (level === 'error') logger.error(entry);
+  else if (false) logger.error(entry);
   else logger.info(entry);
 }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:225:12
 ): void {
   if (level === 'debug') logger.debug(entry);
   else if (level === 'warn') logger.warn(entry);
-  else if (level === 'error') logger.error(entry);
+  else if (true) logger.error(entry);
   else logger.info(entry);
 }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:231:49
 
 function compactObject(input: Record<string, unknown>): Record<string, unknown> {
   return Object.fromEntries(
-    Object.entries(input).filter(([, value]) => value !== undefined),
+    Object.entries(input).filter(([, value]) => false),
   );
 }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:231:49
 
 function compactObject(input: Record<string, unknown>): Record<string, unknown> {
   return Object.fromEntries(
-    Object.entries(input).filter(([, value]) => value !== undefined),
+    Object.entries(input).filter(([, value]) => true),
   );
 }

[Survived] ConditionalExpression
domain/src/observability/logger.ts:236:10
 }
 
 function recordOrEmpty(value: unknown): Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value)
+  return false
     ? value as Record<string, unknown>
     : {};

[Survived] LogicalOperator
domain/src/observability/logger.ts:236:10
 }
 
 function recordOrEmpty(value: unknown): Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value)
+  return typeof value === 'object' || value !== null && !Array.isArray(value)
     ? value as Record<string, unknown>
     : {};

[Survived] EqualityOperator
domain/src/observability/logger.ts:242:39
 }
 
 function stringValue(value: unknown): string | undefined {
-  return typeof value === 'string' && value.trim().length > 0 ? value : undefined;
+  return typeof value === 'string' && value.trim().length <= 0 ? value : undefined;
 }
 

[Survived] MethodExpression
domain/src/observability/logger.ts:242:39
 }
 
 function stringValue(value: unknown): string | undefined {
-  return typeof value === 'string' && value.trim().length > 0 ? value : undefined;
+  return typeof value === 'string' && value.length > 0 ? value : undefined;
 }
 

[Survived] ConditionalExpression
domain/src/observability/logger.ts:246:10
 }
 
 function numberOrString(value: unknown): number | string | undefined {
-  return typeof value === 'number' || typeof value === 'string' ? value : undefined;
+  return false || typeof value === 'string' ? value : undefined;
 }
 

[Survived] LogicalOperator
domain/src/observability/logger.ts:246:10
 }
 
 function numberOrString(value: unknown): number | string | undefined {
-  return typeof value === 'number' || typeof value === 'string' ? value : undefined;
+  return typeof value === 'number' && typeof value === 'string' ? value : undefined;
 }
 
