[Survived] MethodExpression
domain/src/observability/metrics.ts:59:22
   now?: Date | undefined;
 }>): MetricPayload {
   const context = compactObject(input.context ?? {}) as MetricContext;
-  const dimensions = [
-    'tenantId',
-    'environment',
-    'eventClass',
-    'classification',
-    'endpointName',
-  ].filter((name) => Object.hasOwn(context, name));
+  const dimensions = ['tenantId', 'environment', 'eventClass', 'classification', 'endpointName'];
 
   return redactForLog(compactObject({

[Survived] StringLiteral
domain/src/observability/metrics.ts:61:5
   const context = compactObject(input.context ?? {}) as MetricContext;
   const dimensions = [
     'tenantId',
-    'environment',
+    "",
     'eventClass',
     'classification',

[Survived] ArrowFunction
domain/src/observability/metrics.ts:65:12
     'eventClass',
     'classification',
     'endpointName',
-  ].filter((name) => Object.hasOwn(context, name));
+  ].filter(() => undefined);
 
   return redactForLog(compactObject({

[Survived] ArrowFunction
domain/src/observability/metrics.ts:91:33
 export function createMetricEmitter(options: Readonly<{
   sink?: (line: string) => void | undefined;
 }> = {}): MetricEmitter {
-  const sink = options.sink ?? ((line: string) => process.stdout.write(`${line}\n`));
+  const sink = options.sink ?? (() => undefined);
 
   return {

[Survived] StringLiteral
domain/src/observability/metrics.ts:91:72
 export function createMetricEmitter(options: Readonly<{
   sink?: (line: string) => void | undefined;
 }> = {}): MetricEmitter {
-  const sink = options.sink ?? ((line: string) => process.stdout.write(`${line}\n`));
+  const sink = options.sink ?? ((line: string) => process.stdout.write(``));
 
   return {

[Survived] BlockStatement
domain/src/observability/metrics.ts:94:48
   const sink = options.sink ?? ((line: string) => process.stdout.write(`${line}\n`));
 
   return {
-    emit: (name, value, context, unit, now) => {
-      sink(JSON.stringify(buildMetricPayload({ name, value, context, unit, now })));
-    },
+    emit: (name, value, context, unit, now) => {},
   };
 }

[Survived] BlockStatement
domain/src/observability/metrics.ts:105:76
 }
 
 export function metricNameForStatus(status: string): EsocialMetricName | undefined {
-  if (status === 'accepted' || status === 'sent' || status === 'building') {
-    return ESOCIAL_METRIC_NAMES.accepted;
-  }
+  if (status === 'accepted' || status === 'sent' || status === 'building') {}
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:105:7
 }
 
 export function metricNameForStatus(status: string): EsocialMetricName | undefined {
-  if (status === 'accepted' || status === 'sent' || status === 'building') {
+  if (true) {
     return ESOCIAL_METRIC_NAMES.accepted;
   }

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:108:7
   if (status === 'accepted' || status === 'sent' || status === 'building') {
     return ESOCIAL_METRIC_NAMES.accepted;
   }
-  if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
+  if (false) return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:108:7
   if (status === 'accepted' || status === 'sent' || status === 'building') {
     return ESOCIAL_METRIC_NAMES.accepted;
   }
-  if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
+  if (true) return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:109:7
     return ESOCIAL_METRIC_NAMES.accepted;
   }
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
-  if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
+  if (true) return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:109:7
     return ESOCIAL_METRIC_NAMES.accepted;
   }
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
-  if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
+  if (false) return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:110:7
   }
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
-  if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
+  if (false) return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:110:7
   }
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
-  if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
+  if (true) return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:111:7
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
-  if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
+  if (true) return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
   if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:111:7
   if (status === 'rejected') return ESOCIAL_METRIC_NAMES.rejected;
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
-  if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
+  if (false) return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
   if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:112:7
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
-  if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
+  if (true) return ESOCIAL_METRIC_NAMES.validationFailed;
   if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;
   return undefined;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:112:7
   if (status === 'retry') return ESOCIAL_METRIC_NAMES.retry;
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
-  if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
+  if (false) return ESOCIAL_METRIC_NAMES.validationFailed;
   if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;
   return undefined;

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:113:7
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
-  if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;
+  if (false) return ESOCIAL_METRIC_NAMES.parserFailures;
   return undefined;
 }

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:113:7
   if (status === 'dlq') return ESOCIAL_METRIC_NAMES.dlq;
   if (status === 'timeout') return ESOCIAL_METRIC_NAMES.timeout;
   if (status === 'validation_failed') return ESOCIAL_METRIC_NAMES.validationFailed;
-  if (status === 'failed') return ESOCIAL_METRIC_NAMES.parserFailures;
+  if (true) return ESOCIAL_METRIC_NAMES.parserFailures;
   return undefined;
 }

[Survived] MethodExpression
domain/src/observability/metrics.ts:118:7
 }
 
 function defaultMetricUnit(name: EsocialMetricName): MetricUnit {
-  if (name.endsWith('_days_until_expiry')) return 'None';
+  if (name.startsWith('_days_until_expiry')) return 'None';
   return name.endsWith('_ms') ? 'Milliseconds' : 'Count';
 }

[Survived] ConditionalExpression
domain/src/observability/metrics.ts:118:7
 }
 
 function defaultMetricUnit(name: EsocialMetricName): MetricUnit {
-  if (name.endsWith('_days_until_expiry')) return 'None';
+  if (true) return 'None';
   return name.endsWith('_ms') ? 'Milliseconds' : 'Count';
 }

[Survived] MethodExpression
domain/src/observability/metrics.ts:119:10
 
 function defaultMetricUnit(name: EsocialMetricName): MetricUnit {
   if (name.endsWith('_days_until_expiry')) return 'None';
-  return name.endsWith('_ms') ? 'Milliseconds' : 'Count';
+  return name.startsWith('_ms') ? 'Milliseconds' : 'Count';
 }
 

[Survived] MethodExpression
domain/src/observability/metrics.ts:124:5
 
 function compactObject(input: Record<string, unknown>): Record<string, unknown> {
   return Object.fromEntries(
-    Object.entries(input).filter(([, value]) => value !== undefined),
+    Object.entries(input),
   );
 }

[Survived] EqualityOperator
domain/src/observability/metrics.ts:124:49
 
 function compactObject(input: Record<string, unknown>): Record<string, unknown> {
   return Object.fromEntries(
-    Object.entries(input).filter(([, value]) => value !== undefined),
+    Object.entries(input).filter(([, value]) => value === undefined),
   );
 }
