[Survived] ArrowFunction
domain/src/observability/tracing.ts:45:12
   return {
     exporter,
     getFinishedSpans: () => exporter.getFinishedSpans(),
-    reset: () => exporter.reset(),
+    reset: () => undefined,
   };
 }

[Survived] ArrowFunction
domain/src/observability/tracing.ts:67:10
 
   const parentContext = propagation.extract(otelContext.active(), carrier, {
     keys: (source) => Object.keys(source),
-    get: (source, key) => source[key],
+    get: () => undefined,
   });
   const span = tracer.startSpan(input.spanName, undefined, parentContext);

[Survived] OptionalChaining
domain/src/observability/tracing.ts:74:7
     annotateSpan(span, input);
     try {
       const result = await run();
-      span?.setStatus({ code: SpanStatusCode.OK });
+      span.setStatus({ code: SpanStatusCode.OK });
       emitTraceSpan(input, startedAt, now(), startedMs, 'ok');
       return result;

[Survived] OptionalChaining
domain/src/observability/tracing.ts:79:7
       return result;
     } catch (error) {
       const errorMessage = error instanceof Error ? error.message : String(error);
-      span?.recordException(error instanceof Error ? error : new Error(errorMessage));
+      span.recordException(error instanceof Error ? error : new Error(errorMessage));
       span?.setStatus({ code: SpanStatusCode.ERROR, message: errorMessage });
       emitTraceSpan(input, startedAt, now(), startedMs, 'error', errorMessage);

[Survived] OptionalChaining
domain/src/observability/tracing.ts:80:7
     } catch (error) {
       const errorMessage = error instanceof Error ? error.message : String(error);
       span?.recordException(error instanceof Error ? error : new Error(errorMessage));
-      span?.setStatus({ code: SpanStatusCode.ERROR, message: errorMessage });
+      span.setStatus({ code: SpanStatusCode.ERROR, message: errorMessage });
       emitTraceSpan(input, startedAt, now(), startedMs, 'error', errorMessage);
       throw error;

[Survived] BlockStatement
domain/src/observability/tracing.ts:83:15
       span?.setStatus({ code: SpanStatusCode.ERROR, message: errorMessage });
       emitTraceSpan(input, startedAt, now(), startedMs, 'error', errorMessage);
       throw error;
-    } finally {
-      span?.end();
-    }
+    } finally {}
   });
 }

[Survived] OptionalChaining
domain/src/observability/tracing.ts:84:7
       emitTraceSpan(input, startedAt, now(), startedMs, 'error', errorMessage);
       throw error;
     } finally {
-      span?.end();
+      span.end();
     }
   });

[Survived] BlockStatement
domain/src/observability/tracing.ts:96:9
     spanName: string;
     context?: StructuredLogContext | undefined;
   }>,
-): void {
-  if (!span) return;
-  span.setAttribute('service.name', input.service);
-  span.setAttribute('esocial.stage', input.spanName);
-  for (const [key, value] of Object.entries(input.context ?? {})) {
-    if (value !== undefined) span.setAttribute(`esocial.${key}`, String(value));
-  }
-}
+): void {}
 
 function baggageCarrier(context: StructuredLogContext | undefined): Record<string, string> {

[Survived] StringLiteral
domain/src/observability/tracing.ts:98:21
   }>,
 ): void {
   if (!span) return;
-  span.setAttribute('service.name', input.service);
+  span.setAttribute("", input.service);
   span.setAttribute('esocial.stage', input.spanName);
   for (const [key, value] of Object.entries(input.context ?? {})) {

[Survived] BlockStatement
domain/src/observability/tracing.ts:100:67
   if (!span) return;
   span.setAttribute('service.name', input.service);
   span.setAttribute('esocial.stage', input.spanName);
-  for (const [key, value] of Object.entries(input.context ?? {})) {
-    if (value !== undefined) span.setAttribute(`esocial.${key}`, String(value));
-  }
+  for (const [key, value] of Object.entries(input.context ?? {})) {}
 }
 

[Survived] EqualityOperator
domain/src/observability/tracing.ts:101:9
   span.setAttribute('service.name', input.service);
   span.setAttribute('esocial.stage', input.spanName);
   for (const [key, value] of Object.entries(input.context ?? {})) {
-    if (value !== undefined) span.setAttribute(`esocial.${key}`, String(value));
+    if (value === undefined) span.setAttribute(`esocial.${key}`, String(value));
   }
 }

[Survived] ConditionalExpression
domain/src/observability/tracing.ts:101:9
   span.setAttribute('service.name', input.service);
   span.setAttribute('esocial.stage', input.spanName);
   for (const [key, value] of Object.entries(input.context ?? {})) {
-    if (value !== undefined) span.setAttribute(`esocial.${key}`, String(value));
+    if (true) span.setAttribute(`esocial.${key}`, String(value));
   }
 }

[Survived] StringLiteral
domain/src/observability/tracing.ts:108:9
 function baggageCarrier(context: StructuredLogContext | undefined): Record<string, string> {
   return {
     baggage: context?.correlationId
-      ? `correlationId=${encodeURIComponent(context.correlationId)}`
+      ? ``
       : '',
   };

[Survived] BlockStatement
domain/src/observability/tracing.ts:125:9
   startedMs: number,
   status: TraceSpanRecord['status'],
   errorMessage?: string,
-): void {
-  input.sink?.({
-    service: input.service,
-    spanName: input.spanName,
-    startedAt: startedAt.toISOString(),
-    endedAt: endedAt.toISOString(),
-    durationMs: Math.max(0, endedAt.getTime() - startedMs),
-    status,
-    errorMessage,
-    ...input.context,
-  });
-}
+): void {}
 

[Survived] ArithmeticOperator
domain/src/observability/tracing.ts:131:29
     spanName: input.spanName,
     startedAt: startedAt.toISOString(),
     endedAt: endedAt.toISOString(),
-    durationMs: Math.max(0, endedAt.getTime() - startedMs),
+    durationMs: Math.max(0, endedAt.getTime() + startedMs),
     status,
     errorMessage,

[Survived] MethodExpression
domain/src/observability/tracing.ts:131:17
     spanName: input.spanName,
     startedAt: startedAt.toISOString(),
     endedAt: endedAt.toISOString(),
-    durationMs: Math.max(0, endedAt.getTime() - startedMs),
+    durationMs: Math.min(0, endedAt.getTime() - startedMs),
     status,
     errorMessage,
