[Survived] BlockStatement
domain/src/transport/soap-transport.ts:160:58
     this.endpoints = options.endpoints ?? localQualificationEndpoints();
     this.wsdl = loadCommittedEnviarLoteWsdl(options.root);
     this.logger = options.logger;
-    if (!this.wsdl.includes('ServicoEnviarLoteEventos')) {
-      throw new SoapTransportGuardError(
-        'Committed eSocial SOAP WSDL fixture is missing EnviarLoteEventos binding.',
-        'SOAP_WSDL_FIXTURE_INVALID',
-      );
-    }
+    if (!this.wsdl.includes('ServicoEnviarLoteEventos')) {}
   }
 

[Survived] BooleanLiteral
domain/src/transport/soap-transport.ts:160:9
     this.endpoints = options.endpoints ?? localQualificationEndpoints();
     this.wsdl = loadCommittedEnviarLoteWsdl(options.root);
     this.logger = options.logger;
-    if (!this.wsdl.includes('ServicoEnviarLoteEventos')) {
+    if (this.wsdl.includes('ServicoEnviarLoteEventos')) {
       throw new SoapTransportGuardError(
         'Committed eSocial SOAP WSDL fixture is missing EnviarLoteEventos binding.',

[Survived] MethodExpression
domain/src/transport/soap-transport.ts:180:31
     const requestHash = sha256Hex(ctx.requestXml ?? stripSignature(signedXml));
     const signedPayloadHash = sha256Hex(signedXml);
     const soapRequest = buildSubmitSoapRequest(operation, signedXml);
-    const protocol = `LOCAL-${sha256Hex(
-      `${ctx.tenantId}:${ctx.environment}:${ctx.eventClass ?? ''}:${requestHash}`,
-    ).slice(0, 24).toUpperCase()}`;
+    const protocol = `LOCAL-${sha256Hex(`${ctx.tenantId}:${ctx.environment}:${ctx.eventClass ?? ''}:${requestHash}`).slice(0, 24).toLowerCase()}`;
     const rawResponse = buildSubmitSoapResponse(protocol, ctx.now ?? new Date());
     const result = {

[Survived] MethodExpression
domain/src/transport/soap-transport.ts:180:31
     const requestHash = sha256Hex(ctx.requestXml ?? stripSignature(signedXml));
     const signedPayloadHash = sha256Hex(signedXml);
     const soapRequest = buildSubmitSoapRequest(operation, signedXml);
-    const protocol = `LOCAL-${sha256Hex(
-      `${ctx.tenantId}:${ctx.environment}:${ctx.eventClass ?? ''}:${requestHash}`,
-    ).slice(0, 24).toUpperCase()}`;
+    const protocol = `LOCAL-${sha256Hex(`${ctx.tenantId}:${ctx.environment}:${ctx.eventClass ?? ''}:${requestHash}`).toUpperCase()}`;
     const rawResponse = buildSubmitSoapResponse(protocol, ctx.now ?? new Date());
     const result = {

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:181:45
     const signedPayloadHash = sha256Hex(signedXml);
     const soapRequest = buildSubmitSoapRequest(operation, signedXml);
     const protocol = `LOCAL-${sha256Hex(
-      `${ctx.tenantId}:${ctx.environment}:${ctx.eventClass ?? ''}:${requestHash}`,
+      `${ctx.tenantId}:${ctx.environment}:${ctx.eventClass && ''}:${requestHash}`,
     ).slice(0, 24).toUpperCase()}`;
     const rawResponse = buildSubmitSoapResponse(protocol, ctx.now ?? new Date());

[Survived] ArithmeticOperator
domain/src/transport/soap-transport.ts:195:18
       responseHash: sha256Hex(rawResponse),
       rawResponse,
       rawRequest: soapRequest,
-      latencyMs: Date.now() - started,
+      latencyMs: Date.now() + started,
     } satisfies SoapResult;
     this.log('submit', ctx, result);

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:197:14
       rawRequest: soapRequest,
       latencyMs: Date.now() - started,
     } satisfies SoapResult;
-    this.log('submit', ctx, result);
+    this.log("", ctx, result);
     return result;
   }

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:224:78
     return result;
   }
 
-  private log(operation: string, ctx: SoapContext, result: SoapResult): void {
-    this.logger?.info('esocial.soap.sandbox.exchange', {
-      operation,
-      tenant_id: ctx.tenantId,
-      environment: ctx.environment,
-      event_class: ctx.eventClass,
-      request_hash: result.requestHash,
-      signed_payload_hash: result.signedPayloadHash,
-      soap_request_hash: result.soapRequestHash,
-      response_hash: result.responseHash,
-      protocol: result.protocol,
-      latency_ms: result.latencyMs,
-    });
-  }
+  private log(operation: string, ctx: SoapContext, result: SoapResult): void {}
 }
 

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:225:23
   }
 
   private log(operation: string, ctx: SoapContext, result: SoapResult): void {
-    this.logger?.info('esocial.soap.sandbox.exchange', {
+    this.logger?.info("", {
       operation,
       tenant_id: ctx.tenantId,

[Survived] BooleanLiteral
domain/src/transport/soap-transport.ts:259:21
     this.certificatePinning = options.certificatePinning;
 
     assertSoapEndpointAllowed(this.endpoints.submit, {
-      requireHttps: true,
+      requireHttps: false,
       allowlistHosts: this.allowlistHosts,
     });

[Survived] ObjectLiteral
domain/src/transport/soap-transport.ts:262:59
       requireHttps: true,
       allowlistHosts: this.allowlistHosts,
     });
-    assertSoapEndpointAllowed(this.endpoints.returnQuery, {
-      requireHttps: true,
-      allowlistHosts: this.allowlistHosts,
-    });
+    assertSoapEndpointAllowed(this.endpoints.returnQuery, {});
   }
 

[Survived] BooleanLiteral
domain/src/transport/soap-transport.ts:263:21
       allowlistHosts: this.allowlistHosts,
     });
     assertSoapEndpointAllowed(this.endpoints.returnQuery, {
-      requireHttps: true,
+      requireHttps: false,
       allowlistHosts: this.allowlistHosts,
     });

[Survived] BooleanLiteral
domain/src/transport/soap-transport.ts:304:21
     protocol?: string | undefined;
   }>): Promise<SoapResult> {
     assertSoapEndpointAllowed(input.endpointUrl, {
-      requireHttps: true,
+      requireHttps: false,
       allowlistHosts: this.allowlistHosts,
     });

[Survived] ArrowFunction
domain/src/transport/soap-transport.ts:315:32
 
     const started = Date.now();
     const controller = new AbortController();
-    const timeout = setTimeout(() => controller.abort(), this.timeoutMs);
+    const timeout = setTimeout(() => undefined, this.timeoutMs);
     try {
       const response = await this.fetch(input.endpointUrl, {

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:334:19
         httpStatus: response.status,
         soapStatus: classifySoapStatus(response.status, rawResponse),
         endpointUrl: input.endpointUrl,
-        protocol: input.protocol ?? protocolFromResponse(rawResponse),
+        protocol: input.protocol && protocolFromResponse(rawResponse),
         requestHash: input.requestHash,
         signedPayloadHash: input.signedPayloadHash,

[Survived] ArithmeticOperator
domain/src/transport/soap-transport.ts:341:20
         responseHash: sha256Hex(rawResponse),
         rawResponse,
         rawRequest: input.soapRequest,
-        latencyMs: Date.now() - started,
+        latencyMs: Date.now() + started,
       } satisfies SoapResult;
       this.log(input.ctx, result);

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:345:15
       } satisfies SoapResult;
       this.log(input.ctx, result);
       return result;
-    } finally {
-      clearTimeout(timeout);
-    }
+    } finally {}
   }
 

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:350:59
     }
   }
 
-  private log(ctx: SoapContext, result: SoapResult): void {
-    this.logger?.info('esocial.soap.client.exchange', {
-      tenant_id: ctx.tenantId,
-      environment: ctx.environment,
-      event_class: ctx.eventClass,
-      http_status: result.httpStatus,
-      soap_status: result.soapStatus,
-      request_hash: result.requestHash,
-      signed_payload_hash: result.signedPayloadHash,
-      soap_request_hash: result.soapRequestHash,
-      response_hash: result.responseHash,
-      latency_ms: result.latencyMs,
-    });
-  }
+  private log(ctx: SoapContext, result: SoapResult): void {}
 }
 

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:372:19
 ): SoapTransport {
   const normalized = normalizeSoapEnvironment(environment);
   const runtimeConfig = loadConfig();
-  const nodeEnv = options.nodeEnv ?? runtimeConfig.nodeEnv;
+  const nodeEnv = options.nodeEnv && runtimeConfig.nodeEnv;
   const ci = options.ci ?? runtimeConfig.ci;
   const mode = options.mode ?? 'auto';

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:373:14
   const normalized = normalizeSoapEnvironment(environment);
   const runtimeConfig = loadConfig();
   const nodeEnv = options.nodeEnv ?? runtimeConfig.nodeEnv;
-  const ci = options.ci ?? runtimeConfig.ci;
+  const ci = options.ci && runtimeConfig.ci;
   const mode = options.mode ?? 'auto';
   if (mode === 'sandbox' && normalized !== 'qualification') {

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:375:29
   const nodeEnv = options.nodeEnv ?? runtimeConfig.nodeEnv;
   const ci = options.ci ?? runtimeConfig.ci;
   const mode = options.mode ?? 'auto';
-  if (mode === 'sandbox' && normalized !== 'qualification') {
+  if (mode === 'sandbox' && normalized === 'qualification') {
     throw new SoapTransportGuardError(
       'Deterministic SOAP sandbox is only allowed for qualification.',

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:375:61
   const nodeEnv = options.nodeEnv ?? runtimeConfig.nodeEnv;
   const ci = options.ci ?? runtimeConfig.ci;
   const mode = options.mode ?? 'auto';
-  if (mode === 'sandbox' && normalized !== 'qualification') {
-    throw new SoapTransportGuardError(
-      'Deterministic SOAP sandbox is only allowed for qualification.',
-      'SOAP_SANDBOX_ENVIRONMENT_FORBIDDEN',
-    );
-  }
+  if (mode === 'sandbox' && normalized !== 'qualification') {}
   const useSandbox =
     normalized === 'qualification' &&

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:382:5
     );
   }
   const useSandbox =
-    normalized === 'qualification' &&
-    (mode === 'sandbox' ||
-    (mode === 'auto' &&
-      normalized === 'qualification' &&
-      (nodeEnv === 'test' || ci)));
+    true;
 
   if (useSandbox) {

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:382:5
     );
   }
   const useSandbox =
-    normalized === 'qualification' &&
+    true &&
     (mode === 'sandbox' ||
     (mode === 'auto' &&

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:383:6
   }
   const useSandbox =
     normalized === 'qualification' &&
-    (mode === 'sandbox' ||
+    (false ||
     (mode === 'auto' &&
       normalized === 'qualification' &&

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:383:6
   }
   const useSandbox =
     normalized === 'qualification' &&
-    (mode === 'sandbox' ||
-    (mode === 'auto' &&
-      normalized === 'qualification' &&
-      (nodeEnv === 'test' || ci)));
+    (true);
 
   if (useSandbox) {

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:384:6
   const useSandbox =
     normalized === 'qualification' &&
     (mode === 'sandbox' ||
-    (mode === 'auto' &&
-      normalized === 'qualification' &&
+    (mode === 'auto' || normalized === 'qualification' &&
       (nodeEnv === 'test' || ci)));
 

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:384:6
   const useSandbox =
     normalized === 'qualification' &&
     (mode === 'sandbox' ||
-    (mode === 'auto' &&
+    (mode !== 'auto' &&
       normalized === 'qualification' &&
       (nodeEnv === 'test' || ci)));

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:385:7
     normalized === 'qualification' &&
     (mode === 'sandbox' ||
     (mode === 'auto' &&
-      normalized === 'qualification' &&
+      true &&
       (nodeEnv === 'test' || ci)));
 

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:385:7
     normalized === 'qualification' &&
     (mode === 'sandbox' ||
     (mode === 'auto' &&
-      normalized === 'qualification' &&
+      normalized !== 'qualification' &&
       (nodeEnv === 'test' || ci)));
 

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:386:8
     (mode === 'sandbox' ||
     (mode === 'auto' &&
       normalized === 'qualification' &&
-      (nodeEnv === 'test' || ci)));
+      (true)));
 
   if (useSandbox) {

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:386:8
     (mode === 'sandbox' ||
     (mode === 'auto' &&
       normalized === 'qualification' &&
-      (nodeEnv === 'test' || ci)));
+      (nodeEnv === 'test' && ci)));
 
   if (useSandbox) {

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:388:7
       normalized === 'qualification' &&
       (nodeEnv === 'test' || ci)));
 
-  if (useSandbox) {
+  if (true) {
     return new DeterministicSandboxTransport({
       endpoints: resolveEsocialSoapEndpoints('qualification', {

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:388:7
       normalized === 'qualification' &&
       (nodeEnv === 'test' || ci)));
 
-  if (useSandbox) {
+  if (false) {
     return new DeterministicSandboxTransport({
       endpoints: resolveEsocialSoapEndpoints('qualification', {

[Survived] ObjectLiteral
domain/src/transport/soap-transport.ts:398:61
     });
   }
 
-  const endpoints = resolveEsocialSoapEndpoints(normalized, {
-    config: options.config,
-    nodeEnv,
-  });
+  const endpoints = resolveEsocialSoapEndpoints(normalized, {});
 
   return new SoapClientTransport({

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:418:19
   options: ResolveSoapEndpointOptions = {},
 ): SoapEndpointSet {
   const normalized = normalizeSoapEnvironment(environment);
-  const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
+  const nodeEnv = options.nodeEnv && readNodeEnvironment();
   if (normalized === 'production' && nodeEnv !== 'production') {
     throw new SoapTransportGuardError(

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:419:7
 ): SoapEndpointSet {
   const normalized = normalizeSoapEnvironment(environment);
   const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
-  if (normalized === 'production' && nodeEnv !== 'production') {
+  if (normalized !== 'production' && nodeEnv !== 'production') {
     throw new SoapTransportGuardError(
       'Production eSocial SOAP endpoints cannot be resolved outside production.',

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:419:7
 ): SoapEndpointSet {
   const normalized = normalizeSoapEnvironment(environment);
   const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
-  if (normalized === 'production' && nodeEnv !== 'production') {
+  if (normalized === 'production' || nodeEnv !== 'production') {
     throw new SoapTransportGuardError(
       'Production eSocial SOAP endpoints cannot be resolved outside production.',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:422:7
   if (normalized === 'production' && nodeEnv !== 'production') {
     throw new SoapTransportGuardError(
       'Production eSocial SOAP endpoints cannot be resolved outside production.',
-      'SOAP_PRODUCTION_ENDPOINT_FORBIDDEN_IN_TEST',
+      "",
     );
   }

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:426:22
     );
   }
 
-  const configured = options.config?.[normalized] ?? endpointFromEnv(normalized);
+  const configured = options.config?.[normalized] && endpointFromEnv(normalized);
   if (configured) {
     assertEndpointSetConfigured(normalized, configured);

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:427:19
   }
 
   const configured = options.config?.[normalized] ?? endpointFromEnv(normalized);
-  if (configured) {
-    assertEndpointSetConfigured(normalized, configured);
-    return configured;
-  }
+  if (configured) {}
 
   if (normalized !== 'qualification') {

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:432:7
     return configured;
   }
 
-  if (normalized !== 'qualification') {
+  if (false) {
     throw new SoapTransportGuardError(
       `${normalized} eSocial SOAP endpoints must be supplied by environment/config.`,

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:432:7
     return configured;
   }
 
-  if (normalized !== 'qualification') {
+  if (true) {
     throw new SoapTransportGuardError(
       `${normalized} eSocial SOAP endpoints must be supplied by environment/config.`,

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:434:7
 
   if (normalized !== 'qualification') {
     throw new SoapTransportGuardError(
-      `${normalized} eSocial SOAP endpoints must be supplied by environment/config.`,
+      ``,
       'SOAP_ENDPOINT_REQUIRED',
     );

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:446:19
   endpointUrl: string,
   options: SoapEndpointGuardOptions = {},
 ): void {
-  const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
+  const nodeEnv = options.nodeEnv && readNodeEnvironment();
   const parsed = new URL(endpointUrl);
 

[Survived] LogicalOperator
domain/src/transport/soap-transport.ts:449:7
   const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
   const parsed = new URL(endpointUrl);
 
-  if (options.requireHttps && parsed.protocol !== 'https:') {
+  if (options.requireHttps || parsed.protocol !== 'https:') {
     throw new SoapTransportGuardError(
       'Non-qualification eSocial SOAP endpoints must use https.',

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:449:31
   const nodeEnv = options.nodeEnv ?? readNodeEnvironment();
   const parsed = new URL(endpointUrl);
 
-  if (options.requireHttps && parsed.protocol !== 'https:') {
+  if (options.requireHttps && true) {
     throw new SoapTransportGuardError(
       'Non-qualification eSocial SOAP endpoints must use https.',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:451:7
 
   if (options.requireHttps && parsed.protocol !== 'https:') {
     throw new SoapTransportGuardError(
-      'Non-qualification eSocial SOAP endpoints must use https.',
+      "",
       'SOAP_ENDPOINT_HTTPS_REQUIRED',
     );

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:455:7
       'SOAP_ENDPOINT_HTTPS_REQUIRED',
     );
   }
-  if (nodeEnv === 'production') return;
+  if (false) return;
 
   const forbiddenHost = ['gov', 'br'].join('.');

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:455:7
       'SOAP_ENDPOINT_HTTPS_REQUIRED',
     );
   }
-  if (nodeEnv === 'production') return;
+  if (nodeEnv !== 'production') return;
 
   const forbiddenHost = ['gov', 'br'].join('.');

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:457:33
   }
   if (nodeEnv === 'production') return;
 
-  const forbiddenHost = ['gov', 'br'].join('.');
+  const forbiddenHost = ['gov', ""].join('.');
   const host = parsed.hostname.toLowerCase();
   if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:457:26
   }
   if (nodeEnv === 'production') return;
 
-  const forbiddenHost = ['gov', 'br'].join('.');
+  const forbiddenHost = ["", 'br'].join('.');
   const host = parsed.hostname.toLowerCase();
   if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {

[Survived] MethodExpression
domain/src/transport/soap-transport.ts:458:16
   if (nodeEnv === 'production') return;
 
   const forbiddenHost = ['gov', 'br'].join('.');
-  const host = parsed.hostname.toLowerCase();
+  const host = parsed.hostname.toUpperCase();
   if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
     throw new SoapTransportGuardError(

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:459:7
 
   const forbiddenHost = ['gov', 'br'].join('.');
   const host = parsed.hostname.toLowerCase();
-  if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
+  if (host !== forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
     throw new SoapTransportGuardError(
       'Test/dev SOAP transports cannot reach official endpoint hosts.',

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:459:7
 
   const forbiddenHost = ['gov', 'br'].join('.');
   const host = parsed.hostname.toLowerCase();
-  if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
+  if (true) {
     throw new SoapTransportGuardError(
       'Test/dev SOAP transports cannot reach official endpoint hosts.',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:462:7
   if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
     throw new SoapTransportGuardError(
       'Test/dev SOAP transports cannot reach official endpoint hosts.',
-      'SOAP_GOV_BR_FORBIDDEN_IN_TEST',
+      "",
     );
   }

[Survived] MethodExpression
domain/src/transport/soap-transport.ts:467:51
   }
 
   const allowlist = new Set(
-    (options.allowlistHosts ?? []).map((value) => value.toLowerCase()),
+    (options.allowlistHosts ?? []).map((value) => value.toUpperCase()),
   );
   if (allowlist.has(host)) return;

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:469:7
   const allowlist = new Set(
     (options.allowlistHosts ?? []).map((value) => value.toLowerCase()),
   );
-  if (allowlist.has(host)) return;
+  if (false) return;
 
   throw new SoapTransportGuardError(

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:469:7
   const allowlist = new Set(
     (options.allowlistHosts ?? []).map((value) => value.toLowerCase()),
   );
-  if (allowlist.has(host)) return;
+  if (true) return;
 
   throw new SoapTransportGuardError(

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:472:5
   if (allowlist.has(host)) return;
 
   throw new SoapTransportGuardError(
-    `Test/dev SOAP endpoint host is not allowlisted: ${host}.`,
+    ``,
     'SOAP_ENDPOINT_NOT_ALLOWLISTED',
   );

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:477:76
   );
 }
 
-export function assertNonProductionEndpointSafe(endpointUrl: string): void {
-  const parsed = new URL(endpointUrl);
-  const forbiddenHost = ['gov', 'br'].join('.');
-  const host = parsed.hostname.toLowerCase();
-  if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
-    throw new SoapTransportGuardError(
-      'Deterministic SOAP transport cannot be pointed at official endpoint hosts.',
-      'SOAP_GOV_BR_FORBIDDEN_IN_TEST',
-    );
-  }
-}
+export function assertNonProductionEndpointSafe(endpointUrl: string): void {}
 
 export function loadCommittedEnviarLoteWsdl(root = process.cwd()): string {

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:479:26
 
 export function assertNonProductionEndpointSafe(endpointUrl: string): void {
   const parsed = new URL(endpointUrl);
-  const forbiddenHost = ['gov', 'br'].join('.');
+  const forbiddenHost = ["", 'br'].join('.');
   const host = parsed.hostname.toLowerCase();
   if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:481:69
   const parsed = new URL(endpointUrl);
   const forbiddenHost = ['gov', 'br'].join('.');
   const host = parsed.hostname.toLowerCase();
-  if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {
-    throw new SoapTransportGuardError(
-      'Deterministic SOAP transport cannot be pointed at official endpoint hosts.',
-      'SOAP_GOV_BR_FORBIDDEN_IN_TEST',
-    );
-  }
+  if (host === forbiddenHost || host.endsWith(`.${forbiddenHost}`)) {}
 }
 

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:491:16
 
 export function loadCommittedEnviarLoteWsdl(root = process.cwd()): string {
   return readFileSync(
-    join(root, 'docs/templates/wsdl/ws-enviar-lote-eventos.wsdl'),
+    join(root, ""),
     'utf8',
   );

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:511:9
 function assertEndpointSetConfigured(
   environment: SoapEnvironment,
   endpoints: SoapEndpointSet,
-): void {
-  assertSoapEndpointAllowed(endpoints.submit, {
-    nodeEnv: 'production',
-    requireHttps: true,
-  });
-  assertSoapEndpointAllowed(endpoints.returnQuery, {
-    nodeEnv: 'production',
-    requireHttps: true,
-  });
-}
+): void {}
 
 function buildTlsPolicy(

[Survived] ObjectLiteral
domain/src/transport/soap-transport.ts:512:47
   environment: SoapEnvironment,
   endpoints: SoapEndpointSet,
 ): void {
-  assertSoapEndpointAllowed(endpoints.submit, {
-    nodeEnv: 'production',
-    requireHttps: true,
-  });
+  assertSoapEndpointAllowed(endpoints.submit, {});
   assertSoapEndpointAllowed(endpoints.returnQuery, {
     nodeEnv: 'production',

[Survived] BooleanLiteral
domain/src/transport/soap-transport.ts:514:19
 ): void {
   assertSoapEndpointAllowed(endpoints.submit, {
     nodeEnv: 'production',
-    requireHttps: true,
+    requireHttps: false,
   });
   assertSoapEndpointAllowed(endpoints.returnQuery, {

[Survived] ObjectLiteral
domain/src/transport/soap-transport.ts:516:52
     nodeEnv: 'production',
     requireHttps: true,
   });
-  assertSoapEndpointAllowed(endpoints.returnQuery, {
-    nodeEnv: 'production',
-    requireHttps: true,
-  });
+  assertSoapEndpointAllowed(endpoints.returnQuery, {});
 }
 

[Survived] BlockStatement
domain/src/transport/soap-transport.ts:524:14
 
 function buildTlsPolicy(
   certificatePinning: CertificatePinningVerifier | undefined,
-): TlsPolicy {
-  return {
-    rejectUnauthorized: true,
-    minVersion: 'TLSv1.2',
-    certificatePinning: certificatePinning ? 'configured' : 'not-configured',
-  };
-}
+): TlsPolicy {}
 
 function localQualificationEndpoints(): SoapEndpointSet {

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:543:7
   const candidate = (globalThis as typeof globalThis & {
     fetch?: FetchLike | undefined;
   }).fetch;
-  if (!candidate) {
+  if (false) {
     throw new SoapTransportGuardError(
       'Global fetch is required for SoapClientTransport.',

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:543:7
   const candidate = (globalThis as typeof globalThis & {
     fetch?: FetchLike | undefined;
   }).fetch;
-  if (!candidate) {
+  if (true) {
     throw new SoapTransportGuardError(
       'Global fetch is required for SoapClientTransport.',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:545:7
   }).fetch;
   if (!candidate) {
     throw new SoapTransportGuardError(
-      'Global fetch is required for SoapClientTransport.',
+      "",
       'SOAP_FETCH_UNAVAILABLE',
     );

[Survived] ArrayDeclaration
domain/src/transport/soap-transport.ts:556:10
   _operation: SoapSubmitOperation,
   signedXml: string,
 ): string {
-  return [
-    '<?xml version="1.0" encoding="UTF-8"?>',
-    '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esoc="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0">',
-    '<soap:Header/>',
-    '<soap:Body>',
-    '<esoc:EnviarLoteEventos>',
-    '<esoc:loteEventos>',
-    signedXml,
-    '</esoc:loteEventos>',
-    '</esoc:EnviarLoteEventos>',
-    '</soap:Body>',
-    '</soap:Envelope>',
-  ].join('');
+  return [].join('');
 }
 

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:558:5
 ): string {
   return [
     '<?xml version="1.0" encoding="UTF-8"?>',
-    '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esoc="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0">',
+    "",
     '<soap:Header/>',
     '<soap:Body>',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:567:5
     '</esoc:loteEventos>',
     '</esoc:EnviarLoteEventos>',
     '</soap:Body>',
-    '</soap:Envelope>',
+    "",
   ].join('');
 }

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:580:5
     '<EnviarLoteEventosResult>',
     `<retornoEnvioLoteEventos><status>201</status><protocoloEnvio>${xmlEscape(protocol)}</protocoloEnvio><receivedAt>${now.toISOString()}</receivedAt></retornoEnvioLoteEventos>`,
     '</EnviarLoteEventosResult>',
-    '</EnviarLoteEventosResponse>',
+    "",
     '</soap:Body>',
     '</soap:Envelope>',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:581:5
     `<retornoEnvioLoteEventos><status>201</status><protocoloEnvio>${xmlEscape(protocol)}</protocoloEnvio><receivedAt>${now.toISOString()}</receivedAt></retornoEnvioLoteEventos>`,
     '</EnviarLoteEventosResult>',
     '</EnviarLoteEventosResponse>',
-    '</soap:Body>',
+    "",
     '</soap:Envelope>',
   ].join('');

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:583:10
     '</EnviarLoteEventosResponse>',
     '</soap:Body>',
     '</soap:Envelope>',
-  ].join('');
+  ].join("Stryker was here!");
 }
 

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:591:5
     '<?xml version="1.0" encoding="UTF-8"?>',
     '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">',
     '<soap:Header/>',
-    '<soap:Body>',
+    "",
     `<ConsultarRetornoEventos><protocoloEnvio>${xmlEscape(protocol)}</protocoloEnvio></ConsultarRetornoEventos>`,
     '</soap:Body>',

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:592:5
     '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">',
     '<soap:Header/>',
     '<soap:Body>',
-    `<ConsultarRetornoEventos><protocoloEnvio>${xmlEscape(protocol)}</protocoloEnvio></ConsultarRetornoEventos>`,
+    ``,
     '</soap:Body>',
     '</soap:Envelope>',

[Survived] Regex
domain/src/transport/soap-transport.ts:610:22
 }
 
 function stripSignature(xml: string): string {
-  return xml.replace(/<(?:(?:\w+):)?Signature\b[\s\S]*?<\/(?:(?:\w+):)?Signature>/u, '');
+  return xml.replace(/<(?:(?:\w+):)?Signature\b[\s\S]*?<\/(?:(?:\w+):)Signature>/u, '');
 }
 
