[Survived] StringLiteral
domain/src/transport/soap-transport.ts:610:86
 }
 
 function stripSignature(xml: string): string {
-  return xml.replace(/<(?:(?:\w+):)?Signature\b[\s\S]*?<\/(?:(?:\w+):)?Signature>/u, '');
+  return xml.replace(/<(?:(?:\w+):)?Signature\b[\s\S]*?<\/(?:(?:\w+):)?Signature>/u, "Stryker was here!");
 }
 

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:614:7
 }
 
 function classifySoapStatus(httpStatus: number, response: string): SoapStatus {
-  if (/<(?:\w+:)?Fault\b/u.test(response)) {
+  if (true) {
     return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
   }

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:614:7
 }
 
 function classifySoapStatus(httpStatus: number, response: string): SoapStatus {
-  if (/<(?:\w+:)?Fault\b/u.test(response)) {
+  if (false) {
     return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
   }

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:615:12
 
 function classifySoapStatus(httpStatus: number, response: string): SoapStatus {
   if (/<(?:\w+:)?Fault\b/u.test(response)) {
-    return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
+    return true ? 'retryable_fault' : 'terminal_fault';
   }
   return httpStatus >= 500 ? 'retryable_fault' : 'accepted';

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:615:12
 
 function classifySoapStatus(httpStatus: number, response: string): SoapStatus {
   if (/<(?:\w+:)?Fault\b/u.test(response)) {
-    return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
+    return httpStatus < 500 ? 'retryable_fault' : 'terminal_fault';
   }
   return httpStatus >= 500 ? 'retryable_fault' : 'accepted';

[Survived] EqualityOperator
domain/src/transport/soap-transport.ts:617:10
   if (/<(?:\w+:)?Fault\b/u.test(response)) {
     return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
   }
-  return httpStatus >= 500 ? 'retryable_fault' : 'accepted';
+  return httpStatus < 500 ? 'retryable_fault' : 'accepted';
 }
 

[Survived] ConditionalExpression
domain/src/transport/soap-transport.ts:617:10
   if (/<(?:\w+:)?Fault\b/u.test(response)) {
     return httpStatus >= 500 ? 'retryable_fault' : 'terminal_fault';
   }
-  return httpStatus >= 500 ? 'retryable_fault' : 'accepted';
+  return false ? 'retryable_fault' : 'accepted';
 }
 

[Survived] StringLiteral
domain/src/transport/soap-transport.ts:630:17
     .replaceAll('<', '&lt;')
     .replaceAll('>', '&gt;')
     .replaceAll('"', '&quot;')
-    .replaceAll("'", '&apos;');
+    .replaceAll("", '&apos;');
 }
 
