[Survived] Regex
domain/src/builders/common.ts:108:14
   sourceId: string,
 ): string {
   const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`)
-    .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
+    .replace(/[^a-f]/g, (char) => String(char.charCodeAt(0) - 97))
     .slice(0, 34);
   return `ID${digits}`;

[Survived] StringLiteral
domain/src/builders/common.ts:110:10
   const digits = sha256(`${eventClass}:${tenantId}:${sourceId}`)
     .replace(/[a-f]/g, (char) => String(char.charCodeAt(0) - 97))
     .slice(0, 34);
-  return `ID${digits}`;
+  return ``;
 }
 

[Survived] BlockStatement
domain/src/builders/common.ts:129:9
 export function validateRequired(
   input: Record<string, unknown>,
   fieldPaths: readonly string[],
-): void {
-  const missing = fieldPaths.filter((path) => isMissing(readPath(input, path)));
-  if (missing.length > 0) throw new DtoValidationError(missing);
-}
+): void {}
 
 export function nonEmptyString(value: unknown): value is string {

[Survived] MethodExpression
domain/src/builders/common.ts:130:19
   input: Record<string, unknown>,
   fieldPaths: readonly string[],
 ): void {
-  const missing = fieldPaths.filter((path) => isMissing(readPath(input, path)));
+  const missing = fieldPaths;
   if (missing.length > 0) throw new DtoValidationError(missing);
 }

[Survived] ArrowFunction
domain/src/builders/common.ts:130:37
   input: Record<string, unknown>,
   fieldPaths: readonly string[],
 ): void {
-  const missing = fieldPaths.filter((path) => isMissing(readPath(input, path)));
+  const missing = fieldPaths.filter(() => undefined);
   if (missing.length > 0) throw new DtoValidationError(missing);
 }

[Survived] EqualityOperator
domain/src/builders/common.ts:131:7
   fieldPaths: readonly string[],
 ): void {
   const missing = fieldPaths.filter((path) => isMissing(readPath(input, path)));
-  if (missing.length > 0) throw new DtoValidationError(missing);
+  if (missing.length >= 0) throw new DtoValidationError(missing);
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:131:7
   fieldPaths: readonly string[],
 ): void {
   const missing = fieldPaths.filter((path) => isMissing(readPath(input, path)));
-  if (missing.length > 0) throw new DtoValidationError(missing);
+  if (false) throw new DtoValidationError(missing);
 }
 

[Survived] MethodExpression
domain/src/builders/common.ts:135:39
 }
 
 export function nonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.trim().length > 0;
+  return typeof value === 'string' && value.length > 0;
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:135:10
 }
 
 export function nonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.trim().length > 0;
+  return true;
 }
 

[Survived] EqualityOperator
domain/src/builders/common.ts:142:31
   value: readonly T[] | undefined,
   fieldPath: string,
 ): readonly T[] {
-  if (Array.isArray(value) && value.length > 0) return value;
+  if (Array.isArray(value) && value.length >= 0) return value;
   throw new DtoValidationError([fieldPath]);
 }

[Survived] ConditionalExpression
domain/src/builders/common.ts:142:31
   value: readonly T[] | undefined,
   fieldPath: string,
 ): readonly T[] {
-  if (Array.isArray(value) && value.length > 0) return value;
+  if (Array.isArray(value) && true) return value;
   throw new DtoValidationError([fieldPath]);
 }

[Survived] ArrayDeclaration
domain/src/builders/common.ts:143:32
   fieldPath: string,
 ): readonly T[] {
   if (Array.isArray(value) && value.length > 0) return value;
-  throw new DtoValidationError([fieldPath]);
+  throw new DtoValidationError([]);
 }
 

[Survived] BlockStatement
domain/src/builders/common.ts:149:9
 export function requireEmptyArray<T>(
   value: readonly T[] | undefined,
   fieldPath: string,
-): void {
-  if (Array.isArray(value) && value.length === 0) return;
-  throw new DtoValidationError([fieldPath]);
-}
+): void {}
 
 export function readPath(

[Survived] ConditionalExpression
domain/src/builders/common.ts:150:7
   value: readonly T[] | undefined,
   fieldPath: string,
 ): void {
-  if (Array.isArray(value) && value.length === 0) return;
+  if (true) return;
   throw new DtoValidationError([fieldPath]);
 }

[Survived] ConditionalExpression
domain/src/builders/common.ts:150:7
   value: readonly T[] | undefined,
   fieldPath: string,
 ): void {
-  if (Array.isArray(value) && value.length === 0) return;
+  if (false) return;
   throw new DtoValidationError([fieldPath]);
 }

[Survived] ArrayDeclaration
domain/src/builders/common.ts:151:32
   fieldPath: string,
 ): void {
   if (Array.isArray(value) && value.length === 0) return;
-  throw new DtoValidationError([fieldPath]);
+  throw new DtoValidationError([]);
 }
 

[Survived] BlockStatement
domain/src/builders/common.ts:158:64
   input: Record<string, unknown>,
   path: string,
 ): unknown {
-  return path.split('.').reduce<unknown>((current, segment) => {
-    if (current && typeof current === 'object' && segment in current) {
-      return (current as Record<string, unknown>)[segment];
-    }
-    return undefined;
-  }, input);
+  return path.split('.').reduce<unknown>((current, segment) => {}, input);
 }
 

[Survived] BlockStatement
domain/src/builders/common.ts:159:71
   path: string,
 ): unknown {
   return path.split('.').reduce<unknown>((current, segment) => {
-    if (current && typeof current === 'object' && segment in current) {
-      return (current as Record<string, unknown>)[segment];
-    }
+    if (current && typeof current === 'object' && segment in current) {}
     return undefined;
   }, input);

[Survived] ConditionalExpression
domain/src/builders/common.ts:159:9
   path: string,
 ): unknown {
   return path.split('.').reduce<unknown>((current, segment) => {
-    if (current && typeof current === 'object' && segment in current) {
+    if (true) {
       return (current as Record<string, unknown>)[segment];
     }

[Survived] ConditionalExpression
domain/src/builders/common.ts:174:7
   }> = {},
 ): string {
   const pieces: string[] = [];
-  if (options.includeRetification) pieces.push('<indRetif>1</indRetif>');
+  if (false) pieces.push('<indRetif>1</indRetif>');
   if (options.includePeriod) {
     pieces.push('<indApuracao>1</indApuracao>');

[Survived] ConditionalExpression
domain/src/builders/common.ts:174:7
   }> = {},
 ): string {
   const pieces: string[] = [];
-  if (options.includeRetification) pieces.push('<indRetif>1</indRetif>');
+  if (true) pieces.push('<indRetif>1</indRetif>');
   if (options.includePeriod) {
     pieces.push('<indApuracao>1</indApuracao>');

[Survived] BlockStatement
domain/src/builders/common.ts:175:30
 ): string {
   const pieces: string[] = [];
   if (options.includeRetification) pieces.push('<indRetif>1</indRetif>');
-  if (options.includePeriod) {
-    pieces.push('<indApuracao>1</indApuracao>');
-    pieces.push(`<perApur>${xmlEscape(options.includePeriod)}</perApur>`);
-  }
+  if (options.includePeriod) {}
   pieces.push(`<tpAmb>${environmentCode(ctx.environment)}</tpAmb>`);
   pieces.push('<procEmi>1</procEmi>');

[Survived] StringLiteral
domain/src/builders/common.ts:182:5
   pieces.push(`<tpAmb>${environmentCode(ctx.environment)}</tpAmb>`);
   pieces.push('<procEmi>1</procEmi>');
   pieces.push(
-    `<verProc>${xmlEscape(ctx.processVersion ?? DEFAULT_PROCESS_VERSION)}</verProc>`,
+    ``,
   );
   return `<ideEvento>${pieces.join('')}</ideEvento>`;

[Survived] StringLiteral
domain/src/builders/common.ts:184:10
   pieces.push(
     `<verProc>${xmlEscape(ctx.processVersion ?? DEFAULT_PROCESS_VERSION)}</verProc>`,
   );
-  return `<ideEvento>${pieces.join('')}</ideEvento>`;
+  return ``;
 }
 

[Survived] StringLiteral
domain/src/builders/common.ts:184:36
   pieces.push(
     `<verProc>${xmlEscape(ctx.processVersion ?? DEFAULT_PROCESS_VERSION)}</verProc>`,
   );
-  return `<ideEvento>${pieces.join('')}</ideEvento>`;
+  return `<ideEvento>${pieces.join("Stryker was here!")}</ideEvento>`;
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:195:11
 
 export function employerRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(8, '0');
+  return (true ? digits.slice(0, 8) : '12345678').padStart(8, '0');
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:195:11
 
 export function employerRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 8 ? digits.slice(0, 8) : '12345678').padStart(8, '0');
+  return (false ? digits.slice(0, 8) : '12345678').padStart(8, '0');
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:200:11
 
 export function fullRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 14 ? digits.slice(0, 14) : '12345678000199').padStart(
+  return (false ? digits.slice(0, 14) : '12345678000199').padStart(
     14,
     '0',

[Survived] EqualityOperator
domain/src/builders/common.ts:200:11
 
 export function fullRegistration(value: string): string {
   const digits = onlyDigits(value);
-  return (digits.length >= 14 ? digits.slice(0, 14) : '12345678000199').padStart(
+  return (digits.length < 14 ? digits.slice(0, 14) : '12345678000199').padStart(
     14,
     '0',

[Survived] StringLiteral
domain/src/builders/common.ts:202:5
   const digits = onlyDigits(value);
   return (digits.length >= 14 ? digits.slice(0, 14) : '12345678000199').padStart(
     14,
-    '0',
+    "",
   );
 }

[Survived] MethodExpression
domain/src/builders/common.ts:207:10
 }
 
 export function cpf(value: string): string {
-  return onlyDigits(value).padStart(11, '0').slice(0, 11);
+  return onlyDigits(value).padStart(11, '0');
 }
 

[Survived] StringLiteral
domain/src/builders/common.ts:207:41
 }
 
 export function cpf(value: string): string {
-  return onlyDigits(value).padStart(11, '0').slice(0, 11);
+  return onlyDigits(value).padStart(11, "").slice(0, 11);
 }
 

[Survived] LogicalOperator
domain/src/builders/common.ts:211:17
 }
 
 export function onlyDigits(value: string | number | undefined): string {
-  return String(value ?? '').replace(/\D/g, '');
+  return String(value && '').replace(/\D/g, '');
 }
 

[Survived] StringLiteral
domain/src/builders/common.ts:211:45
 }
 
 export function onlyDigits(value: string | number | undefined): string {
-  return String(value ?? '').replace(/\D/g, '');
+  return String(value ?? '').replace(/\D/g, "Stryker was here!");
 }
 

[Survived] BooleanLiteral
domain/src/builders/common.ts:215:7
 }
 
 export function moneyFromCents(value: number): string {
-  if (!Number.isInteger(value)) throw new DtoValidationError(['amount']);
+  if (Number.isInteger(value)) throw new DtoValidationError(['amount']);
   const cents = BigInt(value);
   const reais = cents / 100n;

[Survived] ConditionalExpression
domain/src/builders/common.ts:215:7
 }
 
 export function moneyFromCents(value: number): string {
-  if (!Number.isInteger(value)) throw new DtoValidationError(['amount']);
+  if (false) throw new DtoValidationError(['amount']);
   const cents = BigInt(value);
   const reais = cents / 100n;

[Survived] ArithmeticOperator
domain/src/builders/common.ts:217:17
 export function moneyFromCents(value: number): string {
   if (!Number.isInteger(value)) throw new DtoValidationError(['amount']);
   const cents = BigInt(value);
-  const reais = cents / 100n;
+  const reais = cents * 100n;
   const centavos = cents < 0n ? -(cents % 100n) : cents % 100n;
   return `${reais.toString()}.${centavos.toString().padStart(2, '0')}`;

[Survived] EqualityOperator
domain/src/builders/common.ts:218:20
   if (!Number.isInteger(value)) throw new DtoValidationError(['amount']);
   const cents = BigInt(value);
   const reais = cents / 100n;
-  const centavos = cents < 0n ? -(cents % 100n) : cents % 100n;
+  const centavos = cents >= 0n ? -(cents % 100n) : cents % 100n;
   return `${reais.toString()}.${centavos.toString().padStart(2, '0')}`;
 }

[Survived] EqualityOperator
domain/src/builders/common.ts:218:20
   if (!Number.isInteger(value)) throw new DtoValidationError(['amount']);
   const cents = BigInt(value);
   const reais = cents / 100n;
-  const centavos = cents < 0n ? -(cents % 100n) : cents % 100n;
+  const centavos = cents <= 0n ? -(cents % 100n) : cents % 100n;
   return `${reais.toString()}.${centavos.toString().padStart(2, '0')}`;
 }

[Survived] EqualityOperator
domain/src/builders/common.ts:223:7
 }
 
 export function quantity(value: number | undefined): string {
-  if (value === undefined) return '1.0000';
+  if (value !== undefined) return '1.0000';
   return value.toFixed(4);
 }

[Survived] StringLiteral
domain/src/builders/common.ts:223:35
 }
 
 export function quantity(value: number | undefined): string {
-  if (value === undefined) return '1.0000';
+  if (value === undefined) return "";
   return value.toFixed(4);
 }

[Survived] StringLiteral
domain/src/builders/common.ts:229:20
 
 export function xmlEscape(value: string | number): string {
   return String(value)
-    .replace(/&/g, '&amp;')
+    .replace(/&/g, "")
     .replace(/</g, '&lt;')
     .replace(/>/g, '&gt;')

[Survived] StringLiteral
domain/src/builders/common.ts:241:21
 }
 
 export function sha256(value: string): string {
-  return createHash('sha256').update(value, 'utf8').digest('hex');
+  return createHash("").update(value, 'utf8').digest('hex');
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:247:10
 function environmentCode(
   value: BuilderContext['environment'],
 ): '1' | '2' {
-  return value === 'production' ? '1' : '2';
+  return false ? '1' : '2';
 }
 

[Survived] EqualityOperator
domain/src/builders/common.ts:247:10
 function environmentCode(
   value: BuilderContext['environment'],
 ): '1' | '2' {
-  return value === 'production' ? '1' : '2';
+  return value !== 'production' ? '1' : '2';
 }
 

[Survived] ConditionalExpression
domain/src/builders/common.ts:251:51
 }
 
 function isMissing(value: unknown): boolean {
-  return value === undefined || value === null || value === '';
+  return value === undefined || value === null || false;
 }
 

[Survived] EqualityOperator
domain/src/builders/common.ts:251:51
 }
 
 function isMissing(value: unknown): boolean {
-  return value === undefined || value === null || value === '';
+  return value === undefined || value === null || value !== '';
 }
 
