[Survived] LogicalOperator
domain/src/returns/return-processor.ts:164:28
   async process(request: ReturnRequestEnvelope): Promise<ReturnProcessorResult> {
     const occurredAt = this.now().toISOString();
     const payload = recordOrEmpty(request.payload);
-    const rawResponseXml = stringValue(payload['rawResponseXml'])
-      ?? stringValue(payload['responseXml'])
-      ?? '';
+    const rawResponseXml = (stringValue(payload['rawResponseXml']) ?? stringValue(payload['responseXml'])) && '';
     const responseHash = sha256Prefixed(rawResponseXml);
     const parsedOutcome = await this.parseAndClassify(

[Survived] StringLiteral
domain/src/returns/return-processor.ts:164:48
   async process(request: ReturnRequestEnvelope): Promise<ReturnProcessorResult> {
     const occurredAt = this.now().toISOString();
     const payload = recordOrEmpty(request.payload);
-    const rawResponseXml = stringValue(payload['rawResponseXml'])
+    const rawResponseXml = stringValue(payload[""])
       ?? stringValue(payload['responseXml'])
       ?? '';

[Survived] StringLiteral
domain/src/returns/return-processor.ts:166:10
     const payload = recordOrEmpty(request.payload);
     const rawResponseXml = stringValue(payload['rawResponseXml'])
       ?? stringValue(payload['responseXml'])
-      ?? '';
+      ?? "Stryker was here!";
     const responseHash = sha256Prefixed(rawResponseXml);
     const parsedOutcome = await this.parseAndClassify(

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:173:22
       rawResponseXml,
       occurredAt,
     );
-    const protocol = parsedOutcome.parsed?.protocol
-      ?? stringValue(payload['protocolNumber'])
-      ?? undefined;
+    const protocol = (parsedOutcome.parsed?.protocol ?? stringValue(payload['protocolNumber'])) && undefined;
     const receipt = parsedOutcome.parsed?.receipt
       ?? stringValue(payload['receiptNumber'])

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:176:21
     const protocol = parsedOutcome.parsed?.protocol
       ?? stringValue(payload['protocolNumber'])
       ?? undefined;
-    const receipt = parsedOutcome.parsed?.receipt
-      ?? stringValue(payload['receiptNumber'])
-      ?? undefined;
+    const receipt = (parsedOutcome.parsed?.receipt ?? stringValue(payload['receiptNumber'])) && undefined;
     const totalizerClass =
       parsedOutcome.parsed?.kind === 'totalizer'

[Survived] OptionalChaining
domain/src/returns/return-processor.ts:176:21
     const protocol = parsedOutcome.parsed?.protocol
       ?? stringValue(payload['protocolNumber'])
       ?? undefined;
-    const receipt = parsedOutcome.parsed?.receipt
+    const receipt = parsedOutcome.parsed.receipt
       ?? stringValue(payload['receiptNumber'])
       ?? undefined;

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:186:11
     const competence =
       parsedOutcome.parsed?.kind === 'totalizer'
         ? parsedOutcome.parsed.totalizer.competence
-        : stringValue(payload['competence']) ?? undefined;
+        : stringValue(payload['competence']) && undefined;
     const origin = await this.resolveOrigin({
       request,

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:208:19
       batchId: origin.batchId,
       protocol,
       receipt,
-      competence: origin.competence ?? competence,
+      competence: origin.competence && competence,
       totalizerClass,
       sourceEventClass: origin.sourceEventClass,

[Survived] StringLiteral
domain/src/returns/return-processor.ts:232:9
       buildSubmissionPublishCommand(
         'spool',
         spoolUpdate,
-        `${record.messageId}:return:${record.status}`,
+        ``,
       ),
     );

[Survived] BlockStatement
domain/src/returns/return-processor.ts:253:20
 
   async publishMalformedToDlq(
     validation: Exclude<ReturnIngressValidationResult, { ok: true }>,
-  ): Promise<void> {
-    const occurredAt = this.now().toISOString();
-    const envelope = buildReturnDlqEnvelope(
-      validation.candidate,
-      validation.error,
-      occurredAt,
-      validation.rawBody,
-    );
-    await this.publishers.dlq.publish(
-      buildSubmissionPublishCommand('dlq', envelope, `${envelope['request-id']}:return:dlq`),
-    );
-  }
+  ): Promise<void> {}
 
   private async parseAndClassify(

[Survived] BlockStatement
domain/src/returns/return-processor.ts:280:41
   }>> {
     try {
       const parsed = parseEsocialReturnXml(rawResponseXml);
-      if (parsed.kind === 'soap_fault') {
-        return {
-          parsed,
-          status: 'failed',
-          operatorActionRequired: true,
-          auditFlags: [],
-          errors: [
-            {
-              category: 'transport',
-              code: 'ESOCIAL_SOAP_FAULT',
-              message: parsed.fault,
-              retryable: false,
-              occurred_at: occurredAt,
-            },
-          ],
-        };
-      }
+      if (parsed.kind === 'soap_fault') {}
 
       const classification = parsed.responseCode

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:284:35
         return {
           parsed,
           status: 'failed',
-          operatorActionRequired: true,
+          operatorActionRequired: false,
           auditFlags: [],
           errors: [

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:291:26
               category: 'transport',
               code: 'ESOCIAL_SOAP_FAULT',
               message: parsed.fault,
-              retryable: false,
+              retryable: true,
               occurred_at: occurredAt,
             },

[Survived] StringLiteral
domain/src/returns/return-processor.ts:309:24
           parsed,
           status: 'failed',
           operatorActionRequired: true,
-          auditFlags: ['unknown_regulatory_code'],
+          auditFlags: [""],
           errors: [
             {

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:314:76
             {
               category: 'regulatory',
               code: 'ESOCIAL_RESPONSE_CODE_UNMAPPED',
-              message: `No esocial.response_classification row maps code ${parsed.responseCode ?? 'UNKNOWN'}.`,
+              message: `No esocial.response_classification row maps code ${parsed.responseCode && 'UNKNOWN'}.`,
               retryable: false,
               occurred_at: occurredAt,

[Survived] StringLiteral
domain/src/returns/return-processor.ts:314:24
             {
               category: 'regulatory',
               code: 'ESOCIAL_RESPONSE_CODE_UNMAPPED',
-              message: `No esocial.response_classification row maps code ${parsed.responseCode ?? 'UNKNOWN'}.`,
+              message: ``,
               retryable: false,
               occurred_at: occurredAt,

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:315:26
               category: 'regulatory',
               code: 'ESOCIAL_RESPONSE_CODE_UNMAPPED',
               message: `No esocial.response_classification row maps code ${parsed.responseCode ?? 'UNKNOWN'}.`,
-              retryable: false,
+              retryable: true,
               occurred_at: occurredAt,
             },

[Survived] ArrayDeclaration
domain/src/returns/return-processor.ts:338:17
         status: 'failed',
         operatorActionRequired: true,
         auditFlags: [],
-        errors: [
-          {
-            category: 'schema',
-            code:
-              error instanceof ReturnXmlParseError
-                ? 'MALFORMED_XML'
-                : 'ESOCIAL_RETURN_PARSE_FAILED',
-            message,
-            retryable: false,
-            occurred_at: occurredAt,
-          },
-        ],
+        errors: [],
       };
     }

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:346:24
                 ? 'MALFORMED_XML'
                 : 'ESOCIAL_RETURN_PARSE_FAILED',
             message,
-            retryable: false,
+            retryable: true,
             occurred_at: occurredAt,
           },

[Survived] StringLiteral
domain/src/returns/return-processor.ts:361:53
     receipt?: string | undefined;
     competence?: string | undefined;
   }>): Promise<ReturnOriginRecord> {
-    const eventRecordId = stringValue(input.payload['eventRecordId']);
+    const eventRecordId = stringValue(input.payload[""]);
     const batchId = stringValue(input.payload['batchId']);
     const previousStatus = statusOrUndefined(input.payload['previousStatus']);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:362:47
     competence?: string | undefined;
   }>): Promise<ReturnOriginRecord> {
     const eventRecordId = stringValue(input.payload['eventRecordId']);
-    const batchId = stringValue(input.payload['batchId']);
+    const batchId = stringValue(input.payload[""]);
     const previousStatus = statusOrUndefined(input.payload['previousStatus']);
     const sourceEventClass = eventClassOrUndefined(input.payload['sourceEventClass']);

[Survived] BlockStatement
domain/src/returns/return-processor.ts:366:35
     const previousStatus = statusOrUndefined(input.payload['previousStatus']);
     const sourceEventClass = eventClassOrUndefined(input.payload['sourceEventClass']);
 
-    if (eventRecordId && batchId) {
-      return {
-        eventRecordId,
-        batchId,
-        previousStatus,
-        sourceEventClass,
-        competence: input.competence,
-      };
-    }
+    if (eventRecordId && batchId) {}
 
     const resolved = await this.repository.resolveOrigin?.({

[Survived] BlockStatement
domain/src/returns/return-processor.ts:383:19
       receipt: input.receipt,
     });
 
-    if (resolved) {
-      return {
-        ...resolved,
-        previousStatus: previousStatus ?? resolved.previousStatus,
-        sourceEventClass: sourceEventClass ?? resolved.sourceEventClass,
-        competence: input.competence ?? resolved.competence,
-      };
-    }
+    if (resolved) {}
 
     throw new Error(

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:386:25
     if (resolved) {
       return {
         ...resolved,
-        previousStatus: previousStatus ?? resolved.previousStatus,
+        previousStatus: previousStatus && resolved.previousStatus,
         sourceEventClass: sourceEventClass ?? resolved.sourceEventClass,
         competence: input.competence ?? resolved.competence,

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:387:27
       return {
         ...resolved,
         previousStatus: previousStatus ?? resolved.previousStatus,
-        sourceEventClass: sourceEventClass ?? resolved.sourceEventClass,
+        sourceEventClass: sourceEventClass && resolved.sourceEventClass,
         competence: input.competence ?? resolved.competence,
       };

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:388:21
         ...resolved,
         previousStatus: previousStatus ?? resolved.previousStatus,
         sourceEventClass: sourceEventClass ?? resolved.sourceEventClass,
-        competence: input.competence ?? resolved.competence,
+        competence: input.competence && resolved.competence,
       };
     }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:403:25
   rawBody?: string,
 ): ReturnIngressValidationResult {
   if (!isRecord(candidate)) {
-    return ingressError('ESOCIAL_RETURN_NOT_OBJECT', 'Return body must be a JSON object.', candidate, rawBody);
+    return ingressError("", 'Return body must be a JSON object.', candidate, rawBody);
   }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:406:7
     return ingressError('ESOCIAL_RETURN_NOT_OBJECT', 'Return body must be a JSON object.', candidate, rawBody);
   }
 
-  if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
+  if (false) {
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:406:7
     return ingressError('ESOCIAL_RETURN_NOT_OBJECT', 'Return body must be a JSON object.', candidate, rawBody);
   }
 
-  if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
+  if (candidate['version'] === ESOCIAL_CONTRACT_VERSION) {
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:409:7
   if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }
-  if (candidate['family'] !== 'request') {
+  if (false) {
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Return handler accepts request envelopes only.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:409:42
   if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }
-  if (candidate['family'] !== 'request') {
-    return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Return handler accepts request envelopes only.', candidate, rawBody);
-  }
+  if (candidate['family'] !== 'request') {}
   if (!isNonEmptyString(candidate['request-id'])) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:412:7
   if (candidate['family'] !== 'request') {
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Return handler accepts request envelopes only.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['request-id'])) {
+  if (isNonEmptyString(candidate['request-id'])) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:412:7
   if (candidate['family'] !== 'request') {
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Return handler accepts request envelopes only.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['request-id'])) {
+  if (false) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:415:7
   if (!isNonEmptyString(candidate['request-id'])) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['correlation-id'])) {
+  if (false) {
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:415:55
   if (!isNonEmptyString(candidate['request-id'])) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['correlation-id'])) {
-    return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['correlation-id'])) {}
   if (!isNonEmptyString(candidate['idempotency-key'])) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:418:7
   if (!isNonEmptyString(candidate['correlation-id'])) {
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['idempotency-key'])) {
+  if (false) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:418:7
   if (!isNonEmptyString(candidate['correlation-id'])) {
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['idempotency-key'])) {
+  if (isNonEmptyString(candidate['idempotency-key'])) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:419:61
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['idempotency-key'])) {
-    return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
+    return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', "", candidate, rawBody);
   }
   if (!isUuid(candidate['tenant_id'])) {

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:421:7
   if (!isNonEmptyString(candidate['idempotency-key'])) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }
-  if (!isUuid(candidate['tenant_id'])) {
+  if (isUuid(candidate['tenant_id'])) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:421:7
   if (!isNonEmptyString(candidate['idempotency-key'])) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }
-  if (!isUuid(candidate['tenant_id'])) {
+  if (false) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:424:7
   if (!isUuid(candidate['tenant_id'])) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
+  if (includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:424:72
   if (!isUuid(candidate['tenant_id'])) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
-    return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
-  }
+  if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {}
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:425:25
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
   if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
-    return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
+    return ingressError("", 'environment is not supported.', candidate, rawBody);
   }
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {

[Survived] StringLiteral
domain/src/returns/return-processor.ts:425:56
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
   if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
-    return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
+    return ingressError('ESOCIAL_ENVIRONMENT_INVALID', "", candidate, rawBody);
   }
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:427:7
   if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
+  if (false) {
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:427:79
   if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
-    return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
-  }
+  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {}
   if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:428:56
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
-    return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
+    return ingressError('ESOCIAL_EVENT_CLASS_INVALID', "", candidate, rawBody);
   }
   if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:430:7
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
+  if (includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:430:62
   if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }
-  if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
+  if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || false) {
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:433:7
   if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }
-  if (!isRecord(candidate['source'])) {
+  if (isRecord(candidate['source'])) {
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:433:39
   if (!includesString(ESOCIAL_CLASSES, candidate['kind']) || candidate['kind'] !== 'retorno') {
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }
-  if (!isRecord(candidate['source'])) {
-    return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
-  }
+  if (!isRecord(candidate['source'])) {}
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:434:52
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }
   if (!isRecord(candidate['source'])) {
-    return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
+    return ingressError('ESOCIAL_SOURCE_REQUIRED', "", candidate, rawBody);
   }
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {

[Survived] StringLiteral
domain/src/returns/return-processor.ts:434:25
     return ingressError('ESOCIAL_RETURN_KIND_INVALID', 'return handler accepts kind retorno only.', candidate, rawBody);
   }
   if (!isRecord(candidate['source'])) {
-    return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
+    return ingressError("", 'source object is required.', candidate, rawBody);
   }
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:436:50
   if (!isRecord(candidate['source'])) {
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }
-  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
+  if (!Number.isInteger(candidate['attempt']) || false) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:436:50
   if (!isRecord(candidate['source'])) {
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }
-  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
+  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) >= 0) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:437:52
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
-    return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
+    return ingressError('ESOCIAL_ATTEMPT_INVALID', "", candidate, rawBody);
   }
   if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:439:7
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }
-  if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
+  if (Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:439:94
   if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }
-  if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
-    return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
-  }
+  if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {}
   if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);

[Survived] BlockStatement
domain/src/returns/return-processor.ts:442:102
   if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
-    return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {}
   if (!isNonEmptyString(candidate['payload_hash'])) {
     return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:442:7
   if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
+  if (isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }
