[Survived] StringLiteral
domain/src/returns/return-processor.ts:443:52
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
-    return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
+    return ingressError('ESOCIAL_TOPICS_REQUIRED', "", candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['payload_hash'])) {

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:445:7
   if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['payload_hash'])) {
+  if (false) {
     return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:445:7
   if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['payload_hash'])) {
+  if (true) {
     return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:449:25
     return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
   }
   if (!isRecord(candidate['payload'])) {
-    return ingressError('ESOCIAL_RETURN_PAYLOAD_REQUIRED', 'payload object is required.', candidate, rawBody);
+    return ingressError("", 'payload object is required.', candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {

[Survived] BlockStatement
domain/src/returns/return-processor.ts:451:124
   if (!isRecord(candidate['payload'])) {
     return ingressError('ESOCIAL_RETURN_PAYLOAD_REQUIRED', 'payload object is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
-    return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {}
   const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);
   const hasLookupOrigin =

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:451:7
   if (!isRecord(candidate['payload'])) {
     return ingressError('ESOCIAL_RETURN_PAYLOAD_REQUIRED', 'payload object is required.', candidate, rawBody);
   }
-  if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
+  if (isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
     return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:452:56
     return ingressError('ESOCIAL_RETURN_PAYLOAD_REQUIRED', 'payload object is required.', candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
-    return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
+    return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "", candidate, rawBody);
   }
   const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:452:25
     return ingressError('ESOCIAL_RETURN_PAYLOAD_REQUIRED', 'payload object is required.', candidate, rawBody);
   }
   if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
-    return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
+    return ingressError("", "payload['rawResponseXml'] is required.", candidate, rawBody);
   }
   const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:454:29
   if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
     return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
   }
-  const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);
+  const hasExplicitOrigin = false;
   const hasLookupOrigin =
     isNonEmptyString(candidate['payload']['protocolNumber'])

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:454:29
   if (!isNonEmptyString(candidate['payload']['rawResponseXml']) && !isNonEmptyString(candidate['payload']['responseXml'])) {
     return ingressError('ESOCIAL_RETURN_XML_REQUIRED', "payload['rawResponseXml'] is required.", candidate, rawBody);
   }
-  const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);
+  const hasExplicitOrigin = true;
   const hasLookupOrigin =
     isNonEmptyString(candidate['payload']['protocolNumber'])

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:456:5
   }
   const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);
   const hasLookupOrigin =
-    isNonEmptyString(candidate['payload']['protocolNumber'])
-    || isNonEmptyString(candidate['payload']['receiptNumber']);
+    false;
   if (!hasExplicitOrigin && !hasLookupOrigin) {
     return ingressError(

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:456:5
   }
   const hasExplicitOrigin = isUuid(candidate['payload']['eventRecordId']) && isUuid(candidate['payload']['batchId']);
   const hasLookupOrigin =
-    isNonEmptyString(candidate['payload']['protocolNumber'])
-    || isNonEmptyString(candidate['payload']['receiptNumber']);
+    isNonEmptyString(candidate['payload']['protocolNumber']) && isNonEmptyString(candidate['payload']['receiptNumber']);
   if (!hasExplicitOrigin && !hasLookupOrigin) {
     return ingressError(

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:458:29
   const hasLookupOrigin =
     isNonEmptyString(candidate['payload']['protocolNumber'])
     || isNonEmptyString(candidate['payload']['receiptNumber']);
-  if (!hasExplicitOrigin && !hasLookupOrigin) {
+  if (!hasExplicitOrigin && hasLookupOrigin) {
     return ingressError(
       'ESOCIAL_RETURN_ORIGIN_REQUIRED',

[Survived] BlockStatement
domain/src/returns/return-processor.ts:458:47
   const hasLookupOrigin =
     isNonEmptyString(candidate['payload']['protocolNumber'])
     || isNonEmptyString(candidate['payload']['receiptNumber']);
-  if (!hasExplicitOrigin && !hasLookupOrigin) {
-    return ingressError(
-      'ESOCIAL_RETURN_ORIGIN_REQUIRED',
-      'payload must include eventRecordId and batchId or protocolNumber/receiptNumber for origin lookup.',
-      candidate,
-      rawBody,
-    );
-  }
+  if (!hasExplicitOrigin && !hasLookupOrigin) {}
   if (candidate['payload']['eventRecordId'] !== undefined && !isUuid(candidate['payload']['eventRecordId'])) {
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);

[Survived] StringLiteral
domain/src/returns/return-processor.ts:460:7
     || isNonEmptyString(candidate['payload']['receiptNumber']);
   if (!hasExplicitOrigin && !hasLookupOrigin) {
     return ingressError(
-      'ESOCIAL_RETURN_ORIGIN_REQUIRED',
+      "",
       'payload must include eventRecordId and batchId or protocolNumber/receiptNumber for origin lookup.',
       candidate,

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:466:7
       rawBody,
     );
   }
-  if (candidate['payload']['eventRecordId'] !== undefined && !isUuid(candidate['payload']['eventRecordId'])) {
+  if (candidate['payload']['eventRecordId'] !== undefined || !isUuid(candidate['payload']['eventRecordId'])) {
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);
   }

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:466:7
       rawBody,
     );
   }
-  if (candidate['payload']['eventRecordId'] !== undefined && !isUuid(candidate['payload']['eventRecordId'])) {
+  if (candidate['payload']['eventRecordId'] === undefined && !isUuid(candidate['payload']['eventRecordId'])) {
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);
   }

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:469:7
   if (candidate['payload']['eventRecordId'] !== undefined && !isUuid(candidate['payload']['eventRecordId'])) {
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);
   }
-  if (candidate['payload']['batchId'] !== undefined && !isUuid(candidate['payload']['batchId'])) {
+  if (candidate['payload']['batchId'] === undefined && !isUuid(candidate['payload']['batchId'])) {
     return ingressError('ESOCIAL_RETURN_BATCH_REQUIRED', "payload['batchId'] must identify the esocial.submission_batch row.", candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:469:56
   if (candidate['payload']['eventRecordId'] !== undefined && !isUuid(candidate['payload']['eventRecordId'])) {
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);
   }
-  if (candidate['payload']['batchId'] !== undefined && !isUuid(candidate['payload']['batchId'])) {
+  if (candidate['payload']['batchId'] !== undefined && isUuid(candidate['payload']['batchId'])) {
     return ingressError('ESOCIAL_RETURN_BATCH_REQUIRED', "payload['batchId'] must identify the esocial.submission_batch row.", candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/returns/return-processor.ts:470:25
     return ingressError('ESOCIAL_RETURN_EVENT_RECORD_REQUIRED', "payload['eventRecordId'] must identify the esocial.event_record row.", candidate, rawBody);
   }
   if (candidate['payload']['batchId'] !== undefined && !isUuid(candidate['payload']['batchId'])) {
-    return ingressError('ESOCIAL_RETURN_BATCH_REQUIRED', "payload['batchId'] must identify the esocial.submission_batch row.", candidate, rawBody);
+    return ingressError("", "payload['batchId'] must identify the esocial.submission_batch row.", candidate, rawBody);
   }
 

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:510:20
     },
     response_hash: record.responseHash,
     response_payload: {
-      return_kind: parsedOutcome.parsed?.kind ?? 'malformed_xml',
+      return_kind: parsedOutcome.parsed?.kind && 'malformed_xml',
       protocol_number: record.protocol,
       receipt_number: record.receipt,

[Survived] StringLiteral
domain/src/returns/return-processor.ts:510:50
     },
     response_hash: record.responseHash,
     response_payload: {
-      return_kind: parsedOutcome.parsed?.kind ?? 'malformed_xml',
+      return_kind: parsedOutcome.parsed?.kind ?? "",
       protocol_number: record.protocol,
       receipt_number: record.receipt,

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:554:7
     source: request.source,
     actor_id: 'system:esocial-retorno',
     action:
-      parsedOutcome.parsed?.kind === 'totalizer'
+      true
         ? 'return.totalizer.persisted'
         : `return.${record.status}`,

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:554:7
     source: request.source,
     actor_id: 'system:esocial-retorno',
     action:
-      parsedOutcome.parsed?.kind === 'totalizer'
+      parsedOutcome.parsed?.kind !== 'totalizer'
         ? 'return.totalizer.persisted'
         : `return.${record.status}`,

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:560:11
     status: record.status,
     target: {
       type: record.totalizerId ? 'esocial.esocial_totalizer' : 'esocial.event_record',
-      id: record.totalizerId ?? record.eventRecordId,
+      id: record.totalizerId && record.eventRecordId,
     },
     after: {

[Survived] StringLiteral
domain/src/returns/return-processor.ts:586:45
   occurredAt: string,
   rawBody?: string,
 ): EsocialDlqEnvelope & Readonly<{ malformed_body?: string | undefined }> {
-  const requestId = stringValue(candidate?.['request-id']) ?? `malformed-return-${occurredAt}`;
+  const requestId = stringValue(candidate?.[""]) ?? `malformed-return-${occurredAt}`;
   const correlationId = stringValue(candidate?.['correlation-id']) ?? requestId;
   const eventClass = includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate?.['event_class'])

[Survived] StringLiteral
domain/src/returns/return-processor.ts:586:63
   occurredAt: string,
   rawBody?: string,
 ): EsocialDlqEnvelope & Readonly<{ malformed_body?: string | undefined }> {
-  const requestId = stringValue(candidate?.['request-id']) ?? `malformed-return-${occurredAt}`;
+  const requestId = stringValue(candidate?.['request-id']) ?? ``;
   const correlationId = stringValue(candidate?.['correlation-id']) ?? requestId;
   const eventClass = includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate?.['event_class'])

[Survived] StringLiteral
domain/src/returns/return-processor.ts:597:71
     family: 'dlq',
     'request-id': requestId,
     'correlation-id': correlationId,
-    'idempotency-key': stringValue(candidate?.['idempotency-key']) ?? `malformed-return:${requestId}`,
+    'idempotency-key': stringValue(candidate?.['idempotency-key']) ?? ``,
     created_at: occurredAt,
     tenant_id: isUuid(candidate?.['tenant_id']) ? candidate['tenant_id'] : NIL_TENANT_ID,

[Survived] ArrayDeclaration
domain/src/returns/return-processor.ts:610:13
     final_attempt: Number.isInteger(candidate?.['attempt']) ? Number(candidate?.['attempt']) : 0,
     dlq_reason: error.message,
     failed_at: occurredAt,
-    errors: [error],
+    errors: [],
     replay_topic: 'sgp.esocial.replay',
     malformed_body: rawBody,

[Survived] StringLiteral
domain/src/returns/return-processor.ts:611:19
     dlq_reason: error.message,
     failed_at: occurredAt,
     errors: [error],
-    replay_topic: 'sgp.esocial.replay',
+    replay_topic: "",
     malformed_body: rawBody,
   };

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:620:5
   classification: ReturnResponseClassification,
 ): EsocialStatus {
   switch (classification.canonicalStatus) {
-    case 'ACCEPTED':
-      return 'accepted';
+    case 'ACCEPTED':
     case 'REJECTED':
       return 'rejected';

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:622:5
   switch (classification.canonicalStatus) {
     case 'ACCEPTED':
       return 'accepted';
-    case 'REJECTED':
-      return 'rejected';
+    case 'REJECTED':
     case 'RETRY':
       return 'retry';

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:624:5
       return 'accepted';
     case 'REJECTED':
       return 'rejected';
-    case 'RETRY':
-      return 'retry';
+    case 'RETRY':
     case 'TIMEOUT':
       return 'timeout';

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:626:5
       return 'rejected';
     case 'RETRY':
       return 'retry';
-    case 'TIMEOUT':
-      return 'timeout';
+    case 'TIMEOUT':
     case 'DLQ':
     case 'OPERATOR_ACTION':

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:629:5
     case 'TIMEOUT':
       return 'timeout';
     case 'DLQ':
-    case 'OPERATOR_ACTION':
-      return 'dlq';
+    case 'OPERATOR_ACTION':
     case 'FAILED':
       return 'failed';

[Survived] BlockStatement
domain/src/returns/return-processor.ts:642:49
   classification?: ReturnResponseClassification,
 ): EsocialContractError[] {
   if (parsed.kind !== 'processing') {
-    if (classification?.operatorActionRequired) {
-      return [
-            {
-              category: 'regulatory',
-              code: parsed.responseCode ?? 'ESOCIAL_RESPONSE_WITHOUT_CODE',
-              message: classification.description,
-              retryable: classification.retryable,
-              occurred_at: occurredAt,
-        },
-      ];
-    }
+    if (classification?.operatorActionRequired) {}
     return [];
   }

[Survived] ObjectLiteral
domain/src/returns/return-processor.ts:661:16
       category: 'regulatory' as const,
       code: occurrence.code,
       message: occurrence.description,
-      details: {
-        event_reference: eventReturn.eventReference,
-        response_code: eventReturn.responseCode,
-        response_description: eventReturn.responseDescription,
-        occurrence_type: occurrence.type,
-        location: occurrence.location,
-      },
+      details: {},
       retryable: classification?.retryable ?? false,
       occurred_at: occurredAt,

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:668:47
         occurrence_type: occurrence.type,
         location: occurrence.location,
       },
-      retryable: classification?.retryable ?? false,
+      retryable: classification?.retryable ?? true,
       occurred_at: occurredAt,
     })),

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:668:18
         occurrence_type: occurrence.type,
         location: occurrence.location,
       },
-      retryable: classification?.retryable ?? false,
+      retryable: classification?.retryable && false,
       occurred_at: occurredAt,
     })),

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:673:7
     })),
   );
 
-  if (eventErrors.length > 0) return eventErrors;
+  if (eventErrors.length >= 0) return eventErrors;
   if (!classification?.operatorActionRequired && classification?.canonicalStatus === 'ACCEPTED') {
     return [];

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:673:7
     })),
   );
 
-  if (eventErrors.length > 0) return eventErrors;
+  if (false) return eventErrors;
   if (!classification?.operatorActionRequired && classification?.canonicalStatus === 'ACCEPTED') {
     return [];

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:674:7
   );
 
   if (eventErrors.length > 0) return eventErrors;
-  if (!classification?.operatorActionRequired && classification?.canonicalStatus === 'ACCEPTED') {
+  if (!classification?.operatorActionRequired || classification?.canonicalStatus === 'ACCEPTED') {
     return [];
   }

[Survived] BlockStatement
domain/src/returns/return-processor.ts:674:98
   );
 
   if (eventErrors.length > 0) return eventErrors;
-  if (!classification?.operatorActionRequired && classification?.canonicalStatus === 'ACCEPTED') {
-    return [];
-  }
+  if (!classification?.operatorActionRequired && classification?.canonicalStatus === 'ACCEPTED') {}
 
   return [

[Survived] BooleanLiteral
domain/src/returns/return-processor.ts:683:47
       category: 'regulatory',
       code: parsed.responseCode,
       message: parsed.responseDescription,
-      retryable: classification?.retryable ?? false,
+      retryable: classification?.retryable ?? true,
       occurred_at: occurredAt,
     },

[Survived] LogicalOperator
domain/src/returns/return-processor.ts:683:18
       category: 'regulatory',
       code: parsed.responseCode,
       message: parsed.responseDescription,
-      retryable: classification?.retryable ?? false,
+      retryable: classification?.retryable && false,
       occurred_at: occurredAt,
     },

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:713:10
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return false;
 }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:713:39
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value === 'object' && true && !Array.isArray(value);
 }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:717:10
 }
 
 function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.trim().length > 0;
+  return false;
 }
 

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:717:39
 }
 
 function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.trim().length > 0;
+  return typeof value === 'string' && value.trim().length >= 0;
 }
 

[Survived] EqualityOperator
domain/src/returns/return-processor.ts:728:10
   values: readonly TValue[],
   candidate: unknown,
 ): candidate is TValue {
-  return typeof candidate === 'string' && values.includes(candidate as TValue);
+  return typeof candidate !== 'string' && values.includes(candidate as TValue);
 }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:728:10
   values: readonly TValue[],
   candidate: unknown,
 ): candidate is TValue {
-  return typeof candidate === 'string' && values.includes(candidate as TValue);
+  return true;
 }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:756:10
 }
 
 function isUuid(value: unknown): value is string {
-  return typeof value === 'string' &&
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
+  return true;
 }
 

[Survived] ConditionalExpression
domain/src/returns/return-processor.ts:756:10
 }
 
 function isUuid(value: unknown): value is string {
-  return typeof value === 'string' &&
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
+  return false;
 }
 

[Survived] Regex
domain/src/returns/return-processor.ts:757:5
 
 function isUuid(value: unknown): value is string {
   return typeof value === 'string' &&
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
+    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}/iu.test(value);
 }
 

[Survived] Regex
domain/src/returns/return-processor.ts:757:5
 
 function isUuid(value: unknown): value is string {
   return typeof value === 'string' &&
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
+    /^[0-9a-f]-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
 }
 
