[Survived] BooleanLiteral
domain/src/submission/submission-dispatcher.ts:312:19
     eventClass: context.request.event_class,
     route: routeSubmissionEventClass(context.request.event_class),
     stage: 'building',
-    builderReady: false,
+    builderReady: true,
   };
 }

[Survived] BooleanLiteral
domain/src/submission/submission-dispatcher.ts:324:19
     eventClass: context.request.event_class,
     route: routeSubmissionEventClass(context.request.event_class),
     stage: 'building',
-    builderReady: true,
+    builderReady: false,
     builtXml,
   };

[Survived] ObjectLiteral
domain/src/submission/submission-dispatcher.ts:332:10
 function builderContext(
   context: SubmissionDispatchContext,
 ): BuilderContext {
-  return {
-    environment:
-      context.request.environment === 'PRODUCTION' ? 'production' : 'qualification',
-  };
+  return {};
 }
 

[Survived] EqualityOperator
domain/src/submission/submission-dispatcher.ts:334:7
 ): BuilderContext {
   return {
     environment:
-      context.request.environment === 'PRODUCTION' ? 'production' : 'qualification',
+      context.request.environment !== 'PRODUCTION' ? 'production' : 'qualification',
   };
 }

[Survived] ConditionalExpression
domain/src/submission/submission-dispatcher.ts:334:7
 ): BuilderContext {
   return {
     environment:
-      context.request.environment === 'PRODUCTION' ? 'production' : 'qualification',
+      false ? 'production' : 'qualification',
   };
 }
