[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:155:28
   async process(request: SubmissionRequestEnvelope): Promise<SubmissionProcessorResult> {
     const occurredAt = this.now().toISOString();
     const validationErrors = validateSubmissionPayload(request);
-    const dispatchResult = validationErrors.length > 0
+    const dispatchResult = validationErrors.length >= 0
       ? undefined
       : await this.dispatcher(request.payload, { request, occurredAt });

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:155:28
   async process(request: SubmissionRequestEnvelope): Promise<SubmissionProcessorResult> {
     const occurredAt = this.now().toISOString();
     const validationErrors = validateSubmissionPayload(request);
-    const dispatchResult = validationErrors.length > 0
+    const dispatchResult = true
       ? undefined
       : await this.dispatcher(request.payload, { request, occurredAt });

[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:176:9
     const auditEvent = buildAuditEnvelope(request, record, occurredAt);
     const spoolUpdate = buildSpoolUpdateEnvelope(request, record, occurredAt);
 
-    if (await this.publishResponse(request, response, occurredAt) === 'terminal') {
+    if ((await this.publishResponse(request, response, occurredAt)) !== 'terminal') {
       return {
         record,

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:176:9
     const auditEvent = buildAuditEnvelope(request, record, occurredAt);
     const spoolUpdate = buildSpoolUpdateEnvelope(request, record, occurredAt);
 
-    if (await this.publishResponse(request, response, occurredAt) === 'terminal') {
+    if (true) {
       return {
         record,

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:185:9
       };
     }
 
-    if (spoolUpdate) {
+    if (false) {
       if (await this.publishSpool(request, spoolUpdate, occurredAt) === 'terminal') {
         return {

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:185:9
       };
     }
 
-    if (spoolUpdate) {
+    if (true) {
       if (await this.publishSpool(request, spoolUpdate, occurredAt) === 'terminal') {
         return {

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:186:85
     }
 
     if (spoolUpdate) {
-      if (await this.publishSpool(request, spoolUpdate, occurredAt) === 'terminal') {
-        return {
-          record,
-          response,
-          spoolUpdate,
-          auditEvent,
-        };
-      }
+      if (await this.publishSpool(request, spoolUpdate, occurredAt) === 'terminal') {}
     }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:186:11
     }
 
     if (spoolUpdate) {
-      if (await this.publishSpool(request, spoolUpdate, occurredAt) === 'terminal') {
+      if (true) {
         return {
           record,

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:208:20
 
   async publishMalformedToDlq(
     validation: Exclude<SubmissionIngressValidationResult, { ok: true }>,
-  ): Promise<void> {
-    const occurredAt = this.now().toISOString();
-    const envelope = buildDlqEnvelopeFromCandidate(
-      validation.candidate,
-      validation.error,
-      occurredAt,
-      validation.rawBody,
-    );
-    await this.publishers.dlq.publish(
-      buildSubmissionPublishCommand('dlq', envelope, `${envelope['request-id']}:dlq`),
-    );
-  }
+  ): Promise<void> {}
 
   async publishIngressValidationFailure(

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:274:17
       environment: request.environment,
       event_class: request.event_class,
       source: request.source,
-      actor_id: 'system:esocial-submission',
+      actor_id: "",
       action: 'submit.ingress_validation_failed',
       status: 'validation_failed',

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:286:59
     };
 
     await this.publishers.response.publish(
-      buildSubmissionPublishCommand('response', response, `${occurredAt}:ingress-validation-response`),
+      buildSubmissionPublishCommand('response', response, ``),
     );
     await this.publishers.spool.publish(

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:322:53
     } as const;
 
     await this.publishers.retry.publish(
-      buildSubmissionPublishCommand('retry', retry, `${request['request-id']}:retry`),
+      buildSubmissionPublishCommand('retry', retry, ``),
     );
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:329:20
   async publishTerminalToDlq(
     request: SubmissionRequestEnvelope,
     errors: readonly EsocialContractError[],
-  ): Promise<void> {
-    const occurredAt = this.now().toISOString();
-    const envelope = buildDlqEnvelopeFromRequest(request, errors, occurredAt);
-    await this.publishers.dlq.publish(
-      buildSubmissionPublishCommand('dlq', envelope, `${request['request-id']}:dlq`),
-    );
-  }
+  ): Promise<void> {}
 
   private async publishResponse(

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:361:63
       request,
       () =>
         this.publishers.spool.publish(
-          buildSubmissionPublishCommand('spool', spoolUpdate, `${occurredAt}:spool`),
+          buildSubmissionPublishCommand('spool', spoolUpdate, ``),
         ),
       occurredAt,

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:391:53
       await publish();
       return 'published';
     } catch (error) {
-      if (error instanceof TerminalSubmissionError) {
-        await this.publishTerminalToDlq(request, error.errors);
-        return 'terminal';
-      }
+      if (error instanceof TerminalSubmissionError) {}
 
       const contractError = transportErrorFromUnknown(error, occurredAt);

[Survived] ArrayDeclaration
domain/src/submission/submission-processor.ts:398:65
 
       const contractError = transportErrorFromUnknown(error, occurredAt);
       await this.publishRetryForFailure(request, contractError);
-      throw new RetryableSubmissionError(contractError.message, [contractError]);
+      throw new RetryableSubmissionError(contractError.message, []);
     }
   }

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:408:25
   rawBody?: string,
 ): SubmissionIngressValidationResult {
   if (!isRecord(candidate)) {
-    return ingressError('ESOCIAL_REQUEST_NOT_OBJECT', 'Request body must be a JSON object.', candidate, rawBody);
+    return ingressError("", 'Request body must be a JSON object.', candidate, rawBody);
   }
 

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:411:58
     return ingressError('ESOCIAL_REQUEST_NOT_OBJECT', 'Request body must be a JSON object.', candidate, rawBody);
   }
 
-  if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
-    return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
-  }
+  if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {}
 
   if (candidate['family'] !== 'request') {

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:412:25
   }
 
   if (candidate['version'] !== ESOCIAL_CONTRACT_VERSION) {
-    return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
+    return ingressError("", 'Unsupported eSocial envelope version.', candidate, rawBody);
   }
 

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:415:42
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }
 
-  if (candidate['family'] !== 'request') {
-    return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Submission handler accepts request envelopes only.', candidate, rawBody);
-  }
+  if (candidate['family'] !== 'request') {}
 
   if (!isNonEmptyString(candidate['request-id'])) {

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:415:7
     return ingressError('ESOCIAL_UNSUPPORTED_VERSION', 'Unsupported eSocial envelope version.', candidate, rawBody);
   }
 
-  if (candidate['family'] !== 'request') {
+  if (false) {
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Submission handler accepts request envelopes only.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:416:25
   }
 
   if (candidate['family'] !== 'request') {
-    return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Submission handler accepts request envelopes only.', candidate, rawBody);
+    return ingressError("", 'Submission handler accepts request envelopes only.', candidate, rawBody);
   }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:419:7
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Submission handler accepts request envelopes only.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['request-id'])) {
+  if (false) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:419:7
     return ingressError('ESOCIAL_UNSUPPORTED_FAMILY', 'Submission handler accepts request envelopes only.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['request-id'])) {
+  if (isNonEmptyString(candidate['request-id'])) {
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:420:56
   }
 
   if (!isNonEmptyString(candidate['request-id'])) {
-    return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
+    return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', "", candidate, rawBody);
   }
 

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:420:25
   }
 
   if (!isNonEmptyString(candidate['request-id'])) {
-    return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
+    return ingressError("", 'request-id is required.', candidate, rawBody);
   }
 

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:423:55
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['correlation-id'])) {
-    return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['correlation-id'])) {}
 
   if (!isNonEmptyString(candidate['idempotency-key'])) {

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:423:7
     return ingressError('ESOCIAL_REQUEST_ID_REQUIRED', 'request-id is required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['correlation-id'])) {
+  if (false) {
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:427:7
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['idempotency-key'])) {
+  if (isNonEmptyString(candidate['idempotency-key'])) {
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:427:56
     return ingressError('ESOCIAL_CORRELATION_ID_REQUIRED', 'correlation-id is required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['idempotency-key'])) {
-    return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['idempotency-key'])) {}
 
   if (!isUuid(candidate['tenant_id'])) {

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:428:25
   }
 
   if (!isNonEmptyString(candidate['idempotency-key'])) {
-    return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
+    return ingressError("", 'idempotency-key is required.', candidate, rawBody);
   }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:431:7
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }
 
-  if (!isUuid(candidate['tenant_id'])) {
+  if (false) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:431:7
     return ingressError('ESOCIAL_IDEMPOTENCY_KEY_REQUIRED', 'idempotency-key is required.', candidate, rawBody);
   }
 
-  if (!isUuid(candidate['tenant_id'])) {
+  if (isUuid(candidate['tenant_id'])) {
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:435:7
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
+  if (false) {
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:435:7
     return ingressError('ESOCIAL_TENANT_UUID_REQUIRED', 'tenant_id must be a UUID for the current esocial schema.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
+  if (includesString(ESOCIAL_ENVIRONMENTS, candidate['environment'])) {
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:439:7
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
+  if (false) {
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:439:79
     return ingressError('ESOCIAL_ENVIRONMENT_INVALID', 'environment is not supported.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {
-    return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
-  }
+  if (!includesString(ESOCIAL_RELAY_EVENT_CLASSES, candidate['event_class'])) {}
 
   if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:443:7
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {
+  if (false) {
     return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:443:60
     return ingressError('ESOCIAL_EVENT_CLASS_INVALID', 'event_class is not supported.', candidate, rawBody);
   }
 
-  if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {
-    return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
-  }
+  if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {}
 
   if (!isRecord(candidate['source'])) {

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:444:49
   }
 
   if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {
-    return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
+    return ingressError('ESOCIAL_KIND_INVALID', "", candidate, rawBody);
   }
 

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:444:25
   }
 
   if (!includesString(ESOCIAL_CLASSES, candidate['kind'])) {
-    return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
+    return ingressError("", 'kind is not supported.', candidate, rawBody);
   }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:447:7
     return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
   }
 
-  if (!isRecord(candidate['source'])) {
+  if (false) {
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:447:7
     return ingressError('ESOCIAL_KIND_INVALID', 'kind is not supported.', candidate, rawBody);
   }
 
-  if (!isRecord(candidate['source'])) {
+  if (isRecord(candidate['source'])) {
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }

[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:451:50
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }
 
-  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
+  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) <= 0) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:451:7
     return ingressError('ESOCIAL_SOURCE_REQUIRED', 'source object is required.', candidate, rawBody);
   }
 
-  if (!Number.isInteger(candidate['attempt']) || Number(candidate['attempt']) < 0) {
+  if (false) {
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:455:7
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }
 
-  if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
+  if (false) {
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:455:55
     return ingressError('ESOCIAL_ATTEMPT_INVALID', 'attempt must be a non-negative integer.', candidate, rawBody);
   }
 
-  if (!Number.isInteger(candidate['max-attempts']) || Number(candidate['max-attempts']) < 1) {
+  if (!Number.isInteger(candidate['max-attempts']) || false) {
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:459:7
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
+  if (!isNonEmptyString(candidate['reply-to']) && !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:459:7
     return ingressError('ESOCIAL_MAX_ATTEMPTS_INVALID', 'max-attempts must be a positive integer.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
+  if (isNonEmptyString(candidate['reply-to']) || !isNonEmptyString(candidate['dead-letter-topic'])) {
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:463:53
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['payload_hash'])) {
-    return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
-  }
+  if (!isNonEmptyString(candidate['payload_hash'])) {}
 
   return {

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:463:7
     return ingressError('ESOCIAL_TOPICS_REQUIRED', 'reply-to and dead-letter-topic are required.', candidate, rawBody);
   }
 
-  if (!isNonEmptyString(candidate['payload_hash'])) {
+  if (true) {
     return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
   }

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:464:25
   }
 
   if (!isNonEmptyString(candidate['payload_hash'])) {
-    return ingressError('ESOCIAL_PAYLOAD_HASH_REQUIRED', 'payload_hash is required.', candidate, rawBody);
+    return ingressError("", 'payload_hash is required.', candidate, rawBody);
   }
 

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:484:42
     environment: request.environment,
     event_class: request.event_class,
     source_event_id: stringValue(source['source_event_id']),
-    source_entity_id: stringValue(source['source_entity_id']),
+    source_entity_id: stringValue(source[""]),
     source_entity_ids: stringArray(source['source_entity_ids']),
     competence: stringValue(payload['competence']) ?? stringValue(payload['validityStart']),

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:486:17
     source_event_id: stringValue(source['source_event_id']),
     source_entity_id: stringValue(source['source_entity_id']),
     source_entity_ids: stringArray(source['source_entity_ids']),
-    competence: stringValue(payload['competence']) ?? stringValue(payload['validityStart']),
+    competence: stringValue(payload['competence']) && stringValue(payload['validityStart']),
     payload_hash: request.payload_hash,
   });

[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:490:7
     payload_hash: request.payload_hash,
   });
 
-  if (request['idempotency-key'] === expected.value) {
+  if (request['idempotency-key'] !== expected.value) {
     return { ok: true };
   }

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:490:54
     payload_hash: request.payload_hash,
   });
 
-  if (request['idempotency-key'] === expected.value) {
-    return { ok: true };
-  }
+  if (request['idempotency-key'] === expected.value) {}
 
   return {

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:498:7
     ok: false,
     expectedKey: expected.value,
     error: validationError(
-      'ESOCIAL_IDEMPOTENCY_KEY_MISMATCH',
+      "",
       'idempotency-key must match buildEsocialIdempotencyKey for the request envelope.',
     ),

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:510:27
   const payload = request.payload;
   const errors: EsocialContractError[] = [];
 
-  if (!isRecord(payload)) {
-    return [
-      validationError('ESOCIAL_PAYLOAD_OBJECT_REQUIRED', 'payload must be an object.'),
-    ];
-  }
+  if (!isRecord(payload)) {}
 
   const dtoValidation = validateEsocialSgpRequestDto(payload);

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:510:7
   const payload = request.payload;
   const errors: EsocialContractError[] = [];
 
-  if (!isRecord(payload)) {
+  if (false) {
     return [
       validationError('ESOCIAL_PAYLOAD_OBJECT_REQUIRED', 'payload must be an object.'),

[Survived] ArrayDeclaration
domain/src/submission/submission-processor.ts:511:12
   const errors: EsocialContractError[] = [];
 
   if (!isRecord(payload)) {
-    return [
-      validationError('ESOCIAL_PAYLOAD_OBJECT_REQUIRED', 'payload must be an object.'),
-    ];
+    return [];
   }
 

[Survived] BlockStatement
domain/src/submission/submission-processor.ts:517:26
   }
 
   const dtoValidation = validateEsocialSgpRequestDto(payload);
-  if (!dtoValidation.ok) {
-    errors.push(
-      ...dtoValidation.errors.map((message) =>
-        validationError('ESOCIAL_DTO_INVALID', message),
-      ),
-    );
-  }
+  if (!dtoValidation.ok) {}
 
   const dtoEnvironment = dtoEnvironmentToEnvelope(payload['environment']);

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:517:7
   }
 
   const dtoValidation = validateEsocialSgpRequestDto(payload);
-  if (!dtoValidation.ok) {
+  if (false) {
     errors.push(
       ...dtoValidation.errors.map((message) =>

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:526:7
   }
 
   const dtoEnvironment = dtoEnvironmentToEnvelope(payload['environment']);
-  if (dtoEnvironment && dtoEnvironment !== request.environment) {
+  if (false) {
     errors.push(
       validationError(

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:526:7
   }
 
   const dtoEnvironment = dtoEnvironmentToEnvelope(payload['environment']);
-  if (dtoEnvironment && dtoEnvironment !== request.environment) {
+  if (dtoEnvironment || dtoEnvironment !== request.environment) {
     errors.push(
       validationError(

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:529:9
   if (dtoEnvironment && dtoEnvironment !== request.environment) {
     errors.push(
       validationError(
-        'ESOCIAL_PAYLOAD_ENVIRONMENT_MISMATCH',
+        "",
         "payload.environment must match envelope['environment'].",
       ),

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:530:9
     errors.push(
       validationError(
         'ESOCIAL_PAYLOAD_ENVIRONMENT_MISMATCH',
-        "payload.environment must match envelope['environment'].",
+        "",
       ),
     );

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:535:7
     );
   }
 
-  if (payload['eventClass'] !== request.event_class) {
+  if (false) {
     errors.push(validationError('ESOCIAL_PAYLOAD_EVENT_CLASS_MISMATCH', "payload.eventClass must match envelope['event_class']."));
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:535:7
     );
   }
 
-  if (payload['eventClass'] !== request.event_class) {
+  if (true) {
     errors.push(validationError('ESOCIAL_PAYLOAD_EVENT_CLASS_MISMATCH', "payload.eventClass must match envelope['event_class']."));
   }

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:536:73
   }
 
   if (payload['eventClass'] !== request.event_class) {
-    errors.push(validationError('ESOCIAL_PAYLOAD_EVENT_CLASS_MISMATCH', "payload.eventClass must match envelope['event_class']."));
+    errors.push(validationError('ESOCIAL_PAYLOAD_EVENT_CLASS_MISMATCH', ""));
   }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:545:7
 function statusFromDispatch(dispatch: Readonly<{
   stage?: string | undefined;
 }>): SubmissionPersistenceStatus {
-  if (dispatch.stage === 'sent') return 'sent';
+  if (false) return 'sent';
   if (dispatch.stage === 'failed') return 'failed';
   return 'building';

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:545:7
 function statusFromDispatch(dispatch: Readonly<{
   stage?: string | undefined;
 }>): SubmissionPersistenceStatus {
-  if (dispatch.stage === 'sent') return 'sent';
+  if (true) return 'sent';
   if (dispatch.stage === 'failed') return 'failed';
   return 'building';

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:546:7
   stage?: string | undefined;
 }>): SubmissionPersistenceStatus {
   if (dispatch.stage === 'sent') return 'sent';
-  if (dispatch.stage === 'failed') return 'failed';
+  if (true) return 'failed';
   return 'building';
 }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:546:7
   stage?: string | undefined;
 }>): SubmissionPersistenceStatus {
   if (dispatch.stage === 'sent') return 'sent';
-  if (dispatch.stage === 'failed') return 'failed';
+  if (false) return 'failed';
   return 'building';
 }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:563:7
     responseSha256?: string | undefined;
   } | undefined;
 }>): SubmissionTransportEvidence | undefined {
-  if (!dispatch.transport && !dispatch.protocolNumber) return undefined;
+  if (true) return undefined;
   return {
     ...dispatch.transport,

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:563:30
     responseSha256?: string | undefined;
   } | undefined;
 }>): SubmissionTransportEvidence | undefined {
-  if (!dispatch.transport && !dispatch.protocolNumber) return undefined;
+  if (!dispatch.transport && dispatch.protocolNumber) return undefined;
   return {
     ...dispatch.transport,

[Survived] ObjectLiteral
domain/src/submission/submission-processor.ts:564:10
   } | undefined;
 }>): SubmissionTransportEvidence | undefined {
   if (!dispatch.transport && !dispatch.protocolNumber) return undefined;
-  return {
-    ...dispatch.transport,
-    protocolNumber: dispatch.protocolNumber ?? dispatch.transport?.protocolNumber,
-  };
+  return {};
 }
 
