[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:566:21
   if (!dispatch.transport && !dispatch.protocolNumber) return undefined;
   return {
     ...dispatch.transport,
-    protocolNumber: dispatch.protocolNumber ?? dispatch.transport?.protocolNumber,
+    protocolNumber: dispatch.protocolNumber && dispatch.transport?.protocolNumber,
   };
 }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:571:7
 }
 
 function dtoEnvironmentToEnvelope(candidate: unknown): SubmissionRequestEnvelope['environment'] | undefined {
-  if (candidate === 'production') return 'PRODUCTION';
+  if (false) return 'PRODUCTION';
   if (candidate === 'qualification' || candidate === 'restricted_production') {
     return 'QUALIFICATION';

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:571:7
 }
 
 function dtoEnvironmentToEnvelope(candidate: unknown): SubmissionRequestEnvelope['environment'] | undefined {
-  if (candidate === 'production') return 'PRODUCTION';
+  if (true) return 'PRODUCTION';
   if (candidate === 'qualification' || candidate === 'restricted_production') {
     return 'QUALIFICATION';

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:572:40
 
 function dtoEnvironmentToEnvelope(candidate: unknown): SubmissionRequestEnvelope['environment'] | undefined {
   if (candidate === 'production') return 'PRODUCTION';
-  if (candidate === 'qualification' || candidate === 'restricted_production') {
+  if (candidate === 'qualification' || false) {
     return 'QUALIFICATION';
   }

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:572:7
 
 function dtoEnvironmentToEnvelope(candidate: unknown): SubmissionRequestEnvelope['environment'] | undefined {
   if (candidate === 'production') return 'PRODUCTION';
-  if (candidate === 'qualification' || candidate === 'restricted_production') {
+  if (false) {
     return 'QUALIFICATION';
   }

[Survived] ObjectLiteral
domain/src/submission/submission-processor.ts:598:13
     status: record.status,
     attempt: request.attempt,
     processed_at: occurredAt,
-    hashes: {
-      request_sha256: record.transport?.requestSha256 ?? request.payload_hash,
-      payload_sha256: request.payload_hash,
-      signed_payload_sha256: record.transport?.signedPayloadSha256,
-      response_sha256:
-        record.transport?.responseSha256 ?? record.transport?.soapResponseSha256,
-    },
+    hashes: {},
     protocol_number: record.transport?.protocolNumber,
     payload: {

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:599:23
     attempt: request.attempt,
     processed_at: occurredAt,
     hashes: {
-      request_sha256: record.transport?.requestSha256 ?? request.payload_hash,
+      request_sha256: record.transport?.requestSha256 && request.payload_hash,
       payload_sha256: request.payload_hash,
       signed_payload_sha256: record.transport?.signedPayloadSha256,

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:603:9
       payload_sha256: request.payload_hash,
       signed_payload_sha256: record.transport?.signedPayloadSha256,
       response_sha256:
-        record.transport?.responseSha256 ?? record.transport?.soapResponseSha256,
+        record.transport?.responseSha256 && record.transport?.soapResponseSha256,
     },
     protocol_number: record.transport?.protocolNumber,

[Survived] OptionalChaining
domain/src/submission/submission-processor.ts:603:9
       payload_sha256: request.payload_hash,
       signed_payload_sha256: record.transport?.signedPayloadSha256,
       response_sha256:
-        record.transport?.responseSha256 ?? record.transport?.soapResponseSha256,
+        record.transport.responseSha256 ?? record.transport?.soapResponseSha256,
     },
     protocol_number: record.transport?.protocolNumber,

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:612:18
       event_record_id: record.eventRecordId,
       route: record.route.name,
       stage: record.route.stage,
-      duplicate: !record.inserted,
+      duplicate: record.inserted,
     },
     errors: record.errors,

[Survived] ObjectLiteral
domain/src/submission/submission-processor.ts:636:24
     event_class: request.event_class,
     source: request.source,
     kind: request.kind,
-    status_transition: {
-      from: 'pending',
-      to: record.status,
-    },
+    status_transition: {},
     errors: record.errors,
     occurred_at: occurredAt,

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:653:27
   return {
     version: 'v1',
     family: 'audit',
-    'request-id': request['request-id'],
+    'request-id': request[""],
     'correlation-id': request['correlation-id'],
     'idempotency-key': request['idempotency-key'],

[Survived] ArrowFunction
domain/src/submission/submission-processor.ts:699:28
     kind: request.kind,
     status: 'dlq',
     final_attempt: request.attempt,
-    dlq_reason: errors.map((error) => error.message).join('; '),
+    dlq_reason: errors.map(() => undefined).join('; '),
     failed_at: occurredAt,
     errors,

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:712:42
   occurredAt: string,
   rawBody?: string,
 ): SubmissionDlqEnvelope {
-  const requestId = stringOr(candidate?.['request-id'], `malformed-${occurredAt}`);
+  const requestId = stringOr(candidate?.[""], `malformed-${occurredAt}`);
   const correlationId = stringOr(candidate?.['correlation-id'], requestId);
   const tenantId = isUuid(candidate?.['tenant_id']) ? candidate['tenant_id'] : NIL_TENANT_ID;

[Survived] StringLiteral
domain/src/submission/submission-processor.ts:712:57
   occurredAt: string,
   rawBody?: string,
 ): SubmissionDlqEnvelope {
-  const requestId = stringOr(candidate?.['request-id'], `malformed-${occurredAt}`);
+  const requestId = stringOr(candidate?.['request-id'], ``);
   const correlationId = stringOr(candidate?.['correlation-id'], requestId);
   const tenantId = isUuid(candidate?.['tenant_id']) ? candidate['tenant_id'] : NIL_TENANT_ID;

[Survived] BooleanLiteral
domain/src/submission/submission-processor.ts:749:16
     code: 'ESOCIAL_OUTBOUND_PUBLISH_FAILED',
     message: error instanceof Error ? error.message : 'Outbound publish failed.',
     details: error instanceof Error ? { name: error.name } : undefined,
-    retryable: true,
+    retryable: false,
     occurred_at: occurredAt,
   };

[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:778:10
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value !== 'object' && value !== null && !Array.isArray(value);
 }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:782:10
 }
 
 function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.trim().length > 0;
+  return true;
 }
 

[Survived] MethodExpression
domain/src/submission/submission-processor.ts:791:19
 
 function stringArray(value: unknown): readonly string[] | undefined {
   if (!Array.isArray(value)) return undefined;
-  const strings = value.filter((item): item is string => isNonEmptyString(item));
+  const strings = value;
   return strings.length > 0 ? strings : undefined;
 }

[Survived] ArrowFunction
domain/src/submission/submission-processor.ts:791:32
 
 function stringArray(value: unknown): readonly string[] | undefined {
   if (!Array.isArray(value)) return undefined;
-  const strings = value.filter((item): item is string => isNonEmptyString(item));
+  const strings = value.filter(() => undefined);
   return strings.length > 0 ? strings : undefined;
 }

[Survived] EqualityOperator
domain/src/submission/submission-processor.ts:792:10
 function stringArray(value: unknown): readonly string[] | undefined {
   if (!Array.isArray(value)) return undefined;
   const strings = value.filter((item): item is string => isNonEmptyString(item));
-  return strings.length > 0 ? strings : undefined;
+  return strings.length >= 0 ? strings : undefined;
 }
 

[Survived] ConditionalExpression
domain/src/submission/submission-processor.ts:792:10
 function stringArray(value: unknown): readonly string[] | undefined {
   if (!Array.isArray(value)) return undefined;
   const strings = value.filter((item): item is string => isNonEmptyString(item));
-  return strings.length > 0 ? strings : undefined;
+  return true ? strings : undefined;
 }
 

[Survived] LogicalOperator
domain/src/submission/submission-processor.ts:799:10
   values: readonly TValue[],
   candidate: unknown,
 ): candidate is TValue {
-  return typeof candidate === 'string' && values.includes(candidate as TValue);
+  return typeof candidate === 'string' || values.includes(candidate as TValue);
 }
 

[Survived] Regex
domain/src/submission/submission-processor.ts:808:5
 
 function isUuid(value: unknown): value is string {
   return typeof value === 'string' &&
-    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
+    /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][^0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/iu.test(value);
 }
 
