[Survived] StringLiteral
domain/src/returns/xml-tree.ts:9:17
     readonly code = 'ESOCIAL_RETURN_XML_PARSE_FAILED',
   ) {
     super(message);
-    this.name = 'ReturnXmlParseError';
+    this.name = "";
   }
 }

[Survived] Regex
domain/src/returns/xml-tree.ts:29:22
   text: string;
 };
 
-const NAME_PATTERN = /^([^\s/>]+)/u;
+const NAME_PATTERN = /^([^\s/>])/u;
 
 export function parseReturnXmlDocument(

[Survived] Regex
domain/src/returns/xml-tree.ts:29:22
   text: string;
 };
 
-const NAME_PATTERN = /^([^\s/>]+)/u;
+const NAME_PATTERN = /^([^\S/>]+)/u;
 
 export function parseReturnXmlDocument(

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:39:47
     assertHardenedXml(xml);
     return parseXml(xml);
   } catch (error) {
-    if (error instanceof ReturnXmlParseError) {
-      throw new ReturnXmlParseError(`Invalid ${label} XML: ${error.message}`);
-    }
+    if (error instanceof ReturnXmlParseError) {}
     if (error instanceof Error) {
       throw new ReturnXmlParseError(`Invalid ${label} XML: ${error.message}`);

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:42:33
     if (error instanceof ReturnXmlParseError) {
       throw new ReturnXmlParseError(`Invalid ${label} XML: ${error.message}`);
     }
-    if (error instanceof Error) {
-      throw new ReturnXmlParseError(`Invalid ${label} XML: ${error.message}`);
-    }
+    if (error instanceof Error) {}
     throw new ReturnXmlParseError(`Invalid ${label} XML.`);
   }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:45:35
     if (error instanceof Error) {
       throw new ReturnXmlParseError(`Invalid ${label} XML: ${error.message}`);
     }
-    throw new ReturnXmlParseError(`Invalid ${label} XML.`);
+    throw new ReturnXmlParseError(``);
   }
 }

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:53:44
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode | null {
-  return descendants(node).find((child) => child.localName === localName) ?? null;
+  return descendants(node).find((child) => true) ?? null;
 }
 

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:53:44
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode | null {
-  return descendants(node).find((child) => child.localName === localName) ?? null;
+  return descendants(node).find((child) => child.localName !== localName) ?? null;
 }
 

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:60:46
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode[] {
-  return descendants(node).filter((child) => child.localName === localName);
+  return descendants(node).filter((child) => child.localName !== localName);
 }
 

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:60:46
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode[] {
-  return descendants(node).filter((child) => child.localName === localName);
+  return descendants(node).filter((child) => false);
 }
 

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:66:20
 export function directChildElements(
   node: ReturnXmlNode,
   localName: string,
-): ReturnXmlNode[] {
-  return node.children.filter((child) => child.localName === localName);
-}
+): ReturnXmlNode[] {}
 
 export function directChildElement(

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:67:42
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode[] {
-  return node.children.filter((child) => child.localName === localName);
+  return node.children.filter((child) => true);
 }
 

[Survived] ArrowFunction
domain/src/returns/xml-tree.ts:67:31
   node: ReturnXmlNode,
   localName: string,
 ): ReturnXmlNode[] {
-  return node.children.filter((child) => child.localName === localName);
+  return node.children.filter(() => undefined);
 }
 

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:80:18
 export function firstOptionalText(
   node: ReturnXmlNode,
   localName: string,
-): string | null {
-  const selected = firstElement(node, localName);
-  const value = selected ? textContent(selected).trim() : '';
-  return value || null;
-}
+): string | null {}
 
 export function firstText(node: ReturnXmlNode, localName: string): string {

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:82:28
   localName: string,
 ): string | null {
   const selected = firstElement(node, localName);
-  const value = selected ? textContent(selected).trim() : '';
+  const value = selected ? textContent(selected) : '';
   return value || null;
 }

[Survived] LogicalOperator
domain/src/returns/xml-tree.ts:83:10
 ): string | null {
   const selected = firstElement(node, localName);
   const value = selected ? textContent(selected).trim() : '';
-  return value || null;
+  return value && null;
 }
 

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:89:35
 export function firstText(node: ReturnXmlNode, localName: string): string {
   const value = firstOptionalText(node, localName);
   if (!value) {
-    throw new ReturnXmlParseError(`eSocial return is missing ${localName}`);
+    throw new ReturnXmlParseError(``);
   }
   return value;

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:99:28
   localName: string,
 ): string | null {
   const selected = directChildElement(node, localName);
-  const value = selected ? textContent(selected).trim() : '';
+  const value = selected ? textContent(selected) : '';
   return value || null;
 }

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:107:18
   node: ReturnXmlNode,
   name: string,
 ): string | null {
-  const direct = node.attributes[name]?.trim();
+  const direct = node.attributes[name];
   if (direct) return direct;
 

[Survived] OptionalChaining
domain/src/returns/xml-tree.ts:110:17
   const direct = node.attributes[name]?.trim();
   if (direct) return direct;
 
-  const local = Object.entries(node.attributes).find(
-    ([attributeName]) => localName(attributeName) === name,
-  )?.[1]?.trim();
+  const local = Object.entries(node.attributes).find(([attributeName]) => localName(attributeName) === name)?.[1].trim();
   return local || null;
 }

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:110:17
   const direct = node.attributes[name]?.trim();
   if (direct) return direct;
 
-  const local = Object.entries(node.attributes).find(
-    ([attributeName]) => localName(attributeName) === name,
-  )?.[1]?.trim();
+  const local = Object.entries(node.attributes).find(([attributeName]) => localName(attributeName) === name)?.[1];
   return local || null;
 }

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:111:26
   if (direct) return direct;
 
   const local = Object.entries(node.attributes).find(
-    ([attributeName]) => localName(attributeName) === name,
+    ([attributeName]) => localName(attributeName) !== name,
   )?.[1]?.trim();
   return local || null;

[Survived] ArrowFunction
domain/src/returns/xml-tree.ts:111:5
   if (direct) return direct;
 
   const local = Object.entries(node.attributes).find(
-    ([attributeName]) => localName(attributeName) === name,
+    () => undefined,
   )?.[1]?.trim();
   return local || null;

[Survived] ArrowFunction
domain/src/returns/xml-tree.ts:119:26
 export function textContent(node: ReturnXmlNode): string {
   return [
     node.text,
-    ...node.children.map((child) => textContent(child)),
+    ...node.children.map(() => undefined),
   ].join('');
 }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:120:10
   return [
     node.text,
     ...node.children.map((child) => textContent(child)),
-  ].join('');
+  ].join("Stryker was here!");
 }
 

[Survived] ArrowFunction
domain/src/returns/xml-tree.ts:125:10
 
 export function serializeXmlNode(node: ReturnXmlNode): string {
   const attributes = Object.entries(node.attributes)
-    .map(([name, value]) => ` ${name}="${escapeAttribute(value)}"`)
+    .map(() => undefined)
     .join('');
   const children = node.children.map((child) => serializeXmlNode(child)).join('');

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:125:29
 
 export function serializeXmlNode(node: ReturnXmlNode): string {
   const attributes = Object.entries(node.attributes)
-    .map(([name, value]) => ` ${name}="${escapeAttribute(value)}"`)
+    .map(([name, value]) => ``)
     .join('');
   const children = node.children.map((child) => serializeXmlNode(child)).join('');

[Survived] ArrowFunction
domain/src/returns/xml-tree.ts:127:38
   const attributes = Object.entries(node.attributes)
     .map(([name, value]) => ` ${name}="${escapeAttribute(value)}"`)
     .join('');
-  const children = node.children.map((child) => serializeXmlNode(child)).join('');
+  const children = node.children.map(() => undefined).join('');
   const text = escapeText(node.text);
   return `<${node.name}${attributes}>${text}${children}</${node.name}>`;

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:137:10
   let root: MutableReturnXmlNode | undefined;
   let index = 0;
 
-  while (index < xml.length) {
+  while (index >= xml.length) {
     const open = xml.indexOf('<', index);
     if (open === -1) {

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:137:10
   let root: MutableReturnXmlNode | undefined;
   let index = 0;
 
-  while (index < xml.length) {
+  while (index <= xml.length) {
     const open = xml.indexOf('<', index);
     if (open === -1) {

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:138:30
   let index = 0;
 
   while (index < xml.length) {
-    const open = xml.indexOf('<', index);
+    const open = xml.indexOf("", index);
     if (open === -1) {
       appendText(stack, decodeXmlEntities(xml.slice(index)));

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:139:22
 
   while (index < xml.length) {
     const open = xml.indexOf('<', index);
-    if (open === -1) {
-      appendText(stack, decodeXmlEntities(xml.slice(index)));
-      break;
-    }
+    if (open === -1) {}
 
     appendText(stack, decodeXmlEntities(xml.slice(index, open)));

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:139:9
 
   while (index < xml.length) {
     const open = xml.indexOf('<', index);
-    if (open === -1) {
+    if (open !== -1) {
       appendText(stack, decodeXmlEntities(xml.slice(index)));
       break;

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:140:43
   while (index < xml.length) {
     const open = xml.indexOf('<', index);
     if (open === -1) {
-      appendText(stack, decodeXmlEntities(xml.slice(index)));
+      appendText(stack, decodeXmlEntities(xml));
       break;
     }

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:144:41
       break;
     }
 
-    appendText(stack, decodeXmlEntities(xml.slice(index, open)));
+    appendText(stack, decodeXmlEntities(xml));
 
     if (xml.startsWith('<!--', open)) {

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:146:9
 
     appendText(stack, decodeXmlEntities(xml.slice(index, open)));
 
-    if (xml.startsWith('<!--', open)) {
+    if (xml.endsWith('<!--', open)) {
       index = skipUntil(xml, '-->', open + 4, 'comment');
       continue;

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:146:9
 
     appendText(stack, decodeXmlEntities(xml.slice(index, open)));
 
-    if (xml.startsWith('<!--', open)) {
+    if (false) {
       index = skipUntil(xml, '-->', open + 4, 'comment');
       continue;

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:147:37
     appendText(stack, decodeXmlEntities(xml.slice(index, open)));
 
     if (xml.startsWith('<!--', open)) {
-      index = skipUntil(xml, '-->', open + 4, 'comment');
+      index = skipUntil(xml, '-->', open - 4, 'comment');
       continue;
     }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:147:30
     appendText(stack, decodeXmlEntities(xml.slice(index, open)));
 
     if (xml.startsWith('<!--', open)) {
-      index = skipUntil(xml, '-->', open + 4, 'comment');
+      index = skipUntil(xml, "", open + 4, 'comment');
       continue;
     }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:151:44
       continue;
     }
 
-    if (xml.startsWith('<![CDATA[', open)) {
-      const close = xml.indexOf(']]>', open + 9);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
-      appendText(stack, xml.slice(open + 9, close));
-      index = close + 3;
-      continue;
-    }
+    if (xml.startsWith('<![CDATA[', open)) {}
 
     if (xml.startsWith('<?', open)) {

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:151:9
       continue;
     }
 
-    if (xml.startsWith('<![CDATA[', open)) {
+    if (xml.endsWith('<![CDATA[', open)) {
       const close = xml.indexOf(']]>', open + 9);
       if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:152:40
     }
 
     if (xml.startsWith('<![CDATA[', open)) {
-      const close = xml.indexOf(']]>', open + 9);
+      const close = xml.indexOf(']]>', open - 9);
       if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
       appendText(stack, xml.slice(open + 9, close));

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:153:11
 
     if (xml.startsWith('<![CDATA[', open)) {
       const close = xml.indexOf(']]>', open + 9);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
+      if (true) throw new ReturnXmlParseError('Unclosed CDATA section.');
       appendText(stack, xml.slice(open + 9, close));
       index = close + 3;

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:153:21
 
     if (xml.startsWith('<![CDATA[', open)) {
       const close = xml.indexOf(']]>', open + 9);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
+      if (close === +1) throw new ReturnXmlParseError('Unclosed CDATA section.');
       appendText(stack, xml.slice(open + 9, close));
       index = close + 3;

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:154:35
     if (xml.startsWith('<![CDATA[', open)) {
       const close = xml.indexOf(']]>', open + 9);
       if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
-      appendText(stack, xml.slice(open + 9, close));
+      appendText(stack, xml.slice(open - 9, close));
       index = close + 3;
       continue;

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:154:25
     if (xml.startsWith('<![CDATA[', open)) {
       const close = xml.indexOf(']]>', open + 9);
       if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
-      appendText(stack, xml.slice(open + 9, close));
+      appendText(stack, xml);
       index = close + 3;
       continue;

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:155:15
       const close = xml.indexOf(']]>', open + 9);
       if (close === -1) throw new ReturnXmlParseError('Unclosed CDATA section.');
       appendText(stack, xml.slice(open + 9, close));
-      index = close + 3;
+      index = close - 3;
       continue;
     }

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:159:9
       continue;
     }
 
-    if (xml.startsWith('<?', open)) {
+    if (xml.endsWith('<?', open)) {
       index = skipUntil(xml, '?>', open + 2, 'processing instruction');
       continue;

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:159:37
       continue;
     }
 
-    if (xml.startsWith('<?', open)) {
-      index = skipUntil(xml, '?>', open + 2, 'processing instruction');
-      continue;
-    }
+    if (xml.startsWith('<?', open)) {}
 
     if (xml.startsWith('</', open)) {

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:160:36
     }
 
     if (xml.startsWith('<?', open)) {
-      index = skipUntil(xml, '?>', open + 2, 'processing instruction');
+      index = skipUntil(xml, '?>', open - 2, 'processing instruction');
       continue;
     }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:164:37
       continue;
     }
 
-    if (xml.startsWith('</', open)) {
-      const close = xml.indexOf('>', open + 2);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
-      const name = xml.slice(open + 2, close).trim();
-      const current = stack.pop();
-      if (!current) {
-        throw new ReturnXmlParseError(`Unexpected closing tag ${name}.`);
-      }
-      if (current.name !== name) {
-        throw new ReturnXmlParseError(
-          `Mismatched closing tag ${name}; expected ${current.name}.`,
-        );
-      }
-      index = close + 1;
-      continue;
-    }
+    if (xml.startsWith('</', open)) {}
 
     if (xml.startsWith('<!', open)) {

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:164:9
       continue;
     }
 
-    if (xml.startsWith('</', open)) {
+    if (xml.endsWith('</', open)) {
       const close = xml.indexOf('>', open + 2);
       if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:165:38
     }
 
     if (xml.startsWith('</', open)) {
-      const close = xml.indexOf('>', open + 2);
+      const close = xml.indexOf('>', open - 2);
       if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
       const name = xml.slice(open + 2, close).trim();

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:166:21
 
     if (xml.startsWith('</', open)) {
       const close = xml.indexOf('>', open + 2);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
+      if (close === +1) throw new ReturnXmlParseError('Unclosed closing tag.');
       const name = xml.slice(open + 2, close).trim();
       const current = stack.pop();

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:166:11
 
     if (xml.startsWith('</', open)) {
       const close = xml.indexOf('>', open + 2);
-      if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
+      if (close !== -1) throw new ReturnXmlParseError('Unclosed closing tag.');
       const name = xml.slice(open + 2, close).trim();
       const current = stack.pop();

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:167:20
     if (xml.startsWith('</', open)) {
       const close = xml.indexOf('>', open + 2);
       if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
-      const name = xml.slice(open + 2, close).trim();
+      const name = xml.slice(open + 2, close);
       const current = stack.pop();
       if (!current) {

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:167:20
     if (xml.startsWith('</', open)) {
       const close = xml.indexOf('>', open + 2);
       if (close === -1) throw new ReturnXmlParseError('Unclosed closing tag.');
-      const name = xml.slice(open + 2, close).trim();
+      const name = xml.trim();
       const current = stack.pop();
       if (!current) {

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:172:11
       if (!current) {
         throw new ReturnXmlParseError(`Unexpected closing tag ${name}.`);
       }
-      if (current.name !== name) {
+      if (true) {
         throw new ReturnXmlParseError(
           `Mismatched closing tag ${name}; expected ${current.name}.`,

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:172:34
       if (!current) {
         throw new ReturnXmlParseError(`Unexpected closing tag ${name}.`);
       }
-      if (current.name !== name) {
-        throw new ReturnXmlParseError(
-          `Mismatched closing tag ${name}; expected ${current.name}.`,
-        );
-      }
+      if (current.name !== name) {}
       index = close + 1;
       continue;

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:177:15
           `Mismatched closing tag ${name}; expected ${current.name}.`,
         );
       }
-      index = close + 1;
+      index = close - 1;
       continue;
     }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:181:37
       continue;
     }
 
-    if (xml.startsWith('<!', open)) {
-      throw new ReturnXmlParseError('Unsupported XML declaration.');
-    }
+    if (xml.startsWith('<!', open)) {}
 
     const close = findTagEnd(xml, open + 1);

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:181:9
       continue;
     }
 
-    if (xml.startsWith('<!', open)) {
+    if (false) {
       throw new ReturnXmlParseError('Unsupported XML declaration.');
     }

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:185:35
       throw new ReturnXmlParseError('Unsupported XML declaration.');
     }
 
-    const close = findTagEnd(xml, open + 1);
+    const close = findTagEnd(xml, open - 1);
     const rawTag = xml.slice(open + 1, close).trim();
     const selfClosing = rawTag.endsWith('/');

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:186:30
     }
 
     const close = findTagEnd(xml, open + 1);
-    const rawTag = xml.slice(open + 1, close).trim();
+    const rawTag = xml.slice(open - 1, close).trim();
     const selfClosing = rawTag.endsWith('/');
     const tag = selfClosing ? rawTag.slice(0, -1).trim() : rawTag;

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:186:20
     }
 
     const close = findTagEnd(xml, open + 1);
-    const rawTag = xml.slice(open + 1, close).trim();
+    const rawTag = xml.trim();
     const selfClosing = rawTag.endsWith('/');
     const tag = selfClosing ? rawTag.slice(0, -1).trim() : rawTag;

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:187:25
 
     const close = findTagEnd(xml, open + 1);
     const rawTag = xml.slice(open + 1, close).trim();
-    const selfClosing = rawTag.endsWith('/');
+    const selfClosing = rawTag.startsWith('/');
     const tag = selfClosing ? rawTag.slice(0, -1).trim() : rawTag;
     const name = tag.match(NAME_PATTERN)?.[1];

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:188:31
     const close = findTagEnd(xml, open + 1);
     const rawTag = xml.slice(open + 1, close).trim();
     const selfClosing = rawTag.endsWith('/');
-    const tag = selfClosing ? rawTag.slice(0, -1).trim() : rawTag;
+    const tag = selfClosing ? rawTag.trim() : rawTag;
     const name = tag.match(NAME_PATTERN)?.[1];
     if (!name) throw new ReturnXmlParseError('Tag name is missing.');

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:188:31
     const close = findTagEnd(xml, open + 1);
     const rawTag = xml.slice(open + 1, close).trim();
     const selfClosing = rawTag.endsWith('/');
-    const tag = selfClosing ? rawTag.slice(0, -1).trim() : rawTag;
+    const tag = selfClosing ? rawTag.slice(0, -1) : rawTag;
     const name = tag.match(NAME_PATTERN)?.[1];
     if (!name) throw new ReturnXmlParseError('Tag name is missing.');

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:195:35
     const node: MutableReturnXmlNode = {
       name,
       localName: localName(name),
-      attributes: parseAttributes(tag.slice(name.length)),
+      attributes: parseAttributes(tag),
       children: [],
       text: '',

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:200:29
       text: '',
     };
 
-    const parent = stack.at(-1);
+    const parent = stack.at(+1);
     if (parent) {
       parent.children.push(node);

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:201:17
     };
 
     const parent = stack.at(-1);
-    if (parent) {
-      parent.children.push(node);
-    } else if (!root) {
+    if (parent) {} else if (!root) {
       root = node;
     } else {

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:203:23
     const parent = stack.at(-1);
     if (parent) {
       parent.children.push(node);
-    } else if (!root) {
-      root = node;
-    } else {
+    } else if (!root) {} else {
       throw new ReturnXmlParseError('XML document has multiple root elements.');
     }

[Survived] BooleanLiteral
domain/src/returns/xml-tree.ts:203:16
     const parent = stack.at(-1);
     if (parent) {
       parent.children.push(node);
-    } else if (!root) {
+    } else if (root) {
       root = node;
     } else {

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:205:12
       parent.children.push(node);
     } else if (!root) {
       root = node;
-    } else {
-      throw new ReturnXmlParseError('XML document has multiple root elements.');
-    }
+    } else {}
 
     if (!selfClosing) stack.push(node);

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:209:9
       throw new ReturnXmlParseError('XML document has multiple root elements.');
     }
 
-    if (!selfClosing) stack.push(node);
+    if (false) stack.push(node);
     index = close + 1;
   }

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:209:9
       throw new ReturnXmlParseError('XML document has multiple root elements.');
     }
 
-    if (!selfClosing) stack.push(node);
+    if (true) stack.push(node);
     index = close + 1;
   }

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:210:13
     }
 
     if (!selfClosing) stack.push(node);
-    index = close + 1;
+    index = close - 1;
   }
 

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:213:7
     index = close + 1;
   }
 
-  if (stack.length > 0) {
+  if (stack.length >= 0) {
     throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
   }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:213:25
     index = close + 1;
   }
 
-  if (stack.length > 0) {
-    throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
-  }
+  if (stack.length > 0) {}
   if (!root) throw new ReturnXmlParseError('XML document is empty.');
   return freezeNode(root);

[Survived] OptionalChaining
domain/src/returns/xml-tree.ts:214:51
   }
 
   if (stack.length > 0) {
-    throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
+    throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1).name ?? ''}.`);
   }
   if (!root) throw new ReturnXmlParseError('XML document is empty.');

[Survived] LogicalOperator
domain/src/returns/xml-tree.ts:214:51
   }
 
   if (stack.length > 0) {
-    throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
+    throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name && ''}.`);
   }
   if (!root) throw new ReturnXmlParseError('XML document is empty.');

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:216:7
   if (stack.length > 0) {
     throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
   }
-  if (!root) throw new ReturnXmlParseError('XML document is empty.');
+  if (false) throw new ReturnXmlParseError('XML document is empty.');
   return freezeNode(root);
 }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:216:44
   if (stack.length > 0) {
     throw new ReturnXmlParseError(`Unclosed tag ${stack.at(-1)?.name ?? ''}.`);
   }
-  if (!root) throw new ReturnXmlParseError('XML document is empty.');
+  if (!root) throw new ReturnXmlParseError("");
   return freezeNode(root);
 }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:220:73
   return freezeNode(root);
 }
 
-function appendText(stack: MutableReturnXmlNode[], value: string): void {
-  if (!value) return;
-  const current = stack.at(-1);
-  if (current) current.text += value;
-  if (!current && value.trim().length > 0) {
-    throw new ReturnXmlParseError('Text is not allowed outside the root element.');
-  }
-}
+function appendText(stack: MutableReturnXmlNode[], value: string): void {}
 
 function skipUntil(

[Survived] BooleanLiteral
domain/src/returns/xml-tree.ts:221:7
 }
 
 function appendText(stack: MutableReturnXmlNode[], value: string): void {
-  if (!value) return;
+  if (value) return;
   const current = stack.at(-1);
   if (current) current.text += value;

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:221:7
 }
 
 function appendText(stack: MutableReturnXmlNode[], value: string): void {
-  if (!value) return;
+  if (false) return;
   const current = stack.at(-1);
   if (current) current.text += value;

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:222:28
 
 function appendText(stack: MutableReturnXmlNode[], value: string): void {
   if (!value) return;
-  const current = stack.at(-1);
+  const current = stack.at(+1);
   if (current) current.text += value;
   if (!current && value.trim().length > 0) {

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:224:19
   if (!value) return;
   const current = stack.at(-1);
   if (current) current.text += value;
-  if (!current && value.trim().length > 0) {
+  if (!current && true) {
     throw new ReturnXmlParseError('Text is not allowed outside the root element.');
   }

[Survived] LogicalOperator
domain/src/returns/xml-tree.ts:224:7
   if (!value) return;
   const current = stack.at(-1);
   if (current) current.text += value;
-  if (!current && value.trim().length > 0) {
+  if (!current || value.trim().length > 0) {
     throw new ReturnXmlParseError('Text is not allowed outside the root element.');
   }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:234:11
   marker: string,
   from: number,
   label: string,
-): number {
-  const close = xml.indexOf(marker, from);
-  if (close === -1) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
-  return close + marker.length;
-}
+): number {}
 
 function findTagEnd(xml: string, from: number): number {

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:236:7
   label: string,
 ): number {
   const close = xml.indexOf(marker, from);
-  if (close === -1) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
+  if (true) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
   return close + marker.length;
 }
