[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:236:7
   label: string,
 ): number {
   const close = xml.indexOf(marker, from);
-  if (close === -1) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
+  if (false) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
   return close + marker.length;
 }

[Survived] ArithmeticOperator
domain/src/returns/xml-tree.ts:237:10
 ): number {
   const close = xml.indexOf(marker, from);
   if (close === -1) throw new ReturnXmlParseError(`Unclosed XML ${label}.`);
-  return close + marker.length;
+  return close - marker.length;
 }
 

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:240:56
   return close + marker.length;
 }
 
-function findTagEnd(xml: string, from: number): number {
-  let quote: '"' | "'" | null = null;
-  for (let index = from; index < xml.length; index += 1) {
-    const char = xml[index];
-    if ((char === '"' || char === "'") && quote === null) {
-      quote = char;
-      continue;
-    }
-    if (char === quote) {
-      quote = null;
-      continue;
-    }
-    if (char === '>' && quote === null) return index;
-  }
-  throw new ReturnXmlParseError('Unclosed opening tag.');
-}
+function findTagEnd(xml: string, from: number): number {}
 
 function parseAttributes(source: string): Record<string, string> {

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:242:26
 
 function findTagEnd(xml: string, from: number): number {
   let quote: '"' | "'" | null = null;
-  for (let index = from; index < xml.length; index += 1) {
+  for (let index = from; index <= xml.length; index += 1) {
     const char = xml[index];
     if ((char === '"' || char === "'") && quote === null) {

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:242:58
 
 function findTagEnd(xml: string, from: number): number {
   let quote: '"' | "'" | null = null;
-  for (let index = from; index < xml.length; index += 1) {
-    const char = xml[index];
-    if ((char === '"' || char === "'") && quote === null) {
-      quote = char;
-      continue;
-    }
-    if (char === quote) {
-      quote = null;
-      continue;
-    }
-    if (char === '>' && quote === null) return index;
-  }
+  for (let index = from; index < xml.length; index += 1) {}
   throw new ReturnXmlParseError('Unclosed opening tag.');
 }

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:244:26
   let quote: '"' | "'" | null = null;
   for (let index = from; index < xml.length; index += 1) {
     const char = xml[index];
-    if ((char === '"' || char === "'") && quote === null) {
+    if ((char === '"' || false) && quote === null) {
       quote = char;
       continue;

[Survived] EqualityOperator
domain/src/returns/xml-tree.ts:244:43
   let quote: '"' | "'" | null = null;
   for (let index = from; index < xml.length; index += 1) {
     const char = xml[index];
-    if ((char === '"' || char === "'") && quote === null) {
+    if ((char === '"' || char === "'") && quote !== null) {
       quote = char;
       continue;

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:248:9
       quote = char;
       continue;
     }
-    if (char === quote) {
+    if (false) {
       quote = null;
       continue;

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:248:9
       quote = char;
       continue;
     }
-    if (char === quote) {
+    if (true) {
       quote = null;
       continue;

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:252:25
       quote = null;
       continue;
     }
-    if (char === '>' && quote === null) return index;
+    if (char === '>' && true) return index;
   }
   throw new ReturnXmlParseError('Unclosed opening tag.');

[Survived] LogicalOperator
domain/src/returns/xml-tree.ts:252:9
       quote = null;
       continue;
     }
-    if (char === '>' && quote === null) return index;
+    if (char === '>' || quote === null) return index;
   }
   throw new ReturnXmlParseError('Unclosed opening tag.');

[Survived] Regex
domain/src/returns/xml-tree.ts:259:19
 
 function parseAttributes(source: string): Record<string, string> {
   const attributes: Record<string, string> = {};
-  const pattern = /([^\s=]+)\s*=\s*(?:"([^"]*)"|'([^']*)')/gu;
+  const pattern = /([^\s=]+)\s=\s*(?:"([^"]*)"|'([^']*)')/gu;
   for (const match of source.matchAll(pattern)) {
     attributes[match[1]!] = decodeXmlEntities(match[2] ?? match[3] ?? '');

[Survived] Regex
domain/src/returns/xml-tree.ts:259:19
 
 function parseAttributes(source: string): Record<string, string> {
   const attributes: Record<string, string> = {};
-  const pattern = /([^\s=]+)\s*=\s*(?:"([^"]*)"|'([^']*)')/gu;
+  const pattern = /([^\s=]+)\s*=\s*(?:"([^"]*)"|'([^'])')/gu;
   for (const match of source.matchAll(pattern)) {
     attributes[match[1]!] = decodeXmlEntities(match[2] ?? match[3] ?? '');

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:260:49
 function parseAttributes(source: string): Record<string, string> {
   const attributes: Record<string, string> = {};
   const pattern = /([^\s=]+)\s*=\s*(?:"([^"]*)"|'([^']*)')/gu;
-  for (const match of source.matchAll(pattern)) {
-    attributes[match[1]!] = decodeXmlEntities(match[2] ?? match[3] ?? '');
-  }
+  for (const match of source.matchAll(pattern)) {}
   return attributes;
 }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:261:71
   const attributes: Record<string, string> = {};
   const pattern = /([^\s=]+)\s*=\s*(?:"([^"]*)"|'([^']*)')/gu;
   for (const match of source.matchAll(pattern)) {
-    attributes[match[1]!] = decodeXmlEntities(match[2] ?? match[3] ?? '');
+    attributes[match[1]!] = decodeXmlEntities(match[2] ?? match[3] ?? "Stryker was here!");
   }
   return attributes;

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:281:50
 }
 
 function localName(name: string): string {
-  return name.includes(':') ? name.split(':').at(-1)! : name;
+  return name.includes(':') ? name.split(':').at(+1)! : name;
 }
 

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:281:24
 }
 
 function localName(name: string): string {
-  return name.includes(':') ? name.split(':').at(-1)! : name;
+  return name.includes("") ? name.split(':').at(-1)! : name;
 }
 

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:284:51
   return name.includes(':') ? name.split(':').at(-1)! : name;
 }
 
-function decodeXmlEntities(value: string): string {
-  return value.replace(
-    /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]+) | undefined;/giu,
-    (entity) => {
-      switch (entity) {
-        case '&amp;':
-          return '&';
-        case '&lt;':
-          return '<';
-        case '&gt;':
-          return '>';
-        case '&quot;':
-          return '"';
-        case '&apos;':
-          return "'";
-        default:
-          if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
-            return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
-          }
-          return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));
-      }
-    },
-  );
-}
+function decodeXmlEntities(value: string): string {}
 
 function escapeText(value: string): string {

[Survived] Regex
domain/src/returns/xml-tree.ts:286:5
 
 function decodeXmlEntities(value: string): string {
   return value.replace(
-    /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]+) | undefined;/giu,
+    /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[^0-9a-f]+) | undefined;/giu,
     (entity) => {
       switch (entity) {

[Survived] Regex
domain/src/returns/xml-tree.ts:286:5
 
 function decodeXmlEntities(value: string): string {
   return value.replace(
-    /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]+) | undefined;/giu,
+    /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]) | undefined;/giu,
     (entity) => {
       switch (entity) {

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:289:9
     /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]+) | undefined;/giu,
     (entity) => {
       switch (entity) {
-        case '&amp;':
-          return '&';
+        case '&amp;':
         case '&lt;':
           return '<';

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:289:14
     /&(?:amp|lt|gt|quot|apos|#[0-9]+|#x[0-9a-f]+) | undefined;/giu,
     (entity) => {
       switch (entity) {
-        case '&amp;':
+        case "":
           return '&';
         case '&lt;':

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:290:18
     (entity) => {
       switch (entity) {
         case '&amp;':
-          return '&';
+          return "";
         case '&lt;':
           return '<';

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:291:9
       switch (entity) {
         case '&amp;':
           return '&';
-        case '&lt;':
-          return '<';
+        case '&lt;':
         case '&gt;':
           return '>';

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:293:9
           return '&';
         case '&lt;':
           return '<';
-        case '&gt;':
-          return '>';
+        case '&gt;':
         case '&quot;':
           return '"';

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:293:14
           return '&';
         case '&lt;':
           return '<';
-        case '&gt;':
+        case "":
           return '>';
         case '&quot;':

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:294:18
         case '&lt;':
           return '<';
         case '&gt;':
-          return '>';
+          return "";
         case '&quot;':
           return '"';

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:295:9
           return '<';
         case '&gt;':
           return '>';
-        case '&quot;':
-          return '"';
+        case '&quot;':
         case '&apos;':
           return "'";

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:295:14
           return '<';
         case '&gt;':
           return '>';
-        case '&quot;':
+        case "":
           return '"';
         case '&apos;':

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:296:18
         case '&gt;':
           return '>';
         case '&quot;':
-          return '"';
+          return "";
         case '&apos;':
           return "'";

[Survived] ConditionalExpression
domain/src/returns/xml-tree.ts:297:9
           return '>';
         case '&quot;':
           return '"';
-        case '&apos;':
-          return "'";
+        case '&apos;':
         default:
           if (entity.startsWith('&#x') || entity.startsWith('&#X')) {

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:297:14
           return '>';
         case '&quot;':
           return '"';
-        case '&apos;':
+        case "":
           return "'";
         default:

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:300:43
         case '&apos;':
           return "'";
         default:
-          if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
+          if (entity.startsWith('&#x') || entity.endsWith('&#X')) {
             return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
           }

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:300:69
         case '&apos;':
           return "'";
         default:
-          if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
-            return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
-          }
+          if (entity.startsWith('&#x') || entity.startsWith('&#X')) {}
           return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));
       }

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:301:73
           return "'";
         default:
           if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
-            return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
+            return String.fromCodePoint(Number.parseInt(entity.slice(3, +1), 16));
           }
           return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:301:57
           return "'";
         default:
           if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
-            return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
+            return String.fromCodePoint(Number.parseInt(entity, 16));
           }
           return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));

[Survived] MethodExpression
domain/src/returns/xml-tree.ts:303:55
           if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
             return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
           }
-          return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));
+          return String.fromCodePoint(Number.parseInt(entity, 10));
       }
     },

[Survived] UnaryOperator
domain/src/returns/xml-tree.ts:303:71
           if (entity.startsWith('&#x') || entity.startsWith('&#X')) {
             return String.fromCodePoint(Number.parseInt(entity.slice(3, -1), 16));
           }
-          return String.fromCodePoint(Number.parseInt(entity.slice(2, -1), 10));
+          return String.fromCodePoint(Number.parseInt(entity.slice(2, +1), 10));
       }
     },

[Survived] BlockStatement
domain/src/returns/xml-tree.ts:309:44
   );
 }
 
-function escapeText(value: string): string {
-  return value
-    .replaceAll('&', '&amp;')
-    .replaceAll('<', '&lt;')
-    .replaceAll('>', '&gt;');
-}
+function escapeText(value: string): string {}
 
 function escapeAttribute(value: string): string {

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:311:22
 
 function escapeText(value: string): string {
   return value
-    .replaceAll('&', '&amp;')
+    .replaceAll('&', "")
     .replaceAll('<', '&lt;')
     .replaceAll('>', '&gt;');

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:311:17
 
 function escapeText(value: string): string {
   return value
-    .replaceAll('&', '&amp;')
+    .replaceAll("", '&amp;')
     .replaceAll('<', '&lt;')
     .replaceAll('>', '&gt;');

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:312:22
 function escapeText(value: string): string {
   return value
     .replaceAll('&', '&amp;')
-    .replaceAll('<', '&lt;')
+    .replaceAll('<', "")
     .replaceAll('>', '&gt;');
 }

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:317:39
 }
 
 function escapeAttribute(value: string): string {
-  return escapeText(value).replaceAll('"', '&quot;');
+  return escapeText(value).replaceAll("", '&quot;');
 }
 

[Survived] StringLiteral
domain/src/returns/xml-tree.ts:317:44
 }
 
 function escapeAttribute(value: string): string {
-  return escapeText(value).replaceAll('"', '&quot;');
+  return escapeText(value).replaceAll('"', "");
 }
 
